[Killed] BlockStatement
src/daemon.mjs:75:5
 // Read version from package.json (not hardcoded)
 const __daemon_dirname = path.dirname(fileURLToPath(import.meta.url));
 let PKG_VERSION = '0.4.0';
-try {
-  const require = createRequire(import.meta.url);
-  const pkg = require(path.join(__daemon_dirname, '..', 'package.json'));
-  PKG_VERSION = pkg.version || PKG_VERSION;
-} catch { /* fallback */ }
+try {} catch { /* fallback */ }
 
 // Force UTF-8 encoding on Windows (prevents Chinese/CJK text from becoming ????)
killedBy: All tests
statusReason: ▶ L4 E2E: Project isolation via X-Awareness-Project-Dir
  ✔ healthz is exempt from project validation (8.732667ms)

  ✔ matching project header passes through (2.583042ms)

  ✔ mismatching project header returns 409 (1.844167ms)

  ✔ no header (old client) still works (2.646583ms)

[Survived] StringLiteral
src/daemon.mjs:77:57
 let PKG_VERSION = '0.4.0';
 try {
   const require = createRequire(import.meta.url);
-  const pkg = require(path.join(__daemon_dirname, '..', 'package.json'));
+  const pkg = require(path.join(__daemon_dirname, '..', ""));
   PKG_VERSION = pkg.version || PKG_VERSION;
 } catch { /* fallback */ }

[Survived] ConditionalExpression
src/daemon.mjs:78:17
 try {
   const require = createRequire(import.meta.url);
   const pkg = require(path.join(__daemon_dirname, '..', 'package.json'));
-  PKG_VERSION = pkg.version || PKG_VERSION;
+  PKG_VERSION = true;
 } catch { /* fallback */ }
 

[Survived] LogicalOperator
src/daemon.mjs:78:17
 try {
   const require = createRequire(import.meta.url);
   const pkg = require(path.join(__daemon_dirname, '..', 'package.json'));
-  PKG_VERSION = pkg.version || PKG_VERSION;
+  PKG_VERSION = pkg.version && PKG_VERSION;
 } catch { /* fallback */ }
 

[Survived] ConditionalExpression
src/daemon.mjs:82:5
 } catch { /* fallback */ }
 
 // Force UTF-8 encoding on Windows (prevents Chinese/CJK text from becoming ????)
-if (process.platform === 'win32') {
+if (true) {
   try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
   try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }

[Survived] EqualityOperator
src/daemon.mjs:82:5
 } catch { /* fallback */ }
 
 // Force UTF-8 encoding on Windows (prevents Chinese/CJK text from becoming ????)
-if (process.platform === 'win32') {
+if (process.platform !== 'win32') {
   try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
   try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }

[Survived] BlockStatement
src/daemon.mjs:83:7
 
 // Force UTF-8 encoding on Windows (prevents Chinese/CJK text from becoming ????)
 if (process.platform === 'win32') {
-  try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
+  try {} catch { /* best-effort */ }
   try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }
   // Set LANG to ensure downstream tools respect UTF-8

[Survived] BlockStatement
src/daemon.mjs:84:7
 // Force UTF-8 encoding on Windows (prevents Chinese/CJK text from becoming ????)
 if (process.platform === 'win32') {
   try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
-  try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }
+  try {} catch { /* best-effort */ }
   // Set LANG to ensure downstream tools respect UTF-8
   process.env.LANG = process.env.LANG || 'en_US.UTF-8';

[Survived] ConditionalExpression
src/daemon.mjs:86:22
   try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
   try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }
   // Set LANG to ensure downstream tools respect UTF-8
-  process.env.LANG = process.env.LANG || 'en_US.UTF-8';
+  process.env.LANG = false;
 }
 

[Survived] ConditionalExpression
src/daemon.mjs:86:22
   try { process.stdout.setEncoding('utf8'); } catch { /* best-effort */ }
   try { process.stderr.setEncoding('utf8'); } catch { /* best-effort */ }
   // Set LANG to ensure downstream tools respect UTF-8
-  process.env.LANG = process.env.LANG || 'en_US.UTF-8';
+  process.env.LANG = true;
 }
 

[Survived] ArrayDeclaration
src/daemon.mjs:100:35
 // ---------------------------------------------------------------------------
 
 /** Eligible categories for F-034 crystallization detection */
-const _CRYST_CATEGORIES = new Set(['workflow', 'decision', 'problem_solution']);
+const _CRYST_CATEGORIES = new Set([]);
 
 /** Minimum similar pre-existing cards required to trigger a hint */

[Survived] StringLiteral
src/daemon.mjs:100:48
 // ---------------------------------------------------------------------------
 
 /** Eligible categories for F-034 crystallization detection */
-const _CRYST_CATEGORIES = new Set(['workflow', 'decision', 'problem_solution']);
+const _CRYST_CATEGORIES = new Set(['workflow', "", 'problem_solution']);
 
 /** Minimum similar pre-existing cards required to trigger a hint */

[Survived] ConditionalExpression
src/daemon.mjs:118:9
  */
 function _checkCrystallizationLocal(db, newCard) {
   try {
-    if (!_CRYST_CATEGORIES.has(newCard.category)) return null;
+    if (true) return null;
 
     // Build query terms from title + summary (first 120 chars)

[Survived] BooleanLiteral
src/daemon.mjs:118:9
  */
 function _checkCrystallizationLocal(db, newCard) {
   try {
-    if (!_CRYST_CATEGORIES.has(newCard.category)) return null;
+    if (_CRYST_CATEGORIES.has(newCard.category)) return null;
 
     // Build query terms from title + summary (first 120 chars)

[Survived] ConditionalExpression
src/daemon.mjs:121:44
     if (!_CRYST_CATEGORIES.has(newCard.category)) return null;
 
     // Build query terms from title + summary (first 120 chars)
-    const queryText = `${newCard.title} ${(newCard.summary || '').slice(0, 120)}`.trim();
+    const queryText = `${newCard.title} ${(false).slice(0, 120)}`.trim();
     if (queryText.length < 5) return null;
 

[Survived] ConditionalExpression
src/daemon.mjs:121:44
     if (!_CRYST_CATEGORIES.has(newCard.category)) return null;
 
     // Build query terms from title + summary (first 120 chars)
-    const queryText = `${newCard.title} ${(newCard.summary || '').slice(0, 120)}`.trim();
+    const queryText = `${newCard.title} ${(true).slice(0, 120)}`.trim();
     if (queryText.length < 5) return null;
 

[Survived] ConditionalExpression
src/daemon.mjs:122:9
 
     // Build query terms from title + summary (first 120 chars)
     const queryText = `${newCard.title} ${(newCard.summary || '').slice(0, 120)}`.trim();
-    if (queryText.length < 5) return null;
+    if (true) return null;
 
     // FTS5 trigram search — exclude the card itself, restrict to eligible categories

[Survived] ConditionalExpression
src/daemon.mjs:122:9
 
     // Build query terms from title + summary (first 120 chars)
     const queryText = `${newCard.title} ${(newCard.summary || '').slice(0, 120)}`.trim();
-    if (queryText.length < 5) return null;
+    if (false) return null;
 
     // FTS5 trigram search — exclude the card itself, restrict to eligible categories

[Survived] ArrowFunction
src/daemon.mjs:125:45
     if (queryText.length < 5) return null;
 
     // FTS5 trigram search — exclude the card itself, restrict to eligible categories
-    const cats = [..._CRYST_CATEGORIES].map(() => '?').join(',');
+    const cats = [..._CRYST_CATEGORIES].map(() => undefined).join(',');
     const rows = db.prepare(`
       SELECT kc.id, kc.title, kc.summary, kc.category

[Survived] StringLiteral
src/daemon.mjs:125:51
     if (queryText.length < 5) return null;
 
     // FTS5 trigram search — exclude the card itself, restrict to eligible categories
-    const cats = [..._CRYST_CATEGORIES].map(() => '?').join(',');
+    const cats = [..._CRYST_CATEGORIES].map(() => "").join(',');
     const rows = db.prepare(`
       SELECT kc.id, kc.title, kc.summary, kc.category

[Survived] ArithmeticOperator
src/daemon.mjs:135:62
         AND kc.category IN (${cats})
         AND kc.status NOT IN ('superseded', 'archived')
       LIMIT ?
-    `).all(queryText, newCard.id, ...[..._CRYST_CATEGORIES], _CRYST_MAX_CARDS + 5);
+    `).all(queryText, newCard.id, ...[..._CRYST_CATEGORIES], _CRYST_MAX_CARDS - 5);
 
     if (rows.length < _CRYST_MIN_SIMILAR) return null;

[Survived] EqualityOperator
src/daemon.mjs:137:9
       LIMIT ?
     `).all(queryText, newCard.id, ...[..._CRYST_CATEGORIES], _CRYST_MAX_CARDS + 5);
 
-    if (rows.length < _CRYST_MIN_SIMILAR) return null;
+    if (rows.length >= _CRYST_MIN_SIMILAR) return null;
 
     // Check if a skill already exists covering this topic

[Survived] EqualityOperator
src/daemon.mjs:137:9
       LIMIT ?
     `).all(queryText, newCard.id, ...[..._CRYST_CATEGORIES], _CRYST_MAX_CARDS + 5);
 
-    if (rows.length < _CRYST_MIN_SIMILAR) return null;
+    if (rows.length <= _CRYST_MIN_SIMILAR) return null;
 
     // Check if a skill already exists covering this topic

[Survived] StringLiteral
src/daemon.mjs:141:7
 
     // Check if a skill already exists covering this topic
     const existingSkill = db.prepare(
-      `SELECT id FROM skills WHERE lower(name) LIKE ? AND status != 'archived' LIMIT 1`
+      ``
     ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
     if (existingSkill) return null;

[Survived] MethodExpression
src/daemon.mjs:142:15
     // Check if a skill already exists covering this topic
     const existingSkill = db.prepare(
       `SELECT id FROM skills WHERE lower(name) LIKE ? AND status != 'archived' LIMIT 1`
-    ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
+    ).get(`%${newCard.title.slice(0, 20).toUpperCase()}%`);
     if (existingSkill) return null;
 

[Survived] MethodExpression
src/daemon.mjs:142:15
     // Check if a skill already exists covering this topic
     const existingSkill = db.prepare(
       `SELECT id FROM skills WHERE lower(name) LIKE ? AND status != 'archived' LIMIT 1`
-    ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
+    ).get(`%${newCard.title.toLowerCase()}%`);
     if (existingSkill) return null;
 

[Survived] ConditionalExpression
src/daemon.mjs:143:9
     const existingSkill = db.prepare(
       `SELECT id FROM skills WHERE lower(name) LIKE ? AND status != 'archived' LIMIT 1`
     ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
-    if (existingSkill) return null;
+    if (true) return null;
 
     const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({

[Survived] ConditionalExpression
src/daemon.mjs:143:9
     const existingSkill = db.prepare(
       `SELECT id FROM skills WHERE lower(name) LIKE ? AND status != 'archived' LIMIT 1`
     ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
-    if (existingSkill) return null;
+    if (false) return null;
 
     const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({

[Survived] ArrowFunction
src/daemon.mjs:145:62
     ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
     if (existingSkill) return null;
 
-    const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({
-      id: r.id,
-      title: r.title,
-      summary: r.summary || '',
-    }));
+    const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(() => undefined);
 
     const categories = [...new Set(rows.map(r => r.category))];

[Survived] MethodExpression
src/daemon.mjs:145:26
     ).get(`%${newCard.title.slice(0, 20).toLowerCase()}%`);
     if (existingSkill) return null;
 
-    const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({
+    const similarCards = rows.map(r => ({
       id: r.id,
       title: r.title,

[Survived] ConditionalExpression
src/daemon.mjs:148:16
     const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({
       id: r.id,
       title: r.title,
-      summary: r.summary || '',
+      summary: true,
     }));
 

[Survived] ConditionalExpression
src/daemon.mjs:148:16
     const similarCards = rows.slice(0, _CRYST_MAX_CARDS).map(r => ({
       id: r.id,
       title: r.title,
-      summary: r.summary || '',
+      summary: false,
     }));
 

[Survived] ArrowFunction
src/daemon.mjs:151:45
       summary: r.summary || '',
     }));
 
-    const categories = [...new Set(rows.map(r => r.category))];
+    const categories = [...new Set(rows.map(() => undefined))];
 
     return {

[Survived] ArrayDeclaration
src/daemon.mjs:151:24
       summary: r.summary || '',
     }));
 
-    const categories = [...new Set(rows.map(r => r.category))];
+    const categories = [];
 
     return {

[Survived] ObjectLiteral
src/daemon.mjs:153:12
 
     const categories = [...new Set(rows.map(r => r.category))];
 
-    return {
-      topic: newCard.title,
-      similar_cards: similarCards,
-      categories,
-    };
+    return {};
   } catch (err) {
     console.warn('[AwarenessDaemon] Crystallization check failed:', err.message);

[Survived] BlockStatement
src/daemon.mjs:158:17
       similar_cards: similarCards,
       categories,
     };
-  } catch (err) {
-    console.warn('[AwarenessDaemon] Crystallization check failed:', err.message);
-    return null;
-  }
+  } catch (err) {}
 }
 

[Survived] ConditionalExpression
src/daemon.mjs:175:17
    * @param {string}  [options.projectDir=cwd]   — project root directory
    */
   constructor(options = {}) {
-    this.port = options.port || DEFAULT_PORT;
+    this.port = false;
     this.projectDir = options.projectDir || process.cwd();
     this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);

[Survived] LogicalOperator
src/daemon.mjs:175:17
    * @param {string}  [options.projectDir=cwd]   — project root directory
    */
   constructor(options = {}) {
-    this.port = options.port || DEFAULT_PORT;
+    this.port = options.port && DEFAULT_PORT;
     this.projectDir = options.projectDir || process.cwd();
     this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);

[Survived] ConditionalExpression
src/daemon.mjs:176:23
    */
   constructor(options = {}) {
     this.port = options.port || DEFAULT_PORT;
-    this.projectDir = options.projectDir || process.cwd();
+    this.projectDir = false;
     this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);
 

[Survived] LogicalOperator
src/daemon.mjs:176:23
    */
   constructor(options = {}) {
     this.port = options.port || DEFAULT_PORT;
-    this.projectDir = options.projectDir || process.cwd();
+    this.projectDir = options.projectDir && process.cwd();
     this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);
 

[Survived] ConditionalExpression
src/daemon.mjs:177:25
   constructor(options = {}) {
     this.port = options.port || DEFAULT_PORT;
     this.projectDir = options.projectDir || process.cwd();
-    this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);
+    this.guardProfile = true;
 
     this.awarenessDir = path.join(this.projectDir, AWARENESS_DIR);

[Survived] LogicalOperator
src/daemon.mjs:177:25
   constructor(options = {}) {
     this.port = options.port || DEFAULT_PORT;
     this.projectDir = options.projectDir || process.cwd();
-    this.guardProfile = options.guardProfile || detectGuardProfile(this.projectDir);
+    this.guardProfile = options.guardProfile && detectGuardProfile(this.projectDir);
 
     this.awarenessDir = path.join(this.projectDir, AWARENESS_DIR);

[Survived] BlockStatement
src/daemon.mjs:230:47
    */
   async start() {
     // SECURITY C4: Prevent unhandled rejections from crashing the daemon
-    process.on('unhandledRejection', (err) => {
-      console.error('[awareness-local] unhandled rejection:', err?.message || err);
-    });
+    process.on('unhandledRejection', (err) => {});
 
     if (await this.isRunning()) {

[Survived] OptionalChaining
src/daemon.mjs:231:63
   async start() {
     // SECURITY C4: Prevent unhandled rejections from crashing the daemon
     process.on('unhandledRejection', (err) => {
-      console.error('[awareness-local] unhandled rejection:', err?.message || err);
+      console.error('[awareness-local] unhandled rejection:', err.message || err);
     });
 

[Survived] LogicalOperator
src/daemon.mjs:231:63
   async start() {
     // SECURITY C4: Prevent unhandled rejections from crashing the daemon
     process.on('unhandledRejection', (err) => {
-      console.error('[awareness-local] unhandled rejection:', err?.message || err);
+      console.error('[awareness-local] unhandled rejection:', err?.message && err);
     });
 

[Survived] ConditionalExpression
src/daemon.mjs:234:9
       console.error('[awareness-local] unhandled rejection:', err?.message || err);
     });
 
-    if (await this.isRunning()) {
+    if (true) {
       console.log(
         `[awareness-local] daemon already running on port ${this.port}`

[Survived] BlockStatement
src/daemon.mjs:234:33
       console.error('[awareness-local] unhandled rejection:', err?.message || err);
     });
 
-    if (await this.isRunning()) {
-      console.log(
-        `[awareness-local] daemon already running on port ${this.port}`
-      );
-      return { alreadyRunning: true, port: this.port };
-    }
+    if (await this.isRunning()) {}
 
     // Ensure directory structure

[Survived] BooleanLiteral
src/daemon.mjs:238:32
       console.log(
         `[awareness-local] daemon already running on port ${this.port}`
       );
-      return { alreadyRunning: true, port: this.port };
+      return { alreadyRunning: false, port: this.port };
     }
 

[Survived] BooleanLiteral
src/daemon.mjs:242:73
     }
 
     // Ensure directory structure
-    fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
+    fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: false });
     fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
     fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });

[Survived] ObjectLiteral
src/daemon.mjs:242:60
     }
 
     // Ensure directory structure
-    fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
+    fs.mkdirSync(path.join(this.awarenessDir, 'memories'), {});
     fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
     fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });

[Survived] BooleanLiteral
src/daemon.mjs:243:74
 
     // Ensure directory structure
     fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
-    fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
+    fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: false });
     fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });
 

[Survived] ObjectLiteral
src/daemon.mjs:243:61
 
     // Ensure directory structure
     fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
-    fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
+    fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), {});
     fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });
 

[Survived] BooleanLiteral
src/daemon.mjs:244:70
     // Ensure directory structure
     fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
     fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
-    fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });
+    fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: false });
 
     // ---- Init core modules ----

[Survived] BlockStatement
src/daemon.mjs:248:9
 
     // ---- Init core modules ----
     this.memoryStore = new MemoryStore(this.projectDir);
-    try {
-      this.indexer = new Indexer(
-        path.join(this.awarenessDir, 'index.db')
-      );
-    } catch (e) {
+    try {} catch (e) {
       // Auto-rebuild better-sqlite3 when Node.js major version has changed
       if (e.message && e.message.includes('NODE_MODULE_VERSION')) {

[Survived] BlockStatement
src/daemon.mjs:252:17
       this.indexer = new Indexer(
         path.join(this.awarenessDir, 'index.db')
       );
-    } catch (e) {
-      // Auto-rebuild better-sqlite3 when Node.js major version has changed
-      if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
-        const rebuilt = await this._tryRebuildBetterSqlite(e.message);
-        if (rebuilt) {
-          try {
-            this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-          } catch (e2) {
-            console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
-            this.indexer = createNoopIndexer();
-          }
-        } else {
-          this.indexer = createNoopIndexer();
-        }
-      } else {
-        console.error(`[awareness-local] SQLite indexer unavailable: ${e.message}`);
-        console.error('[awareness-local] Falling back to file-only mode (no search). Install better-sqlite3: npm install better-sqlite3');
-        this.indexer = createNoopIndexer();
-      }
-    }
+    } catch (e) {}
 
     // Search and extractor are optional Phase 1 modules — import dynamically

[Survived] ConditionalExpression
src/daemon.mjs:254:11
       );
     } catch (e) {
       // Auto-rebuild better-sqlite3 when Node.js major version has changed
-      if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
+      if (false) {
         const rebuilt = await this._tryRebuildBetterSqlite(e.message);
         if (rebuilt) {

[Survived] ConditionalExpression
src/daemon.mjs:254:11
       );
     } catch (e) {
       // Auto-rebuild better-sqlite3 when Node.js major version has changed
-      if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
+      if (true) {
         const rebuilt = await this._tryRebuildBetterSqlite(e.message);
         if (rebuilt) {

[Survived] BlockStatement
src/daemon.mjs:256:22
       // Auto-rebuild better-sqlite3 when Node.js major version has changed
       if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
         const rebuilt = await this._tryRebuildBetterSqlite(e.message);
-        if (rebuilt) {
-          try {
-            this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-          } catch (e2) {
-            console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
-            this.indexer = createNoopIndexer();
-          }
-        } else {
+        if (rebuilt) {} else {
           this.indexer = createNoopIndexer();
         }

[Survived] ConditionalExpression
src/daemon.mjs:256:13
       // Auto-rebuild better-sqlite3 when Node.js major version has changed
       if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
         const rebuilt = await this._tryRebuildBetterSqlite(e.message);
-        if (rebuilt) {
+        if (false) {
           try {
             this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));

[Survived] BlockStatement
src/daemon.mjs:257:15
       if (e.message && e.message.includes('NODE_MODULE_VERSION')) {
         const rebuilt = await this._tryRebuildBetterSqlite(e.message);
         if (rebuilt) {
-          try {
-            this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-          } catch (e2) {
+          try {} catch (e2) {
             console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
             this.indexer = createNoopIndexer();

[Survived] BlockStatement
src/daemon.mjs:259:24
         if (rebuilt) {
           try {
             this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-          } catch (e2) {
-            console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
-            this.indexer = createNoopIndexer();
-          }
+          } catch (e2) {}
         } else {
           this.indexer = createNoopIndexer();

[Survived] StringLiteral
src/daemon.mjs:260:27
           try {
             this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
           } catch (e2) {
-            console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
+            console.error(``);
             this.indexer = createNoopIndexer();
           }

[Survived] BlockStatement
src/daemon.mjs:263:16
             console.error(`[awareness-local] SQLite still unavailable after rebuild: ${e2.message}`);
             this.indexer = createNoopIndexer();
           }
-        } else {
-          this.indexer = createNoopIndexer();
-        }
+        } else {}
       } else {
         console.error(`[awareness-local] SQLite indexer unavailable: ${e.message}`);

[Survived] BlockStatement
src/daemon.mjs:266:14
         } else {
           this.indexer = createNoopIndexer();
         }
-      } else {
-        console.error(`[awareness-local] SQLite indexer unavailable: ${e.message}`);
-        console.error('[awareness-local] Falling back to file-only mode (no search). Install better-sqlite3: npm install better-sqlite3');
-        this.indexer = createNoopIndexer();
-      }
+      } else {}
     }
 

[Survived] StringLiteral
src/daemon.mjs:267:23
           this.indexer = createNoopIndexer();
         }
       } else {
-        console.error(`[awareness-local] SQLite indexer unavailable: ${e.message}`);
+        console.error(``);
         console.error('[awareness-local] Falling back to file-only mode (no search). Install better-sqlite3: npm install better-sqlite3');
         this.indexer = createNoopIndexer();

[Survived] BlockStatement
src/daemon.mjs:279:9
     this.extractor = await this._loadKnowledgeExtractor();
 
     // ---- Incremental index ----
-    try {
-      const indexResult = await this.indexer.incrementalIndex(this.memoryStore);
-      console.log(
-        `[awareness-local] indexed ${indexResult.indexed} files, ` +
-        `skipped ${indexResult.skipped}`
-      );
-    } catch (err) {
+    try {} catch (err) {
       console.error('[awareness-local] incremental index error:', err.message);
     }

[Survived] BlockStatement
src/daemon.mjs:285:19
         `[awareness-local] indexed ${indexResult.indexed} files, ` +
         `skipped ${indexResult.skipped}`
       );
-    } catch (err) {
-      console.error('[awareness-local] incremental index error:', err.message);
-    }
+    } catch (err) {}
 
     // ---- Pre-warm embedding model + backfill (fire-and-forget, non-blocking) ----

[Survived] ConditionalExpression
src/daemon.mjs:290:9
     }
 
     // ---- Pre-warm embedding model + backfill (fire-and-forget, non-blocking) ----
-    if (this._embedder) {
+    if (true) {
       this._warmupEmbedder().catch((err) => {
         console.warn('[awareness-local] embedder warmup error:', err.message);

[Survived] ConditionalExpression
src/daemon.mjs:290:9
     }
 
     // ---- Pre-warm embedding model + backfill (fire-and-forget, non-blocking) ----
-    if (this._embedder) {
+    if (false) {
       this._warmupEmbedder().catch((err) => {
         console.warn('[awareness-local] embedder warmup error:', err.message);

[Survived] BlockStatement
src/daemon.mjs:291:45
 
     // ---- Pre-warm embedding model + backfill (fire-and-forget, non-blocking) ----
     if (this._embedder) {
-      this._warmupEmbedder().catch((err) => {
-        console.warn('[awareness-local] embedder warmup error:', err.message);
-      });
+      this._warmupEmbedder().catch((err) => {});
     }
 

[Survived] StringLiteral
src/daemon.mjs:292:22
     // ---- Pre-warm embedding model + backfill (fire-and-forget, non-blocking) ----
     if (this._embedder) {
       this._warmupEmbedder().catch((err) => {
-        console.warn('[awareness-local] embedder warmup error:', err.message);
+        console.warn("", err.message);
       });
     }

[Survived] ObjectLiteral
src/daemon.mjs:297:41
     }
 
     // ---- MCP server ----
-    this.mcpServer = new LocalMcpServer({
-      memoryStore: this.memoryStore,
-      indexer: this.indexer,
-      search: this.search,
-      extractor: this.extractor,
-      config: this._loadConfig(),
-      loadSpec: () => this._loadSpec(),
-      createSession: (source) => this._createSession(source),
-      remember: (params) => this._remember(params),
-      rememberBatch: (params) => this._rememberBatch(params),
-      updateTask: (params) => this._updateTask(params),
-      submitInsights: (params) => this._submitInsights(params),
-      lookup: (params) => this._lookup(params),
-    });
+    this.mcpServer = new LocalMcpServer({});
 
     // ---- Telemetry (opt-in) ----

[Survived] ArrowFunction
src/daemon.mjs:303:17
       search: this.search,
       extractor: this.extractor,
       config: this._loadConfig(),
-      loadSpec: () => this._loadSpec(),
+      loadSpec: () => undefined,
       createSession: (source) => this._createSession(source),
       remember: (params) => this._remember(params),

[Survived] ArrowFunction
src/daemon.mjs:304:22
       extractor: this.extractor,
       config: this._loadConfig(),
       loadSpec: () => this._loadSpec(),
-      createSession: (source) => this._createSession(source),
+      createSession: () => undefined,
       remember: (params) => this._remember(params),
       rememberBatch: (params) => this._rememberBatch(params),

[Survived] ArrowFunction
src/daemon.mjs:305:17
       config: this._loadConfig(),
       loadSpec: () => this._loadSpec(),
       createSession: (source) => this._createSession(source),
-      remember: (params) => this._remember(params),
+      remember: () => undefined,
       rememberBatch: (params) => this._rememberBatch(params),
       updateTask: (params) => this._updateTask(params),
