[Survived] ArrowFunction
src/daemon.mjs:306:22
       loadSpec: () => this._loadSpec(),
       createSession: (source) => this._createSession(source),
       remember: (params) => this._remember(params),
-      rememberBatch: (params) => this._rememberBatch(params),
+      rememberBatch: () => undefined,
       updateTask: (params) => this._updateTask(params),
       submitInsights: (params) => this._submitInsights(params),

[Survived] ArrowFunction
src/daemon.mjs:307:19
       createSession: (source) => this._createSession(source),
       remember: (params) => this._remember(params),
       rememberBatch: (params) => this._rememberBatch(params),
-      updateTask: (params) => this._updateTask(params),
+      updateTask: () => undefined,
       submitInsights: (params) => this._submitInsights(params),
       lookup: (params) => this._lookup(params),

[Survived] ArrowFunction
src/daemon.mjs:308:23
       remember: (params) => this._remember(params),
       rememberBatch: (params) => this._rememberBatch(params),
       updateTask: (params) => this._updateTask(params),
-      submitInsights: (params) => this._submitInsights(params),
+      submitInsights: () => undefined,
       lookup: (params) => this._lookup(params),
     });

[Survived] ArrowFunction
src/daemon.mjs:309:15
       rememberBatch: (params) => this._rememberBatch(params),
       updateTask: (params) => this._updateTask(params),
       submitInsights: (params) => this._submitInsights(params),
-      lookup: (params) => this._lookup(params),
+      lookup: () => undefined,
     });
 

[Survived] BlockStatement
src/daemon.mjs:313:9
     });
 
     // ---- Telemetry (opt-in) ----
-    try {
-      const cfg = this._loadConfig();
-      initTelemetry({ config: cfg, projectDir: this.projectDir, version: PKG_VERSION });
-      const tel = getTelemetry();
-      tel?.track('daemon_started', {
-        daemon_version: PKG_VERSION,
-        os: process.platform,
-        node_version: process.version,
-        arch: process.arch,
-        locale: (Intl.DateTimeFormat().resolvedOptions().locale) || 'unknown',
-      });
-    } catch (err) {
+    try {} catch (err) {
       // Never let telemetry init block daemon startup.
       console.warn('[awareness-local] telemetry init failed:', err.message);

[Survived] ObjectLiteral
src/daemon.mjs:315:21
     // ---- Telemetry (opt-in) ----
     try {
       const cfg = this._loadConfig();
-      initTelemetry({ config: cfg, projectDir: this.projectDir, version: PKG_VERSION });
+      initTelemetry({});
       const tel = getTelemetry();
       tel?.track('daemon_started', {

[Survived] OptionalChaining
src/daemon.mjs:317:7
       const cfg = this._loadConfig();
       initTelemetry({ config: cfg, projectDir: this.projectDir, version: PKG_VERSION });
       const tel = getTelemetry();
-      tel?.track('daemon_started', {
+      tel.track('daemon_started', {
         daemon_version: PKG_VERSION,
         os: process.platform,

[Survived] LogicalOperator
src/daemon.mjs:322:17
         os: process.platform,
         node_version: process.version,
         arch: process.arch,
-        locale: (Intl.DateTimeFormat().resolvedOptions().locale) || 'unknown',
+        locale: Intl.DateTimeFormat().resolvedOptions().locale && 'unknown',
       });
     } catch (err) {

[Survived] ConditionalExpression
src/daemon.mjs:322:17
         os: process.platform,
         node_version: process.version,
         arch: process.arch,
-        locale: (Intl.DateTimeFormat().resolvedOptions().locale) || 'unknown',
+        locale: true,
       });
     } catch (err) {

[Survived] BlockStatement
src/daemon.mjs:324:19
         arch: process.arch,
         locale: (Intl.DateTimeFormat().resolvedOptions().locale) || 'unknown',
       });
-    } catch (err) {
-      // Never let telemetry init block daemon startup.
-      console.warn('[awareness-local] telemetry init failed:', err.message);
-    }
+    } catch (err) {}
 
     // ---- Cloud sync (optional) ----

[Survived] ConditionalExpression
src/daemon.mjs:332:9
     // ---- Cloud sync (optional) ----
     const config = this._loadConfig();
 
-    if (config.cloud?.enabled) {
+    if (true) {
       try {
         this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);

[Survived] BlockStatement
src/daemon.mjs:332:32
     // ---- Cloud sync (optional) ----
     const config = this._loadConfig();
 
-    if (config.cloud?.enabled) {
-      try {
-        this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-        if (this.cloudSync.isEnabled()) {
-          // Start cloud sync (non-blocking — errors won't prevent daemon startup)
-          this.cloudSync.start().catch((err) => {
-            console.warn('[awareness-local] cloud sync start failed:', err.message);
-          });
-        }
-      } catch (err) {
-        console.warn('[awareness-local] cloud sync init failed:', err.message);
-        this.cloudSync = null;
-      }
-    }
+    if (config.cloud?.enabled) {}
 
     // ---- HTTP server ----

[Survived] BlockStatement
src/daemon.mjs:333:11
     const config = this._loadConfig();
 
     if (config.cloud?.enabled) {
-      try {
-        this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-        if (this.cloudSync.isEnabled()) {
-          // Start cloud sync (non-blocking — errors won't prevent daemon startup)
-          this.cloudSync.start().catch((err) => {
-            console.warn('[awareness-local] cloud sync start failed:', err.message);
-          });
-        }
-      } catch (err) {
+      try {} catch (err) {
         console.warn('[awareness-local] cloud sync init failed:', err.message);
         this.cloudSync = null;

[Survived] ConditionalExpression
src/daemon.mjs:335:13
     if (config.cloud?.enabled) {
       try {
         this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-        if (this.cloudSync.isEnabled()) {
+        if (false) {
           // Start cloud sync (non-blocking — errors won't prevent daemon startup)
           this.cloudSync.start().catch((err) => {

[Survived] ConditionalExpression
src/daemon.mjs:335:13
     if (config.cloud?.enabled) {
       try {
         this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-        if (this.cloudSync.isEnabled()) {
+        if (true) {
           // Start cloud sync (non-blocking — errors won't prevent daemon startup)
           this.cloudSync.start().catch((err) => {

[Survived] BlockStatement
src/daemon.mjs:337:49
         this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
         if (this.cloudSync.isEnabled()) {
           // Start cloud sync (non-blocking — errors won't prevent daemon startup)
-          this.cloudSync.start().catch((err) => {
-            console.warn('[awareness-local] cloud sync start failed:', err.message);
-          });
+          this.cloudSync.start().catch((err) => {});
         }
       } catch (err) {

[Survived] BlockStatement
src/daemon.mjs:341:21
             console.warn('[awareness-local] cloud sync start failed:', err.message);
           });
         }
-      } catch (err) {
-        console.warn('[awareness-local] cloud sync init failed:', err.message);
-        this.cloudSync = null;
-      }
+      } catch (err) {}
     }
 

[Survived] StringLiteral
src/daemon.mjs:342:22
           });
         }
       } catch (err) {
-        console.warn('[awareness-local] cloud sync init failed:', err.message);
+        console.warn("", err.message);
         this.cloudSync = null;
       }

[Survived] ArrowFunction
src/daemon.mjs:348:41
     }
 
     // ---- HTTP server ----
-    this.httpServer = http.createServer((req, res) =>
-      this._handleRequest(req, res)
+    this.httpServer = http.createServer(() => undefined
     );
 

[Survived] BlockStatement
src/daemon.mjs:352:9
       this._handleRequest(req, res)
     );
 
-    try {
-      await new Promise((resolve, reject) => {
-        this.httpServer.on('error', reject);
-        this.httpServer.listen(this.port, BIND_HOST, () => resolve());
-      });
-    } catch (err) {
+    try {} catch (err) {
       if (err.code === 'EADDRINUSE') {
         console.error(

[Survived] BlockStatement
src/daemon.mjs:353:46
     );
 
     try {
-      await new Promise((resolve, reject) => {
-        this.httpServer.on('error', reject);
-        this.httpServer.listen(this.port, BIND_HOST, () => resolve());
-      });
+      await new Promise((resolve, reject) => {});
     } catch (err) {
       if (err.code === 'EADDRINUSE') {

[Survived] ArrowFunction
src/daemon.mjs:355:54
     try {
       await new Promise((resolve, reject) => {
         this.httpServer.on('error', reject);
-        this.httpServer.listen(this.port, BIND_HOST, () => resolve());
+        this.httpServer.listen(this.port, BIND_HOST, () => undefined);
       });
     } catch (err) {

[Survived] BlockStatement
src/daemon.mjs:357:19
         this.httpServer.on('error', reject);
         this.httpServer.listen(this.port, BIND_HOST, () => resolve());
       });
-    } catch (err) {
-      if (err.code === 'EADDRINUSE') {
-        console.error(
-          `[awareness-local] Port ${this.port} is already in use.\n` +
-          `  Possible causes:\n` +
-          `  - Another awareness-local instance is running (try: awareness-local status)\n` +
-          `  - Another application is using port ${this.port}\n` +
-          `  Fix: Run "awareness-local stop" or "lsof -i :${this.port}" to find the process.`
-        );
-      }
-      throw err;
-    }
+    } catch (err) {}
 
     this._startedAt = Date.now();

[Survived] EqualityOperator
src/daemon.mjs:358:11
         this.httpServer.listen(this.port, BIND_HOST, () => resolve());
       });
     } catch (err) {
-      if (err.code === 'EADDRINUSE') {
+      if (err.code !== 'EADDRINUSE') {
         console.error(
           `[awareness-local] Port ${this.port} is already in use.\n` +

[Survived] BlockStatement
src/daemon.mjs:358:38
         this.httpServer.listen(this.port, BIND_HOST, () => resolve());
       });
     } catch (err) {
-      if (err.code === 'EADDRINUSE') {
-        console.error(
-          `[awareness-local] Port ${this.port} is already in use.\n` +
-          `  Possible causes:\n` +
-          `  - Another awareness-local instance is running (try: awareness-local status)\n` +
-          `  - Another application is using port ${this.port}\n` +
-          `  Fix: Run "awareness-local stop" or "lsof -i :${this.port}" to find the process.`
-        );
-      }
+      if (err.code === 'EADDRINUSE') {}
       throw err;
     }

[Survived] StringLiteral
src/daemon.mjs:373:57
     this._startedAt = Date.now();
 
     // ---- PID file ----
-    fs.writeFileSync(this.pidFile, String(process.pid), 'utf-8');
+    fs.writeFileSync(this.pidFile, String(process.pid), "");
 
     // ---- File watcher ----

[Survived] BooleanLiteral
src/daemon.mjs:391:23
       `[awareness-local] MCP endpoint: http://localhost:${this.port}/mcp`
     );
 
-    return { started: true, port: this.port, pid: process.pid };
+    return { started: false, port: this.port, pid: process.pid };
   }
 

[Survived] ObjectLiteral
src/daemon.mjs:391:12
       `[awareness-local] MCP endpoint: http://localhost:${this.port}/mcp`
     );
 
-    return { started: true, port: this.port, pid: process.pid };
+    return {};
   }
 

[Survived] BlockStatement
src/daemon.mjs:399:23
    */
   async stop() {
     // Stop file watcher
-    if (this.watcher) {
-      this.watcher.close();
-      this.watcher = null;
-    }
+    if (this.watcher) {}
     if (this._reindexTimer) {
       clearTimeout(this._reindexTimer);

[Survived] ConditionalExpression
src/daemon.mjs:399:9
    */
   async stop() {
     // Stop file watcher
-    if (this.watcher) {
+    if (false) {
       this.watcher.close();
       this.watcher = null;

[Survived] ConditionalExpression
src/daemon.mjs:403:9
       this.watcher.close();
       this.watcher = null;
     }
-    if (this._reindexTimer) {
+    if (true) {
       clearTimeout(this._reindexTimer);
       this._reindexTimer = null;

[Survived] ConditionalExpression
src/daemon.mjs:403:9
       this.watcher.close();
       this.watcher = null;
     }
-    if (this._reindexTimer) {
+    if (false) {
       clearTimeout(this._reindexTimer);
       this._reindexTimer = null;

[Survived] BlockStatement
src/daemon.mjs:407:32
       clearTimeout(this._reindexTimer);
       this._reindexTimer = null;
     }
-    if (this._skillDecayTimer) {
-      clearInterval(this._skillDecayTimer);
-      this._skillDecayTimer = null;
-    }
+    if (this._skillDecayTimer) {}
 
     // Stop workspace watchers (F-038)

[Survived] ConditionalExpression
src/daemon.mjs:407:9
       clearTimeout(this._reindexTimer);
       this._reindexTimer = null;
     }
-    if (this._skillDecayTimer) {
+    if (true) {
       clearInterval(this._skillDecayTimer);
       this._skillDecayTimer = null;

[Survived] BlockStatement
src/daemon.mjs:413:36
     }
 
     // Stop workspace watchers (F-038)
-    if (this._scanAbortController) {
-      this._scanAbortController.abort();
-      this._scanAbortController = null;
-    }
+    if (this._scanAbortController) {}
     if (this._workspaceWatcher) {
       this._workspaceWatcher.close();

[Survived] ConditionalExpression
src/daemon.mjs:413:9
     }
 
     // Stop workspace watchers (F-038)
-    if (this._scanAbortController) {
+    if (false) {
       this._scanAbortController.abort();
       this._scanAbortController = null;

[Survived] BlockStatement
src/daemon.mjs:417:33
       this._scanAbortController.abort();
       this._scanAbortController = null;
     }
-    if (this._workspaceWatcher) {
-      this._workspaceWatcher.close();
-      this._workspaceWatcher = null;
-    }
+    if (this._workspaceWatcher) {}
     if (this._gitHeadWatcher) {
       this._gitHeadWatcher.close();

[Survived] ConditionalExpression
src/daemon.mjs:417:9
       this._scanAbortController.abort();
       this._scanAbortController = null;
     }
-    if (this._workspaceWatcher) {
+    if (false) {
       this._workspaceWatcher.close();
       this._workspaceWatcher = null;

[Survived] ConditionalExpression
src/daemon.mjs:421:9
       this._workspaceWatcher.close();
       this._workspaceWatcher = null;
     }
-    if (this._gitHeadWatcher) {
+    if (true) {
       this._gitHeadWatcher.close();
       this._gitHeadWatcher = null;

[Survived] ConditionalExpression
src/daemon.mjs:421:9
       this._workspaceWatcher.close();
       this._workspaceWatcher = null;
     }
-    if (this._gitHeadWatcher) {
+    if (false) {
       this._gitHeadWatcher.close();
       this._gitHeadWatcher = null;

[Survived] ConditionalExpression
src/daemon.mjs:427:9
     }
 
     // Stop cloud sync
-    if (this.cloudSync) {
+    if (false) {
       this.cloudSync.stop();
       this.cloudSync = null;

[Survived] BlockStatement
src/daemon.mjs:427:25
     }
 
     // Stop cloud sync
-    if (this.cloudSync) {
-      this.cloudSync.stop();
-      this.cloudSync = null;
-    }
+    if (this.cloudSync) {}
 
     // Close MCP sessions

[Survived] ConditionalExpression
src/daemon.mjs:436:9
     this._mcpSessions.clear();
 
     // Close HTTP server
-    if (this.httpServer) {
+    if (true) {
       await new Promise((resolve) => this.httpServer.close(resolve));
       this.httpServer = null;

[Survived] ConditionalExpression
src/daemon.mjs:436:9
     this._mcpSessions.clear();
 
     // Close HTTP server
-    if (this.httpServer) {
+    if (false) {
       await new Promise((resolve) => this.httpServer.close(resolve));
       this.httpServer = null;

[Survived] ArrowFunction
src/daemon.mjs:437:25
 
     // Close HTTP server
     if (this.httpServer) {
-      await new Promise((resolve) => this.httpServer.close(resolve));
+      await new Promise(() => undefined);
       this.httpServer = null;
     }

[Survived] ConditionalExpression
src/daemon.mjs:442:9
     }
 
     // Close SQLite
-    if (this.indexer) {
+    if (false) {
       this.indexer.close();
       this.indexer = null;

[Survived] ConditionalExpression
src/daemon.mjs:442:9
     }
 
     // Close SQLite
-    if (this.indexer) {
+    if (true) {
       this.indexer.close();
       this.indexer = null;

[Survived] BlockStatement
src/daemon.mjs:448:9
     }
 
     // Remove PID file
-    try {
-      if (fs.existsSync(this.pidFile)) {
-        fs.unlinkSync(this.pidFile);
-      }
-    } catch {
+    try {} catch {
       // ignore cleanup errors
     }

[Killed] ConditionalExpression
src/daemon.mjs:449:11
 
     // Remove PID file
     try {
-      if (fs.existsSync(this.pidFile)) {
+      if (false) {
         fs.unlinkSync(this.pidFile);
       }
killedBy: All tests
statusReason: ▶ L4 E2E: Project isolation via X-Awareness-Project-Dir
  ✔ healthz is exempt from project validation (829.756416ms)

  ✔ matching project header passes through (2.668625ms)

  ✔ mismatching project header returns 409 (1.18075ms)

  ✔ no header (old client) still works (1.93975ms)

[Survived] ConditionalExpression
src/daemon.mjs:449:11
 
     // Remove PID file
     try {
-      if (fs.existsSync(this.pidFile)) {
+      if (true) {
         fs.unlinkSync(this.pidFile);
       }

[Survived] BooleanLiteral
src/daemon.mjs:465:9
    * @returns {Promise<boolean>}
    */
   async isRunning() {
-    if (!fs.existsSync(this.pidFile)) return false;
+    if (fs.existsSync(this.pidFile)) return false;
 
     let pid;

[Survived] ConditionalExpression
src/daemon.mjs:465:9
    * @returns {Promise<boolean>}
    */
   async isRunning() {
-    if (!fs.existsSync(this.pidFile)) return false;
+    if (false) return false;
 
     let pid;

[Survived] BlockStatement
src/daemon.mjs:468:9
     if (!fs.existsSync(this.pidFile)) return false;
 
     let pid;
-    try {
-      pid = parseInt(fs.readFileSync(this.pidFile, 'utf-8').trim(), 10);
-    } catch {
+    try {} catch {
       return false;
     }

[Survived] MethodExpression
src/daemon.mjs:469:22
 
     let pid;
     try {
-      pid = parseInt(fs.readFileSync(this.pidFile, 'utf-8').trim(), 10);
+      pid = parseInt(fs.readFileSync(this.pidFile, 'utf-8'), 10);
     } catch {
       return false;

[Survived] StringLiteral
src/daemon.mjs:469:52
 
     let pid;
     try {
-      pid = parseInt(fs.readFileSync(this.pidFile, 'utf-8').trim(), 10);
+      pid = parseInt(fs.readFileSync(this.pidFile, "").trim(), 10);
     } catch {
       return false;

[Survived] BlockStatement
src/daemon.mjs:470:13
     let pid;
     try {
       pid = parseInt(fs.readFileSync(this.pidFile, 'utf-8').trim(), 10);
-    } catch {
-      return false;
-    }
+    } catch {}
 
     // Check if process exists

[Survived] BlockStatement
src/daemon.mjs:475:9
     }
 
     // Check if process exists
-    try {
-      process.kill(pid, 0);
-    } catch {
+    try {} catch {
       // Process dead — stale PID file
       this._cleanPidFile();

[Survived] BlockStatement
src/daemon.mjs:477:13
     // Check if process exists
     try {
       process.kill(pid, 0);
-    } catch {
-      // Process dead — stale PID file
-      this._cleanPidFile();
-      return false;
-    }
+    } catch {}
 
     // Also verify HTTP endpoint is responsive

[Survived] BooleanLiteral
src/daemon.mjs:480:14
     } catch {
       // Process dead — stale PID file
       this._cleanPidFile();
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
src/daemon.mjs:485:19
 
     // Also verify HTTP endpoint is responsive
     const healthy = await httpHealthCheck(this.port);
-    if (!healthy) {
-      this._cleanPidFile();
-      return false;
-    }
+    if (!healthy) {}
 
     return true;

[Survived] BooleanLiteral
src/daemon.mjs:485:9
 
     // Also verify HTTP endpoint is responsive
     const healthy = await httpHealthCheck(this.port);
-    if (!healthy) {
+    if (healthy) {
       this._cleanPidFile();
       return false;

[Survived] EqualityOperator
src/daemon.mjs:504:9
    */
   async _handleRequest(req, res) {
     // CORS preflight
-    if (req.method === 'OPTIONS') {
+    if (req.method !== 'OPTIONS') {
       res.writeHead(204, {
         'Access-Control-Allow-Origin': '*',

[Survived] ConditionalExpression
src/daemon.mjs:504:9
    */
   async _handleRequest(req, res) {
     // CORS preflight
-    if (req.method === 'OPTIONS') {
+    if (false) {
       res.writeHead(204, {
         'Access-Control-Allow-Origin': '*',

[Survived] StringLiteral
src/daemon.mjs:508:41
       res.writeHead(204, {
         'Access-Control-Allow-Origin': '*',
         'Access-Control-Allow-Methods': 'GET, POST, PUT, DELETE, OPTIONS',
-        'Access-Control-Allow-Headers': 'Content-Type, Mcp-Session-Id, X-Awareness-Project-Dir',
+        'Access-Control-Allow-Headers': "",
       });
       res.end();

[Survived] StringLiteral
src/daemon.mjs:514:34
       return;
     }
 
-    const url = new URL(req.url, `http://localhost:${this.port}`);
+    const url = new URL(req.url, ``);
 
     try {

[Survived] BlockStatement
src/daemon.mjs:518:40
 
     try {
       // /healthz — exempt from project validation
-      if (url.pathname === '/healthz') {
-        return this._handleHealthz(res);
-      }
+      if (url.pathname === '/healthz') {}
 
       // Guard: reject requests while switchProject() is in progress

[Survived] ConditionalExpression
src/daemon.mjs:518:11
 
     try {
       // /healthz — exempt from project validation
-      if (url.pathname === '/healthz') {
+      if (false) {
         return this._handleHealthz(res);
       }

[Survived] ConditionalExpression
src/daemon.mjs:523:11
       }
 
       // Guard: reject requests while switchProject() is in progress
-      if (this._switching) {
+      if (false) {
         jsonResponse(res, { error: 'project_switching', message: 'Daemon is switching projects, retry shortly' }, 503);
         return;

[Survived] ConditionalExpression
src/daemon.mjs:523:11
       }
 
       // Guard: reject requests while switchProject() is in progress
-      if (this._switching) {
+      if (true) {
         jsonResponse(res, { error: 'project_switching', message: 'Daemon is switching projects, retry shortly' }, 503);
         return;

[Survived] ObjectLiteral
src/daemon.mjs:524:27
 
       // Guard: reject requests while switchProject() is in progress
       if (this._switching) {
-        jsonResponse(res, { error: 'project_switching', message: 'Daemon is switching projects, retry shortly' }, 503);
+        jsonResponse(res, {}, 503);
         return;
       }

[Survived] BlockStatement
src/daemon.mjs:530:29
 
       // Per-request project_dir validation via X-Awareness-Project-Dir header
       const requestedProject = req.headers['x-awareness-project-dir'];
-      if (requestedProject) {
-        const normalizedRequested = path.resolve(requestedProject);
-        const normalizedCurrent = path.resolve(this.projectDir);
-        if (normalizedRequested !== normalizedCurrent) {
-          jsonResponse(res, {
-            error: 'project_mismatch',
-            daemon_project: normalizedCurrent,
-            requested_project: normalizedRequested,
-          }, 409);
-          return;
-        }
-      }
+      if (requestedProject) {}
 
       // /mcp — MCP JSON-RPC over HTTP

[Survived] ConditionalExpression
src/daemon.mjs:530:11
 
       // Per-request project_dir validation via X-Awareness-Project-Dir header
       const requestedProject = req.headers['x-awareness-project-dir'];
-      if (requestedProject) {
+      if (true) {
         const normalizedRequested = path.resolve(requestedProject);
         const normalizedCurrent = path.resolve(this.projectDir);

[Survived] EqualityOperator
src/daemon.mjs:533:13
       if (requestedProject) {
         const normalizedRequested = path.resolve(requestedProject);
         const normalizedCurrent = path.resolve(this.projectDir);
-        if (normalizedRequested !== normalizedCurrent) {
+        if (normalizedRequested === normalizedCurrent) {
           jsonResponse(res, {
             error: 'project_mismatch',

[Survived] ConditionalExpression
src/daemon.mjs:533:13
       if (requestedProject) {
         const normalizedRequested = path.resolve(requestedProject);
         const normalizedCurrent = path.resolve(this.projectDir);
-        if (normalizedRequested !== normalizedCurrent) {
+        if (true) {
           jsonResponse(res, {
             error: 'project_mismatch',

[Survived] ConditionalExpression
src/daemon.mjs:544:11
       }
 
       // /mcp — MCP JSON-RPC over HTTP
-      if (url.pathname === '/mcp' || url.pathname.startsWith('/mcp/')) {
+      if (true) {
         return await this._handleMcp(req, res);
       }

[Survived] LogicalOperator
src/daemon.mjs:544:11
       }
 
       // /mcp — MCP JSON-RPC over HTTP
-      if (url.pathname === '/mcp' || url.pathname.startsWith('/mcp/')) {
+      if (url.pathname === '/mcp' && url.pathname.startsWith('/mcp/')) {
         return await this._handleMcp(req, res);
       }

[Survived] ConditionalExpression
src/daemon.mjs:549:11
       }
 
       // /api/v1/* — REST API
-      if (url.pathname.startsWith('/api/v1')) {
+      if (false) {
         return await this._handleApi(req, res, url);
       }

[Survived] ConditionalExpression
src/daemon.mjs:549:11
       }
 
       // /api/v1/* — REST API
-      if (url.pathname.startsWith('/api/v1')) {
+      if (true) {
         return await this._handleApi(req, res, url);
       }

[Survived] MethodExpression
src/daemon.mjs:554:35
       }
 
       // / — Web Dashboard
-      if (url.pathname === '/' || url.pathname.startsWith('/web')) {
+      if (url.pathname === '/' || url.pathname.endsWith('/web')) {
         return this._handleWebUI(res, url.pathname);
       }

[Survived] BlockStatement
src/daemon.mjs:554:68
       }
 
       // / — Web Dashboard
-      if (url.pathname === '/' || url.pathname.startsWith('/web')) {
-        return this._handleWebUI(res, url.pathname);
-      }
+      if (url.pathname === '/' || url.pathname.startsWith('/web')) {}
 
       // 404

[Survived] StringLiteral
src/daemon.mjs:559:34
       }
 
       // 404
-      jsonResponse(res, { error: 'Not Found' }, 404);
+      jsonResponse(res, { error: "" }, 404);
     } catch (err) {
       console.error('[awareness-local] request error:', err.message);

[Survived] BlockStatement
src/daemon.mjs:560:19
 
       // 404
       jsonResponse(res, { error: 'Not Found' }, 404);
-    } catch (err) {
-      console.error('[awareness-local] request error:', err.message);
-      track('error_occurred', { error_code: err.code || 'unknown', component: 'api' });
-      jsonResponse(res, { error: 'Internal Server Error' }, 500);
-    }
+    } catch (err) {}
   }
 

[Survived] StringLiteral
src/daemon.mjs:561:21
       // 404
       jsonResponse(res, { error: 'Not Found' }, 404);
     } catch (err) {
-      console.error('[awareness-local] request error:', err.message);
+      console.error("", err.message);
       track('error_occurred', { error_code: err.code || 'unknown', component: 'api' });
       jsonResponse(res, { error: 'Internal Server Error' }, 500);

[Survived] LogicalOperator
src/daemon.mjs:562:45
       jsonResponse(res, { error: 'Not Found' }, 404);
     } catch (err) {
       console.error('[awareness-local] request error:', err.message);
-      track('error_occurred', { error_code: err.code || 'unknown', component: 'api' });
+      track('error_occurred', { error_code: err.code && 'unknown', component: 'api' });
       jsonResponse(res, { error: 'Internal Server Error' }, 500);
     }

[Survived] ConditionalExpression
src/daemon.mjs:562:45
       jsonResponse(res, { error: 'Not Found' }, 404);
     } catch (err) {
       console.error('[awareness-local] request error:', err.message);
-      track('error_occurred', { error_code: err.code || 'unknown', component: 'api' });
+      track('error_occurred', { error_code: false, component: 'api' });
       jsonResponse(res, { error: 'Internal Server Error' }, 500);
     }

[Survived] BlockStatement
src/daemon.mjs:570:23
   /**
    * GET /healthz — health check + stats.
    */
-  _handleHealthz(res) {
-    return handleHealthz(this, res, { version: PKG_VERSION });
-  }
+  _handleHealthz(res) {}
 
   /**

[Survived] ObjectLiteral
src/daemon.mjs:571:37
    * GET /healthz — health check + stats.
    */
   _handleHealthz(res) {
-    return handleHealthz(this, res, { version: PKG_VERSION });
+    return handleHealthz(this, res, {});
   }
 

[Survived] BlockStatement
src/daemon.mjs:582:30
    * (which requires specific Express-like middleware), we handle the
    * JSON-RPC protocol directly — simpler and zero-dep.
    */
-  async _handleMcp(req, res) {
-    return handleMcpHttp({
-      req,
-      res,
-      version: PKG_VERSION,
-      dispatchJsonRpc: (rpcRequest) => this._dispatchJsonRpc(rpcRequest),
-    });
-  }
+  async _handleMcp(req, res) {}
 
   /**

[Survived] ObjectLiteral
src/daemon.mjs:583:26
    * JSON-RPC protocol directly — simpler and zero-dep.
    */
   async _handleMcp(req, res) {
-    return handleMcpHttp({
-      req,
-      res,
-      version: PKG_VERSION,
-      dispatchJsonRpc: (rpcRequest) => this._dispatchJsonRpc(rpcRequest),
-    });
+    return handleMcpHttp({});
   }
 

[Survived] ArrowFunction
src/daemon.mjs:587:24
       req,
       res,
       version: PKG_VERSION,
-      dispatchJsonRpc: (rpcRequest) => this._dispatchJsonRpc(rpcRequest),
+      dispatchJsonRpc: () => undefined,
     });
   }

[Survived] BlockStatement
src/daemon.mjs:597:38
    * @param {object} rpcRequest
    * @returns {object} JSON-RPC response
    */
-  async _dispatchJsonRpc(rpcRequest) {
-    return dispatchJsonRpcRequest({
-      rpcRequest,
-      getToolDefinitions: () => this._getToolDefinitions(),
-      callTool: (name, args) => this._callTool(name, args),
-    });
-  }
+  async _dispatchJsonRpc(rpcRequest) {}
 
   /**
