[Survived] ObjectLiteral
src/daemon.mjs:598:35
    * @returns {object} JSON-RPC response
    */
   async _dispatchJsonRpc(rpcRequest) {
-    return dispatchJsonRpcRequest({
-      rpcRequest,
-      getToolDefinitions: () => this._getToolDefinitions(),
-      callTool: (name, args) => this._callTool(name, args),
-    });
+    return dispatchJsonRpcRequest({});
   }
 

[Survived] ArrowFunction
src/daemon.mjs:600:27
   async _dispatchJsonRpc(rpcRequest) {
     return dispatchJsonRpcRequest({
       rpcRequest,
-      getToolDefinitions: () => this._getToolDefinitions(),
+      getToolDefinitions: () => undefined,
       callTool: (name, args) => this._callTool(name, args),
     });

[Survived] ArrowFunction
src/daemon.mjs:601:17
     return dispatchJsonRpcRequest({
       rpcRequest,
       getToolDefinitions: () => this._getToolDefinitions(),
-      callTool: (name, args) => this._callTool(name, args),
+      callTool: () => undefined,
     });
   }

[Survived] BlockStatement
src/daemon.mjs:609:25
    * Return MCP tool definitions for tools/list.
    * @returns {Array<object>}
    */
-  _getToolDefinitions() {
-    return getToolDefinitions();
-  }
+  _getToolDefinitions() {}
 
   /**

[Survived] BlockStatement
src/daemon.mjs:621:31
    * @param {object} args — tool arguments
    * @returns {object} MCP result envelope
    */
-  async _callTool(name, args) {
-    return callMcpTool(this, name, args);
-  }
+  async _callTool(name, args) {}
 
   // -----------------------------------------------------------------------

[Survived] BlockStatement
src/daemon.mjs:635:35
    * @param {http.ServerResponse} res
    * @param {URL} url
    */
-  async _handleApi(req, res, url) {
-    return handleApiRoute(this, req, res, url);
-  }
+  async _handleApi(req, res, url) {}
 
   /** Simple HTTP JSON request helper for cloud API calls. */

[Survived] BlockStatement
src/daemon.mjs:640:67
   }
 
   /** Simple HTTP JSON request helper for cloud API calls. */
-  async _httpJson(method, urlStr, body = null, extraHeaders = {}) {
-    return httpJson(method, urlStr, body, extraHeaders);
-  }
+  async _httpJson(method, urlStr, body = null, extraHeaders = {}) {}
 
   // -----------------------------------------------------------------------

[Survived] BlockStatement
src/daemon.mjs:651:37
   /**
    * Serve the web dashboard SPA from web/index.html.
    */
-  _handleWebUI(res, pathname = '/') {
-    return handleWebUi(res, import.meta.url, pathname);
-  }
+  _handleWebUI(res, pathname = '/') {}
 
   // -----------------------------------------------------------------------

[Survived] StringLiteral
src/daemon.mjs:651:32
   /**
    * Serve the web dashboard SPA from web/index.html.
    */
-  _handleWebUI(res, pathname = '/') {
+  _handleWebUI(res, pathname = "") {
     return handleWebUi(res, import.meta.url, pathname);
   }

[Survived] ConditionalExpression
src/daemon.mjs:671:9
     const results = new Map(); // id → { card, score }
 
     // Channel 1: FTS5 search (sanitiseFtsQuery now handles CJK trigram splitting)
-    if (this.indexer.searchKnowledge) {
+    if (false) {
       try {
         const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });

[Survived] BlockStatement
src/daemon.mjs:671:39
     const results = new Map(); // id → { card, score }
 
     // Channel 1: FTS5 search (sanitiseFtsQuery now handles CJK trigram splitting)
-    if (this.indexer.searchKnowledge) {
-      try {
-        const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
-        for (const r of ftsResults) {
-          results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });
-        }
-      } catch { /* FTS error — skip */ }
-    }
+    if (this.indexer.searchKnowledge) {}
 
     // Channel 2: Embedding cosine similarity (if available)

[Survived] BlockStatement
src/daemon.mjs:672:11
 
     // Channel 1: FTS5 search (sanitiseFtsQuery now handles CJK trigram splitting)
     if (this.indexer.searchKnowledge) {
-      try {
-        const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
-        for (const r of ftsResults) {
-          results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });
-        }
-      } catch { /* FTS error — skip */ }
+      try {} catch { /* FTS error — skip */ }
     }
 

[Survived] ArithmeticOperator
src/daemon.mjs:673:73
     // Channel 1: FTS5 search (sanitiseFtsQuery now handles CJK trigram splitting)
     if (this.indexer.searchKnowledge) {
       try {
-        const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
+        const ftsResults = this.indexer.searchKnowledge(query, { limit: limit / 2 });
         for (const r of ftsResults) {
           results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });

[Survived] ObjectLiteral
src/daemon.mjs:673:64
     // Channel 1: FTS5 search (sanitiseFtsQuery now handles CJK trigram splitting)
     if (this.indexer.searchKnowledge) {
       try {
-        const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
+        const ftsResults = this.indexer.searchKnowledge(query, {});
         for (const r of ftsResults) {
           results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });

[Survived] BlockStatement
src/daemon.mjs:674:37
     if (this.indexer.searchKnowledge) {
       try {
         const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
-        for (const r of ftsResults) {
-          results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });
-        }
+        for (const r of ftsResults) {}
       } catch { /* FTS error — skip */ }
     }

[Survived] ArithmeticOperator
src/daemon.mjs:675:58
       try {
         const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
         for (const r of ftsResults) {
-          results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });
+          results.set(r.id, { card: r, score: 1 / (60 + (results.size - 1)) });
         }
       } catch { /* FTS error — skip */ }

[Survived] ArithmeticOperator
src/daemon.mjs:675:52
       try {
         const ftsResults = this.indexer.searchKnowledge(query, { limit: limit * 2 });
         for (const r of ftsResults) {
-          results.set(r.id, { card: r, score: 1 / (60 + (results.size + 1)) });
+          results.set(r.id, { card: r, score: 1 / (60 - (results.size + 1)) });
         }
       } catch { /* FTS error — skip */ }

[Survived] ConditionalExpression
src/daemon.mjs:681:9
     }
 
     // Channel 2: Embedding cosine similarity (if available)
-    if (this._embedder) {
+    if (true) {
       try {
         const available = await this._embedder.isEmbeddingAvailable();

[Survived] BlockStatement
src/daemon.mjs:681:25
     }
 
     // Channel 2: Embedding cosine similarity (if available)
-    if (this._embedder) {
-      try {
-        const available = await this._embedder.isEmbeddingAvailable();
-        if (available) {
-          // Use one consistent model for query+card embedding comparison
-          const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';
-          const queryVec = await this._embedder.embed(query, 'query', embLang);
-          const allCards = this.indexer.db
-            .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
-            .all();
-          for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
-            try {
-              // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
-              const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
-              const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
-            } catch { /* skip individual card errors */ }
-          }
-        }
-      } catch { /* Embedder not available — FTS-only */ }
-    }
+    if (this._embedder) {}
 
     // Sort by combined score descending

[Survived] BlockStatement
src/daemon.mjs:682:11
 
     // Channel 2: Embedding cosine similarity (if available)
     if (this._embedder) {
-      try {
-        const available = await this._embedder.isEmbeddingAvailable();
-        if (available) {
-          // Use one consistent model for query+card embedding comparison
-          const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';
-          const queryVec = await this._embedder.embed(query, 'query', embLang);
-          const allCards = this.indexer.db
-            .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
-            .all();
-          for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
-            try {
-              // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
-              const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
-              const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
-            } catch { /* skip individual card errors */ }
-          }
-        }
-      } catch { /* Embedder not available — FTS-only */ }
+      try {} catch { /* Embedder not available — FTS-only */ }
     }
 

[Survived] BlockStatement
src/daemon.mjs:684:24
     if (this._embedder) {
       try {
         const available = await this._embedder.isEmbeddingAvailable();
-        if (available) {
-          // Use one consistent model for query+card embedding comparison
-          const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';
-          const queryVec = await this._embedder.embed(query, 'query', embLang);
-          const allCards = this.indexer.db
-            .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
-            .all();
-          for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
-            try {
-              // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
-              const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
-              const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
-            } catch { /* skip individual card errors */ }
-          }
-        }
+        if (available) {}
       } catch { /* Embedder not available — FTS-only */ }
     }

[Survived] ConditionalExpression
src/daemon.mjs:684:13
     if (this._embedder) {
       try {
         const available = await this._embedder.isEmbeddingAvailable();
-        if (available) {
+        if (true) {
           // Use one consistent model for query+card embedding comparison
           const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';

[Survived] StringLiteral
src/daemon.mjs:686:68
         const available = await this._embedder.isEmbeddingAvailable();
         if (available) {
           // Use one consistent model for query+card embedding comparison
-          const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';
+          const embLang = detectNeedsCJK(query) ? 'multilingual' : "";
           const queryVec = await this._embedder.embed(query, 'query', embLang);
           const allCards = this.indexer.db

[Survived] StringLiteral
src/daemon.mjs:687:62
         if (available) {
           // Use one consistent model for query+card embedding comparison
           const embLang = detectNeedsCJK(query) ? 'multilingual' : 'english';
-          const queryVec = await this._embedder.embed(query, 'query', embLang);
+          const queryVec = await this._embedder.embed(query, "", embLang);
           const allCards = this.indexer.db
             .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")

[Survived] BlockStatement
src/daemon.mjs:691:40
           const allCards = this.indexer.db
             .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
             .all();
-          for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
-            try {
-              // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
-              const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
-              const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
-            } catch { /* skip individual card errors */ }
-          }
+          for (const card of allCards) {}
         }
       } catch { /* Embedder not available — FTS-only */ }

[Survived] ConditionalExpression
src/daemon.mjs:692:33
             .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
             .all();
           for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
+            const cardText = `${true} ${card.summary || ''}`.trim();
             if (!cardText) continue;
             try {

[Survived] ConditionalExpression
src/daemon.mjs:692:53
             .prepare("SELECT * FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 50")
             .all();
           for (const card of allCards) {
-            const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
+            const cardText = `${card.title || ''} ${false}`.trim();
             if (!cardText) continue;
             try {

[Survived] ConditionalExpression
src/daemon.mjs:693:17
             .all();
           for (const card of allCards) {
             const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
+            if (false) continue;
             try {
               // Use same model as query to ensure vectors are in same space

[Survived] BooleanLiteral
src/daemon.mjs:693:17
             .all();
           for (const card of allCards) {
             const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
-            if (!cardText) continue;
+            if (cardText) continue;
             try {
               // Use same model as query to ensure vectors are in same space

[Survived] BlockStatement
src/daemon.mjs:694:17
           for (const card of allCards) {
             const cardText = `${card.title || ''} ${card.summary || ''}`.trim();
             if (!cardText) continue;
-            try {
-              // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
-              const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
-              const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
-            } catch { /* skip individual card errors */ }
+            try {} catch { /* skip individual card errors */ }
           }
         }

[Survived] StringLiteral
src/daemon.mjs:696:68
             if (!cardText) continue;
             try {
               // Use same model as query to ensure vectors are in same space
-              const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
+              const cardVec = await this._embedder.embed(cardText, "", embLang);
               const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
               const existing = results.get(card.id);

[Survived] ConditionalExpression
src/daemon.mjs:699:32
               const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
               const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
               const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
+              const ftsScore = true;
               results.set(card.id, { card, score: ftsScore + sim });
             } catch { /* skip individual card errors */ }

[Survived] OptionalChaining
src/daemon.mjs:699:32
               const cardVec = await this._embedder.embed(cardText, 'passage', embLang);
               const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
               const existing = results.get(card.id);
-              const ftsScore = existing?.score || 0;
+              const ftsScore = existing.score || 0;
               results.set(card.id, { card, score: ftsScore + sim });
             } catch { /* skip individual card errors */ }

[Survived] ArithmeticOperator
src/daemon.mjs:700:51
               const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
               const existing = results.get(card.id);
               const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
+              results.set(card.id, { card, score: ftsScore - sim });
             } catch { /* skip individual card errors */ }
           }

[Survived] ObjectLiteral
src/daemon.mjs:700:36
               const sim = this._embedder.cosineSimilarity(queryVec, cardVec);
               const existing = results.get(card.id);
               const ftsScore = existing?.score || 0;
-              results.set(card.id, { card, score: ftsScore + sim });
+              results.set(card.id, {});
             } catch { /* skip individual card errors */ }
           }

[Survived] MethodExpression
src/daemon.mjs:708:20
     }
 
     // Sort by combined score descending
-    const sorted = [...results.values()]
-      .sort((a, b) => b.score - a.score)
+    const sorted = [...results.values()]
       .slice(0, limit)
       .map(r => r.card);

[Survived] MethodExpression
src/daemon.mjs:708:20
     }
 
     // Sort by combined score descending
-    const sorted = [...results.values()]
-      .sort((a, b) => b.score - a.score)
-      .slice(0, limit)
+    const sorted = [...results.values()].sort((a, b) => b.score - a.score)
       .map(r => r.card);
 

[Survived] ArithmeticOperator
src/daemon.mjs:709:23
 
     // Sort by combined score descending
     const sorted = [...results.values()]
-      .sort((a, b) => b.score - a.score)
+      .sort((a, b) => b.score + a.score)
       .slice(0, limit)
       .map(r => r.card);

[Survived] ArrowFunction
src/daemon.mjs:709:13
 
     // Sort by combined score descending
     const sorted = [...results.values()]
-      .sort((a, b) => b.score - a.score)
+      .sort(() => undefined)
       .slice(0, limit)
       .map(r => r.card);

[Survived] ArrowFunction
src/daemon.mjs:711:12
     const sorted = [...results.values()]
       .sort((a, b) => b.score - a.score)
       .slice(0, limit)
-      .map(r => r.card);
+      .map(() => undefined);
 
     // Supplement with recent cards if not enough results

[Survived] EqualityOperator
src/daemon.mjs:714:9
       .map(r => r.card);
 
     // Supplement with recent cards if not enough results
-    if (sorted.length < limit) {
+    if (sorted.length >= limit) {
       const matchedIds = new Set(sorted.map(c => c.id));
       const recent = this.indexer.getRecentKnowledge(limit)

[Survived] ConditionalExpression
src/daemon.mjs:714:9
       .map(r => r.card);
 
     // Supplement with recent cards if not enough results
-    if (sorted.length < limit) {
+    if (false) {
       const matchedIds = new Set(sorted.map(c => c.id));
       const recent = this.indexer.getRecentKnowledge(limit)

[Survived] ArrowFunction
src/daemon.mjs:715:45
 
     // Supplement with recent cards if not enough results
     if (sorted.length < limit) {
-      const matchedIds = new Set(sorted.map(c => c.id));
+      const matchedIds = new Set(sorted.map(() => undefined));
       const recent = this.indexer.getRecentKnowledge(limit)
         .filter(c => !matchedIds.has(c.id));

[Survived] MethodExpression
src/daemon.mjs:716:22
     // Supplement with recent cards if not enough results
     if (sorted.length < limit) {
       const matchedIds = new Set(sorted.map(c => c.id));
-      const recent = this.indexer.getRecentKnowledge(limit)
-        .filter(c => !matchedIds.has(c.id));
+      const recent = this.indexer.getRecentKnowledge(limit);
       return [...sorted, ...recent].slice(0, limit);
     }

[Survived] ArrowFunction
src/daemon.mjs:717:17
     if (sorted.length < limit) {
       const matchedIds = new Set(sorted.map(c => c.id));
       const recent = this.indexer.getRecentKnowledge(limit)
-        .filter(c => !matchedIds.has(c.id));
+        .filter(() => undefined);
       return [...sorted, ...recent].slice(0, limit);
     }

[Survived] BooleanLiteral
src/daemon.mjs:717:22
     if (sorted.length < limit) {
       const matchedIds = new Set(sorted.map(c => c.id));
       const recent = this.indexer.getRecentKnowledge(limit)
-        .filter(c => !matchedIds.has(c.id));
+        .filter(c => matchedIds.has(c.id));
       return [...sorted, ...recent].slice(0, limit);
     }

[Survived] MethodExpression
src/daemon.mjs:718:14
       const matchedIds = new Set(sorted.map(c => c.id));
       const recent = this.indexer.getRecentKnowledge(limit)
         .filter(c => !matchedIds.has(c.id));
-      return [...sorted, ...recent].slice(0, limit);
+      return [...sorted, ...recent];
     }
     return sorted;

[Survived] BlockStatement
src/daemon.mjs:724:26
   }
 
   /** Create a new session and return session metadata. */
-  _createSession(source) {
-    return this.indexer.createSession(source || 'local');
-  }
+  _createSession(source) {}
 
   /** Max content size per memory (1 MB). */

[Survived] LogicalOperator
src/daemon.mjs:725:39
 
   /** Create a new session and return session metadata. */
   _createSession(source) {
-    return this.indexer.createSession(source || 'local');
+    return this.indexer.createSession(source && 'local');
   }
 

[Survived] ConditionalExpression
src/daemon.mjs:725:39
 
   /** Create a new session and return session metadata. */
   _createSession(source) {
-    return this.indexer.createSession(source || 'local');
+    return this.indexer.createSession(false);
   }
 

[Survived] ArithmeticOperator
src/daemon.mjs:729:30
   }
 
   /** Max content size per memory (1 MB). */
-  static MAX_CONTENT_BYTES = 1024 * 1024;
+  static MAX_CONTENT_BYTES = 1024 / 1024;
 
   /** Write a single memory, index it, and trigger knowledge extraction. */

[Survived] ConditionalExpression
src/daemon.mjs:733:9
 
   /** Write a single memory, index it, and trigger knowledge extraction. */
   async _remember(params) {
-    if (!params.content) {
+    if (false) {
       return { error: 'content is required for remember action' };
     }

[Survived] ConditionalExpression
src/daemon.mjs:733:9
 
   /** Write a single memory, index it, and trigger knowledge extraction. */
   async _remember(params) {
-    if (!params.content) {
+    if (true) {
       return { error: 'content is required for remember action' };
     }

[Survived] StringLiteral
src/daemon.mjs:734:23
   /** Write a single memory, index it, and trigger knowledge extraction. */
   async _remember(params) {
     if (!params.content) {
-      return { error: 'content is required for remember action' };
+      return { error: "" };
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:738:9
     }
 
     const noiseReason = classifyNoiseEvent(params);
-    if (noiseReason) {
+    if (false) {
       return { status: 'skipped', reason: noiseReason };
     }

[Survived] BlockStatement
src/daemon.mjs:738:22
     }
 
     const noiseReason = classifyNoiseEvent(params);
-    if (noiseReason) {
-      return { status: 'skipped', reason: noiseReason };
-    }
+    if (noiseReason) {}
 
     // SECURITY H1: Reject oversized content to prevent FTS5/embedding freeze

[Survived] LogicalOperator
src/daemon.mjs:743:9
     }
 
     // SECURITY H1: Reject oversized content to prevent FTS5/embedding freeze
-    if (typeof params.content === 'string' && params.content.length > AwarenessLocalDaemon.MAX_CONTENT_BYTES) {
+    if (typeof params.content === 'string' || params.content.length > AwarenessLocalDaemon.MAX_CONTENT_BYTES) {
       return { error: `Content too large (${params.content.length} bytes, max ${AwarenessLocalDaemon.MAX_CONTENT_BYTES})` };
     }

[Survived] ConditionalExpression
src/daemon.mjs:743:47
     }
 
     // SECURITY H1: Reject oversized content to prevent FTS5/embedding freeze
-    if (typeof params.content === 'string' && params.content.length > AwarenessLocalDaemon.MAX_CONTENT_BYTES) {
+    if (typeof params.content === 'string' && true) {
       return { error: `Content too large (${params.content.length} bytes, max ${AwarenessLocalDaemon.MAX_CONTENT_BYTES})` };
     }

[Survived] ConditionalExpression
src/daemon.mjs:748:17
     }
 
     // Auto-generate title from content if not provided
-    let title = params.title || '';
+    let title = false;
     if (!title && params.content) {
       // Take first sentence or first 80 chars, whichever is shorter

[Survived] LogicalOperator
src/daemon.mjs:748:17
     }
 
     // Auto-generate title from content if not provided
-    let title = params.title || '';
+    let title = params.title && '';
     if (!title && params.content) {
       // Take first sentence or first 80 chars, whichever is shorter

[Survived] BlockStatement
src/daemon.mjs:749:35
 
     // Auto-generate title from content if not provided
     let title = params.title || '';
-    if (!title && params.content) {
-      // Take first sentence or first 80 chars, whichever is shorter
-      const firstLine = params.content.split(/[.\n!?。！？]/)[0].trim();
-      title = firstLine.length > 80 ? firstLine.substring(0, 77) + '...' : firstLine;
-    }
+    if (!title && params.content) {}
 
     const memory = {

[Survived] ConditionalExpression
src/daemon.mjs:749:9
 
     // Auto-generate title from content if not provided
     let title = params.title || '';
-    if (!title && params.content) {
+    if (false) {
       // Take first sentence or first 80 chars, whichever is shorter
       const firstLine = params.content.split(/[.\n!?。！？]/)[0].trim();

[Survived] MethodExpression
src/daemon.mjs:751:25
     let title = params.title || '';
     if (!title && params.content) {
       // Take first sentence or first 80 chars, whichever is shorter
-      const firstLine = params.content.split(/[.\n!?。！？]/)[0].trim();
+      const firstLine = params.content.split(/[.\n!?。！？]/)[0];
       title = firstLine.length > 80 ? firstLine.substring(0, 77) + '...' : firstLine;
     }

[Survived] EqualityOperator
src/daemon.mjs:752:15
     if (!title && params.content) {
       // Take first sentence or first 80 chars, whichever is shorter
       const firstLine = params.content.split(/[.\n!?。！？]/)[0].trim();
-      title = firstLine.length > 80 ? firstLine.substring(0, 77) + '...' : firstLine;
+      title = firstLine.length <= 80 ? firstLine.substring(0, 77) + '...' : firstLine;
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:752:15
     if (!title && params.content) {
       // Take first sentence or first 80 chars, whichever is shorter
       const firstLine = params.content.split(/[.\n!?。！？]/)[0].trim();
-      title = firstLine.length > 80 ? firstLine.substring(0, 77) + '...' : firstLine;
+      title = true ? firstLine.substring(0, 77) + '...' : firstLine;
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:756:13
     }
 
     const memory = {
-      type: params.event_type || 'turn_summary',
+      type: true,
       content: params.content,
       title,

[Survived] LogicalOperator
src/daemon.mjs:756:13
     }
 
     const memory = {
-      type: params.event_type || 'turn_summary',
+      type: params.event_type && 'turn_summary',
       content: params.content,
       title,

[Survived] ConditionalExpression
src/daemon.mjs:759:13
       type: params.event_type || 'turn_summary',
       content: params.content,
       title,
-      tags: params.tags || [],
+      tags: true,
       agent_role: params.agent_role || 'builder_agent',
       session_id: params.session_id || '',

[Survived] LogicalOperator
src/daemon.mjs:759:13
       type: params.event_type || 'turn_summary',
       content: params.content,
       title,
-      tags: params.tags || [],
+      tags: params.tags && [],
       agent_role: params.agent_role || 'builder_agent',
       session_id: params.session_id || '',

[Survived] LogicalOperator
src/daemon.mjs:760:19
       content: params.content,
       title,
       tags: params.tags || [],
-      agent_role: params.agent_role || 'builder_agent',
+      agent_role: params.agent_role && 'builder_agent',
       session_id: params.session_id || '',
       source: params.source || 'mcp',

[Survived] ConditionalExpression
src/daemon.mjs:760:19
       content: params.content,
       title,
       tags: params.tags || [],
-      agent_role: params.agent_role || 'builder_agent',
+      agent_role: false,
       session_id: params.session_id || '',
       source: params.source || 'mcp',
