[Survived] ConditionalExpression
src/daemon.mjs:761:19
       title,
       tags: params.tags || [],
       agent_role: params.agent_role || 'builder_agent',
-      session_id: params.session_id || '',
+      session_id: true,
       source: params.source || 'mcp',
     };

[Survived] LogicalOperator
src/daemon.mjs:761:19
       title,
       tags: params.tags || [],
       agent_role: params.agent_role || 'builder_agent',
-      session_id: params.session_id || '',
+      session_id: params.session_id && '',
       source: params.source || 'mcp',
     };

[Survived] ConditionalExpression
src/daemon.mjs:762:15
       tags: params.tags || [],
       agent_role: params.agent_role || 'builder_agent',
       session_id: params.session_id || '',
-      source: params.source || 'mcp',
+      source: false,
     };
 

[Survived] ConditionalExpression
src/daemon.mjs:762:15
       tags: params.tags || [],
       agent_role: params.agent_role || 'builder_agent',
       session_id: params.session_id || '',
-      source: params.source || 'mcp',
+      source: true,
     };
 

[Survived] BlockStatement
src/daemon.mjs:778:38
     this._extractAndIndex(id, params.content, memory, params.insights);
 
     // Cloud sync (fire-and-forget — don't block the response)
-    if (this.cloudSync?.isEnabled()) {
-      Promise.all([
-        this.cloudSync.syncToCloud(),
-        this.cloudSync.syncInsightsToCloud(),
-        this.cloudSync.syncTasksToCloud(),
-      ]).catch((err) => {
-        console.warn('[awareness-local] cloud sync after remember failed:', err.message);
-      });
-    }
+    if (this.cloudSync?.isEnabled()) {}
 
     // Lifecycle: auto-resolve tasks/risks, garbage collect (fire-and-forget, hybrid FTS5+embedding)

[Survived] ConditionalExpression
src/daemon.mjs:778:9
     this._extractAndIndex(id, params.content, memory, params.insights);
 
     // Cloud sync (fire-and-forget — don't block the response)
-    if (this.cloudSync?.isEnabled()) {
+    if (false) {
       Promise.all([
         this.cloudSync.syncToCloud(),

[Survived] BlockStatement
src/daemon.mjs:783:25
         this.cloudSync.syncToCloud(),
         this.cloudSync.syncInsightsToCloud(),
         this.cloudSync.syncTasksToCloud(),
-      ]).catch((err) => {
-        console.warn('[awareness-local] cloud sync after remember failed:', err.message);
-      });
+      ]).catch((err) => {});
     }
 

[Survived] BlockStatement
src/daemon.mjs:790:25
 
     // Lifecycle: auto-resolve tasks/risks, garbage collect (fire-and-forget, hybrid FTS5+embedding)
     const lifecycleOpts = {};
-    if (this._embedder) {
-      lifecycleOpts.embedFn = (text, type) => this._embedder.embed(text, type);
-      lifecycleOpts.cosineFn = this._embedder.cosineSimilarity;
-    }
+    if (this._embedder) {}
     const lifecycle = await runLifecycleChecks(this.indexer, params.content, title, params.insights, lifecycleOpts);
 

[Survived] ConditionalExpression
src/daemon.mjs:790:9
 
     // Lifecycle: auto-resolve tasks/risks, garbage collect (fire-and-forget, hybrid FTS5+embedding)
     const lifecycleOpts = {};
-    if (this._embedder) {
+    if (false) {
       lifecycleOpts.embedFn = (text, type) => this._embedder.embed(text, type);
       lifecycleOpts.cosineFn = this._embedder.cosineSimilarity;

[Survived] ArrowFunction
src/daemon.mjs:791:31
     // Lifecycle: auto-resolve tasks/risks, garbage collect (fire-and-forget, hybrid FTS5+embedding)
     const lifecycleOpts = {};
     if (this._embedder) {
-      lifecycleOpts.embedFn = (text, type) => this._embedder.embed(text, type);
+      lifecycleOpts.embedFn = () => undefined;
       lifecycleOpts.cosineFn = this._embedder.cosineSimilarity;
     }

[Survived] ConditionalExpression
src/daemon.mjs:801:29
 
     // Fire-and-forget: LLM auto-resolve check on existing active perceptions
     this._checkPerceptionResolution(id, { title, content: params.content, tags: memory.tags, insights: params.insights })
-      .catch((err) => { if (process.env.DEBUG) console.warn('[awareness-local] perception resolve failed:', err.message); });
+      .catch((err) => { if (false) console.warn('[awareness-local] perception resolve failed:', err.message); });
 
     const result = {

[Survived] BlockStatement
src/daemon.mjs:801:23
 
     // Fire-and-forget: LLM auto-resolve check on existing active perceptions
     this._checkPerceptionResolution(id, { title, content: params.content, tags: memory.tags, insights: params.insights })
-      .catch((err) => { if (process.env.DEBUG) console.warn('[awareness-local] perception resolve failed:', err.message); });
+      .catch((err) => {});
 
     const result = {

[Survived] ConditionalExpression
src/daemon.mjs:813:9
     // Return _extraction_instruction when the caller didn't provide pre-extracted insights.
     // This mirrors the cloud MCP backend behaviour: the client LLM does extraction using
     // its own model, then calls awareness_record(action="submit_insights") with the result.
-    if (shouldRequestExtraction(params)) {
+    if (true) {
       try {
         const existingCards = this.indexer.db

[Survived] ConditionalExpression
src/daemon.mjs:813:9
     // Return _extraction_instruction when the caller didn't provide pre-extracted insights.
     // This mirrors the cloud MCP backend behaviour: the client LLM does extraction using
     // its own model, then calls awareness_record(action="submit_insights") with the result.
-    if (shouldRequestExtraction(params)) {
+    if (false) {
       try {
         const existingCards = this.indexer.db

[Survived] BlockStatement
src/daemon.mjs:814:11
     // This mirrors the cloud MCP backend behaviour: the client LLM does extraction using
     // its own model, then calls awareness_record(action="submit_insights") with the result.
     if (shouldRequestExtraction(params)) {
-      try {
-        const existingCards = this.indexer.db
-          .prepare("SELECT id, title, category, summary FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 8")
-          .all();
-        const spec = this._loadSpec();
-        result._extraction_instruction = buildExtractionInstruction({
-          content: params.content,
-          memoryId: id,
-          existingCards,
-          spec,
-        });
-      } catch (_err) {
+      try {} catch (_err) {
         // Non-fatal: extraction instruction is best-effort
       }

[Survived] StringLiteral
src/daemon.mjs:816:20
     if (shouldRequestExtraction(params)) {
       try {
         const existingCards = this.indexer.db
-          .prepare("SELECT id, title, category, summary FROM knowledge_cards WHERE status = 'active' ORDER BY created_at DESC LIMIT 8")
+          .prepare("")
           .all();
         const spec = this._loadSpec();

[Survived] EqualityOperator
src/daemon.mjs:830:23
       }
     }
 
-    if (perception && perception.length > 0) {
+    if (perception && perception.length <= 0) {
       result.perception = perception;
     }

[Survived] BlockStatement
src/daemon.mjs:830:46
       }
     }
 
-    if (perception && perception.length > 0) {
-      result.perception = perception;
-    }
+    if (perception && perception.length > 0) {}
 
     // Surface lifecycle actions in response

[Survived] ConditionalExpression
src/daemon.mjs:835:9
     }
 
     // Surface lifecycle actions in response
-    if (lifecycle.resolved_tasks.length > 0) {
+    if (true) {
       result.resolved_tasks = lifecycle.resolved_tasks;
     }

[Survived] EqualityOperator
src/daemon.mjs:835:9
     }
 
     // Surface lifecycle actions in response
-    if (lifecycle.resolved_tasks.length > 0) {
+    if (lifecycle.resolved_tasks.length >= 0) {
       result.resolved_tasks = lifecycle.resolved_tasks;
     }

[Survived] ConditionalExpression
src/daemon.mjs:838:9
     if (lifecycle.resolved_tasks.length > 0) {
       result.resolved_tasks = lifecycle.resolved_tasks;
     }
-    if (lifecycle.mitigated_risks.length > 0) {
+    if (true) {
       result.mitigated_risks = lifecycle.mitigated_risks;
     }

[Survived] EqualityOperator
src/daemon.mjs:838:9
     if (lifecycle.resolved_tasks.length > 0) {
       result.resolved_tasks = lifecycle.resolved_tasks;
     }
-    if (lifecycle.mitigated_risks.length > 0) {
+    if (lifecycle.mitigated_risks.length >= 0) {
       result.mitigated_risks = lifecycle.mitigated_risks;
     }

[Survived] ConditionalExpression
src/daemon.mjs:841:9
     if (lifecycle.mitigated_risks.length > 0) {
       result.mitigated_risks = lifecycle.mitigated_risks;
     }
-    if (lifecycle.archived > 0) {
+    if (false) {
       result.archived_count = lifecycle.archived;
     }

[Survived] EqualityOperator
src/daemon.mjs:841:9
     if (lifecycle.mitigated_risks.length > 0) {
       result.mitigated_risks = lifecycle.mitigated_risks;
     }
-    if (lifecycle.archived > 0) {
+    if (lifecycle.archived >= 0) {
       result.archived_count = lifecycle.archived;
     }

[Survived] ObjectLiteral
src/daemon.mjs:867:40
    * @returns {Array<Object>} perception signals (max 5)
    */
   _buildPerception(content, title, memory, insights) {
-    const signals = detectGuardSignals({
-      content,
-      title,
-      tags: memory?.tags,
-      insights,
-    }, {
+    const signals = detectGuardSignals({}, {
       profile: this.guardProfile,
     });

[Survived] OptionalChaining
src/daemon.mjs:870:13
     const signals = detectGuardSignals({
       content,
       title,
-      tags: memory?.tags,
+      tags: memory.tags,
       insights,
     }, {

[Survived] LogicalOperator
src/daemon.mjs:878:11
 
     try {
       // 1. Resonance: find similar existing knowledge cards via FTS5
-      if (title && title.length >= 5) {
+      if (title || title.length >= 5) {
         const resonanceResults = this.indexer.searchKnowledge(title, { limit: 2 });
         for (const r of resonanceResults) {

[Survived] EqualityOperator
src/daemon.mjs:878:20
 
     try {
       // 1. Resonance: find similar existing knowledge cards via FTS5
-      if (title && title.length >= 5) {
+      if (title && title.length < 5) {
         const resonanceResults = this.indexer.searchKnowledge(title, { limit: 2 });
         for (const r of resonanceResults) {

[Survived] BlockStatement
src/daemon.mjs:880:43
       // 1. Resonance: find similar existing knowledge cards via FTS5
       if (title && title.length >= 5) {
         const resonanceResults = this.indexer.searchKnowledge(title, { limit: 2 });
-        for (const r of resonanceResults) {
-          // BM25 rank: closer to 0 = better match. Only surface strong matches.
-          if (r.rank > -3.0) {
-            const daysAgo = r.created_at
-              ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)
-              : 0;
-            signals.push({
-              type: 'resonance',
-              title: r.title,
-              summary: r.summary || '',
-              category: r.category || '',
-              card_id: r.id,
-              days_ago: daysAgo,
-              message: `🌿 Similar past experience (${daysAgo}d ago): "${r.title}"`,
-            });
-          }
-        }
+        for (const r of resonanceResults) {}
       }
 

[Survived] BlockStatement
src/daemon.mjs:882:30
         const resonanceResults = this.indexer.searchKnowledge(title, { limit: 2 });
         for (const r of resonanceResults) {
           // BM25 rank: closer to 0 = better match. Only surface strong matches.
-          if (r.rank > -3.0) {
-            const daysAgo = r.created_at
-              ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)
-              : 0;
-            signals.push({
-              type: 'resonance',
-              title: r.title,
-              summary: r.summary || '',
-              category: r.category || '',
-              card_id: r.id,
-              days_ago: daysAgo,
-              message: `🌿 Similar past experience (${daysAgo}d ago): "${r.title}"`,
-            });
-          }
+          if (r.rank > -3.0) {}
         }
       }

[Survived] EqualityOperator
src/daemon.mjs:882:15
         const resonanceResults = this.indexer.searchKnowledge(title, { limit: 2 });
         for (const r of resonanceResults) {
           // BM25 rank: closer to 0 = better match. Only surface strong matches.
-          if (r.rank > -3.0) {
+          if (r.rank >= -3.0) {
             const daysAgo = r.created_at
               ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)

[Survived] ArithmeticOperator
src/daemon.mjs:884:29
           // BM25 rank: closer to 0 = better match. Only surface strong matches.
           if (r.rank > -3.0) {
             const daysAgo = r.created_at
-              ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)
+              ? Math.floor((Date.now() + new Date(r.created_at).getTime()) / 86400000)
               : 0;
             signals.push({

[Survived] ArithmeticOperator
src/daemon.mjs:884:28
           // BM25 rank: closer to 0 = better match. Only surface strong matches.
           if (r.rank > -3.0) {
             const daysAgo = r.created_at
-              ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)
+              ? Math.floor((Date.now() - new Date(r.created_at).getTime()) * 86400000)
               : 0;
             signals.push({

[Survived] StringLiteral
src/daemon.mjs:887:21
               ? Math.floor((Date.now() - new Date(r.created_at).getTime()) / 86400000)
               : 0;
             signals.push({
-              type: 'resonance',
+              type: "",
               title: r.title,
               summary: r.summary || '',

[Survived] LogicalOperator
src/daemon.mjs:889:24
             signals.push({
               type: 'resonance',
               title: r.title,
-              summary: r.summary || '',
+              summary: r.summary && '',
               category: r.category || '',
               card_id: r.id,

[Survived] ConditionalExpression
src/daemon.mjs:890:25
               type: 'resonance',
               title: r.title,
               summary: r.summary || '',
-              category: r.category || '',
+              category: true,
               card_id: r.id,
               days_ago: daysAgo,

[Survived] ConditionalExpression
src/daemon.mjs:890:25
               type: 'resonance',
               title: r.title,
               summary: r.summary || '',
-              category: r.category || '',
+              category: false,
               card_id: r.id,
               days_ago: daysAgo,

[Survived] StringLiteral
src/daemon.mjs:893:24
               category: r.category || '',
               card_id: r.id,
               days_ago: daysAgo,
-              message: `🌿 Similar past experience (${daysAgo}d ago): "${r.title}"`,
+              message: ``
             });
           }

[Survived] ConditionalExpression
src/daemon.mjs:900:11
       }
 
       // 2. Pattern: detect recurring themes via tag co-occurrence (not just category count)
-      if (insights?.knowledge_cards?.length) {
+      if (true) {
         try {
           // Collect tags from the last 7 days of active cards

[Survived] ConditionalExpression
src/daemon.mjs:900:11
       }
 
       // 2. Pattern: detect recurring themes via tag co-occurrence (not just category count)
-      if (insights?.knowledge_cards?.length) {
+      if (false) {
         try {
           // Collect tags from the last 7 days of active cards

[Survived] StringLiteral
src/daemon.mjs:905:15
           // Collect tags from the last 7 days of active cards
           const recentCards = this.indexer.db
             .prepare(
-              `SELECT tags FROM knowledge_cards
-               WHERE status = 'active' AND created_at > datetime('now', '-7 days')`
+              ``
             )
             .all();

[Survived] BlockStatement
src/daemon.mjs:910:42
             )
             .all();
           const tagCounts = new Map();
-          for (const row of recentCards) {
-            let tags = [];
-            try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
-            for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
-                const k = t.toLowerCase();
-                tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
-              }
-            }
-          }
+          for (const row of recentCards) {}
           // Find dominant themes (3+ occurrences in 7 days)
           const themes = [...tagCounts.entries()]

[Survived] ArrayDeclaration
src/daemon.mjs:911:24
             .all();
           const tagCounts = new Map();
           for (const row of recentCards) {
-            let tags = [];
+            let tags = ["Stryker was here"];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {

[Survived] BlockStatement
src/daemon.mjs:912:17
           const tagCounts = new Map();
           for (const row of recentCards) {
             let tags = [];
-            try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
+            try {} catch { /* skip */ }
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {

[Survived] ConditionalExpression
src/daemon.mjs:912:37
           const tagCounts = new Map();
           for (const row of recentCards) {
             let tags = [];
-            try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
+            try { tags = JSON.parse(false); } catch { /* skip */ }
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {

[Survived] BlockStatement
src/daemon.mjs:913:35
           for (const row of recentCards) {
             let tags = [];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
-            for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
-                const k = t.toLowerCase();
-                tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
-              }
-            }
+            for (const t of tags) {}
           }
           // Find dominant themes (3+ occurrences in 7 days)

[Survived] ConditionalExpression
src/daemon.mjs:914:19
             let tags = [];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
+              if (true) {
                 const k = t.toLowerCase();
                 tagCounts.set(k, (tagCounts.get(k) || 0) + 1);

[Survived] ConditionalExpression
src/daemon.mjs:914:19
             let tags = [];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
+              if (true && t.length >= 2) {
                 const k = t.toLowerCase();
                 tagCounts.set(k, (tagCounts.get(k) || 0) + 1);

[Survived] MethodExpression
src/daemon.mjs:915:27
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {
-                const k = t.toLowerCase();
+                const k = t.toUpperCase();
                 tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
               }

[Survived] LogicalOperator
src/daemon.mjs:916:35
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {
                 const k = t.toLowerCase();
-                tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
+                tagCounts.set(k, (tagCounts.get(k) && 0) + 1);
               }
             }

[Survived] ConditionalExpression
src/daemon.mjs:916:35
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {
                 const k = t.toLowerCase();
-                tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
+                tagCounts.set(k, (false) + 1);
               }
             }

[Survived] MethodExpression
src/daemon.mjs:921:26
             }
           }
           // Find dominant themes (3+ occurrences in 7 days)
-          const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
-            .sort((a, b) => b[1] - a[1])
+          const themes = [...tagCounts.entries()].filter(([, count]) => count >= 3)
             .slice(0, 2);
           for (const [tag, count] of themes) {

[Survived] MethodExpression
src/daemon.mjs:921:26
             }
           }
           // Find dominant themes (3+ occurrences in 7 days)
-          const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
-            .sort((a, b) => b[1] - a[1])
-            .slice(0, 2);
+          const themes = [...tagCounts.entries()].filter(([, count]) => count >= 3).sort((a, b) => b[1] - a[1]);
           for (const [tag, count] of themes) {
             signals.push({

[Survived] ConditionalExpression
src/daemon.mjs:922:36
           }
           // Find dominant themes (3+ occurrences in 7 days)
           const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
+            .filter(([, count]) => true)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 2);

[Survived] ArrowFunction
src/daemon.mjs:922:21
           }
           // Find dominant themes (3+ occurrences in 7 days)
           const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
+            .filter(() => undefined)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 2);

[Survived] ArithmeticOperator
src/daemon.mjs:923:29
           // Find dominant themes (3+ occurrences in 7 days)
           const themes = [...tagCounts.entries()]
             .filter(([, count]) => count >= 3)
-            .sort((a, b) => b[1] - a[1])
+            .sort((a, b) => b[1] + a[1])
             .slice(0, 2);
           for (const [tag, count] of themes) {

[Survived] ArrowFunction
src/daemon.mjs:923:19
           // Find dominant themes (3+ occurrences in 7 days)
           const themes = [...tagCounts.entries()]
             .filter(([, count]) => count >= 3)
-            .sort((a, b) => b[1] - a[1])
+            .sort(() => undefined)
             .slice(0, 2);
           for (const [tag, count] of themes) {

[Survived] BlockStatement
src/daemon.mjs:925:46
             .filter(([, count]) => count >= 3)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 2);
-          for (const [tag, count] of themes) {
-            signals.push({
-              type: 'pattern',
-              tag,
-              count,
-              message: `🔄 Recurring theme in last 7 days: "${tag}" (${count} cards) — consider a systematic approach`,
-            });
-          }
+          for (const [tag, count] of themes) {}
         } catch { /* ignore */ }
       }

[Survived] ConditionalExpression
src/daemon.mjs:937:11
       }
 
       // 3. Staleness: find related but old knowledge (30-day threshold, unified)
-      if (title && title.length >= 5) {
+      if (false) {
         try {
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });

[Survived] ConditionalExpression
src/daemon.mjs:937:20
       }
 
       // 3. Staleness: find related but old knowledge (30-day threshold, unified)
-      if (title && title.length >= 5) {
+      if (title && true) {
         try {
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });

[Survived] BlockStatement
src/daemon.mjs:938:13
 
       // 3. Staleness: find related but old knowledge (30-day threshold, unified)
       if (title && title.length >= 5) {
-        try {
-          const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
-          for (const r of relatedResults) {
-            const ts = r.updated_at || r.created_at;
-            if (!ts) continue;
-            const daysOld = Math.floor(
-              (Date.now() - new Date(ts).getTime()) / 86400000
-            );
-            if (daysOld >= 30) {
-              signals.push({
-                type: 'staleness',
-                title: r.title,
-                category: r.category || '',
-                card_id: r.id,
-                days_since_update: daysOld,
-                message: `⏳ Related knowledge "${r.title}" hasn't been updated in ${daysOld} days — may be outdated`,
-              });
-              break; // Only 1 staleness signal
-            }
-          }
-        } catch { /* FTS query may fail on special chars */ }
+        try {} catch { /* FTS query may fail on special chars */ }
       }
 

[Survived] BlockStatement
src/daemon.mjs:940:43
       if (title && title.length >= 5) {
         try {
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
-          for (const r of relatedResults) {
-            const ts = r.updated_at || r.created_at;
-            if (!ts) continue;
-            const daysOld = Math.floor(
-              (Date.now() - new Date(ts).getTime()) / 86400000
-            );
-            if (daysOld >= 30) {
-              signals.push({
-                type: 'staleness',
-                title: r.title,
-                category: r.category || '',
-                card_id: r.id,
-                days_since_update: daysOld,
-                message: `⏳ Related knowledge "${r.title}" hasn't been updated in ${daysOld} days — may be outdated`,
-              });
-              break; // Only 1 staleness signal
-            }
-          }
+          for (const r of relatedResults) {}
         } catch { /* FTS query may fail on special chars */ }
       }

[Killed] LogicalOperator
src/daemon.mjs:941:24
         try {
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
           for (const r of relatedResults) {
-            const ts = r.updated_at || r.created_at;
+            const ts = r.updated_at && r.created_at;
             if (!ts) continue;
             const daysOld = Math.floor(
killedBy: All tests
statusReason: ▶ L4 E2E: Project isolation via X-Awareness-Project-Dir
  ✔ healthz is exempt from project validation (435.813334ms)

  ✔ matching project header passes through (2.7965ms)

  ✔ mismatching project header returns 409 (0.926166ms)

  ✔ no header (old client) still works (2.057ms)

[Killed] ConditionalExpression
src/daemon.mjs:941:24
         try {
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
           for (const r of relatedResults) {
-            const ts = r.updated_at || r.created_at;
+            const ts = true;
             if (!ts) continue;
             const daysOld = Math.floor(
killedBy: All tests
statusReason: ▶ L4 E2E: Project isolation via X-Awareness-Project-Dir
  ✔ healthz is exempt from project validation (196.693459ms)

  ✔ matching project header passes through (3.224125ms)

  ✔ mismatching project header returns 409 (0.806916ms)

  ✔ no header (old client) still works (2.191125ms)

[Survived] ConditionalExpression
src/daemon.mjs:942:17
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
           for (const r of relatedResults) {
             const ts = r.updated_at || r.created_at;
-            if (!ts) continue;
+            if (false) continue;
             const daysOld = Math.floor(
               (Date.now() - new Date(ts).getTime()) / 86400000

[Survived] BooleanLiteral
src/daemon.mjs:942:17
           const relatedResults = this.indexer.searchKnowledge(title, { limit: 3 });
           for (const r of relatedResults) {
             const ts = r.updated_at || r.created_at;
-            if (!ts) continue;
+            if (ts) continue;
             const daysOld = Math.floor(
               (Date.now() - new Date(ts).getTime()) / 86400000

[Survived] ArithmeticOperator
src/daemon.mjs:944:16
             const ts = r.updated_at || r.created_at;
             if (!ts) continue;
             const daysOld = Math.floor(
-              (Date.now() - new Date(ts).getTime()) / 86400000
+              (Date.now() + new Date(ts).getTime()) / 86400000
             );
             if (daysOld >= 30) {

[Survived] ArithmeticOperator
src/daemon.mjs:944:15
             const ts = r.updated_at || r.created_at;
             if (!ts) continue;
             const daysOld = Math.floor(
-              (Date.now() - new Date(ts).getTime()) / 86400000
+              (Date.now() - new Date(ts).getTime()) * 86400000
             );
             if (daysOld >= 30) {

[Survived] EqualityOperator
src/daemon.mjs:946:17
             const daysOld = Math.floor(
               (Date.now() - new Date(ts).getTime()) / 86400000
             );
-            if (daysOld >= 30) {
+            if (daysOld < 30) {
               signals.push({
                 type: 'staleness',

[Survived] EqualityOperator
src/daemon.mjs:946:17
             const daysOld = Math.floor(
               (Date.now() - new Date(ts).getTime()) / 86400000
             );
-            if (daysOld >= 30) {
+            if (daysOld > 30) {
               signals.push({
                 type: 'staleness',

[Survived] LogicalOperator
src/daemon.mjs:950:27
               signals.push({
                 type: 'staleness',
                 title: r.title,
-                category: r.category || '',
+                category: r.category && '',
                 card_id: r.id,
                 days_since_update: daysOld,

[Survived] ConditionalExpression
src/daemon.mjs:950:27
               signals.push({
                 type: 'staleness',
                 title: r.title,
-                category: r.category || '',
+                category: true,
                 card_id: r.id,
                 days_since_update: daysOld,
