[Survived] BlockStatement
src/daemon.mjs:963:11
 
       // 4. Contradiction: proactive detection via FTS + superseded cards
       // 4a. Surface recently superseded cards (7-day window)
-      try {
-        const sevenDaysAgo = new Date(Date.now() - 7 * 86400000).toISOString();
-        const superseded = this.indexer.db
-          .prepare(
-            `SELECT id, title, category, summary FROM knowledge_cards
-             WHERE status = 'superseded' AND updated_at > ?
-             ORDER BY updated_at DESC LIMIT 2`
-          )
-          .all(sevenDaysAgo);
-        for (const r of superseded) {
-          signals.push({
-            type: 'contradiction',
-            title: r.title,
-            summary: r.summary || '',
-            card_id: r.id,
-            message: `⚡ Recently superseded belief: "${r.title}" — verify current approach`,
-          });
-        }
-      } catch { /* ignore */ }
+      try {} catch { /* ignore */ }
 
       // 4b. Proactive: if new card is decision/problem_solution, check for conflicting active cards

[Survived] ArithmeticOperator
src/daemon.mjs:964:52
       // 4. Contradiction: proactive detection via FTS + superseded cards
       // 4a. Surface recently superseded cards (7-day window)
       try {
-        const sevenDaysAgo = new Date(Date.now() - 7 * 86400000).toISOString();
+        const sevenDaysAgo = new Date(Date.now() - 7 / 86400000).toISOString();
         const superseded = this.indexer.db
           .prepare(

[Survived] ArithmeticOperator
src/daemon.mjs:964:39
       // 4. Contradiction: proactive detection via FTS + superseded cards
       // 4a. Surface recently superseded cards (7-day window)
       try {
-        const sevenDaysAgo = new Date(Date.now() - 7 * 86400000).toISOString();
+        const sevenDaysAgo = new Date(Date.now() + 7 * 86400000).toISOString();
         const superseded = this.indexer.db
           .prepare(

[Survived] BlockStatement
src/daemon.mjs:972:37
              ORDER BY updated_at DESC LIMIT 2`
           )
           .all(sevenDaysAgo);
-        for (const r of superseded) {
-          signals.push({
-            type: 'contradiction',
-            title: r.title,
-            summary: r.summary || '',
-            card_id: r.id,
-            message: `⚡ Recently superseded belief: "${r.title}" — verify current approach`,
-          });
-        }
+        for (const r of superseded) {}
       } catch { /* ignore */ }
 

[Survived] StringLiteral
src/daemon.mjs:974:19
           .all(sevenDaysAgo);
         for (const r of superseded) {
           signals.push({
-            type: 'contradiction',
+            type: "",
             title: r.title,
             summary: r.summary || '',

[Survived] OptionalChaining
src/daemon.mjs:984:11
       } catch { /* ignore */ }
 
       // 4b. Proactive: if new card is decision/problem_solution, check for conflicting active cards
-      if (insights?.knowledge_cards?.length && title) {
+      if (insights.knowledge_cards?.length && title) {
         try {
           const newCard = insights.knowledge_cards[0];

[Survived] OptionalChaining
src/daemon.mjs:984:11
       } catch { /* ignore */ }
 
       // 4b. Proactive: if new card is decision/problem_solution, check for conflicting active cards
-      if (insights?.knowledge_cards?.length && title) {
+      if (insights?.knowledge_cards.length && title) {
         try {
           const newCard = insights.knowledge_cards[0];

[Survived] OptionalChaining
src/daemon.mjs:987:23
       if (insights?.knowledge_cards?.length && title) {
         try {
           const newCard = insights.knowledge_cards[0];
-          const cat = newCard?.category;
+          const cat = newCard.category;
           if (cat === 'decision' || cat === 'problem_solution') {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });

[Survived] ConditionalExpression
src/daemon.mjs:988:15
         try {
           const newCard = insights.knowledge_cards[0];
           const cat = newCard?.category;
-          if (cat === 'decision' || cat === 'problem_solution') {
+          if (false) {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });
             for (const existing of similar) {

[Survived] ConditionalExpression
src/daemon.mjs:988:15
         try {
           const newCard = insights.knowledge_cards[0];
           const cat = newCard?.category;
-          if (cat === 'decision' || cat === 'problem_solution') {
+          if (false || cat === 'problem_solution') {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });
             for (const existing of similar) {

[Survived] BlockStatement
src/daemon.mjs:990:45
           const cat = newCard?.category;
           if (cat === 'decision' || cat === 'problem_solution') {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });
-            for (const existing of similar) {
-              if (existing.category !== cat || !existing.summary) continue;
-              // Simple heuristic: if same category and same topic but different summary content
-              // (Jaccard similarity of words < 0.3), flag as potential contradiction
-              const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
-              const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
-              const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
-              const union = new Set([...newWords, ...oldWords]).size;
-              const jaccard = union > 0 ? intersection / union : 1;
-              if (jaccard < 0.3 && existing.id !== newCard.id) {
-                signals.push({
-                  type: 'contradiction',
-                  title: existing.title,
-                  summary: existing.summary,
-                  card_id: existing.id,
-                  similarity: jaccard,
-                  message: `⚡ New ${cat} may conflict with existing: "${existing.title}" — verify if the old approach is still valid`,
-                });
-                break;
-              }
-            }
+            for (const existing of similar) {}
           }
         } catch { /* ignore */ }

[Survived] ConditionalExpression
src/daemon.mjs:991:19
           if (cat === 'decision' || cat === 'problem_solution') {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });
             for (const existing of similar) {
-              if (existing.category !== cat || !existing.summary) continue;
+              if (true) continue;
               // Simple heuristic: if same category and same topic but different summary content
               // (Jaccard similarity of words < 0.3), flag as potential contradiction

[Survived] ConditionalExpression
src/daemon.mjs:991:19
           if (cat === 'decision' || cat === 'problem_solution') {
             const similar = this.indexer.searchKnowledge(title, { limit: 3 });
             for (const existing of similar) {
-              if (existing.category !== cat || !existing.summary) continue;
+              if (false) continue;
               // Simple heuristic: if same category and same topic but different summary content
               // (Jaccard similarity of words < 0.3), flag as potential contradiction

[Killed] LogicalOperator
src/daemon.mjs:994:41
               if (existing.category !== cat || !existing.summary) continue;
               // Simple heuristic: if same category and same topic but different summary content
               // (Jaccard similarity of words < 0.3), flag as potential contradiction
-              const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
+              const newWords = new Set((newCard.summary && '').toLowerCase().split(/\s+/));
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
killedBy: All tests
statusReason: ▶ L4 E2E: Project isolation via X-Awareness-Project-Dir
  ✔ healthz is exempt from project validation (122.727292ms)

  ✔ matching project header passes through (3.073583ms)

  ✔ mismatching project header returns 409 (0.989958ms)

  ✔ no header (old client) still works (1.595667ms)

[Survived] ConditionalExpression
src/daemon.mjs:994:41
               if (existing.category !== cat || !existing.summary) continue;
               // Simple heuristic: if same category and same topic but different summary content
               // (Jaccard similarity of words < 0.3), flag as potential contradiction
-              const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
+              const newWords = new Set((false).toLowerCase().split(/\s+/));
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;

[Survived] MethodExpression
src/daemon.mjs:995:40
               // Simple heuristic: if same category and same topic but different summary content
               // (Jaccard similarity of words < 0.3), flag as potential contradiction
               const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
-              const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
+              const oldWords = new Set(existing.summary.toUpperCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
               const union = new Set([...newWords, ...oldWords]).size;

[Survived] ArrowFunction
src/daemon.mjs:996:57
               // (Jaccard similarity of words < 0.3), flag as potential contradiction
               const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
-              const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
+              const intersection = [...newWords].filter(() => undefined).length;
               const union = new Set([...newWords, ...oldWords]).size;
               const jaccard = union > 0 ? intersection / union : 1;

[Survived] MethodExpression
src/daemon.mjs:996:36
               // (Jaccard similarity of words < 0.3), flag as potential contradiction
               const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
-              const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
+              const intersection = [...newWords].length;
               const union = new Set([...newWords, ...oldWords]).size;
               const jaccard = union > 0 ? intersection / union : 1;

[Survived] ArrayDeclaration
src/daemon.mjs:997:37
               const newWords = new Set((newCard.summary || '').toLowerCase().split(/\s+/));
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
-              const union = new Set([...newWords, ...oldWords]).size;
+              const union = new Set([]).size;
               const jaccard = union > 0 ? intersection / union : 1;
               if (jaccard < 0.3 && existing.id !== newCard.id) {

[Survived] ConditionalExpression
src/daemon.mjs:998:31
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
               const union = new Set([...newWords, ...oldWords]).size;
-              const jaccard = union > 0 ? intersection / union : 1;
+              const jaccard = false ? intersection / union : 1;
               if (jaccard < 0.3 && existing.id !== newCard.id) {
                 signals.push({

[Survived] EqualityOperator
src/daemon.mjs:998:31
               const oldWords = new Set(existing.summary.toLowerCase().split(/\s+/));
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
               const union = new Set([...newWords, ...oldWords]).size;
-              const jaccard = union > 0 ? intersection / union : 1;
+              const jaccard = union >= 0 ? intersection / union : 1;
               if (jaccard < 0.3 && existing.id !== newCard.id) {
                 signals.push({

[Survived] BlockStatement
src/daemon.mjs:999:64
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
               const union = new Set([...newWords, ...oldWords]).size;
               const jaccard = union > 0 ? intersection / union : 1;
-              if (jaccard < 0.3 && existing.id !== newCard.id) {
-                signals.push({
-                  type: 'contradiction',
-                  title: existing.title,
-                  summary: existing.summary,
-                  card_id: existing.id,
-                  similarity: jaccard,
-                  message: `⚡ New ${cat} may conflict with existing: "${existing.title}" — verify if the old approach is still valid`,
-                });
-                break;
-              }
+              if (jaccard < 0.3 && existing.id !== newCard.id) {}
             }
           }

[Survived] EqualityOperator
src/daemon.mjs:999:19
               const intersection = [...newWords].filter((w) => oldWords.has(w)).length;
               const union = new Set([...newWords, ...oldWords]).size;
               const jaccard = union > 0 ? intersection / union : 1;
-              if (jaccard < 0.3 && existing.id !== newCard.id) {
+              if (jaccard <= 0.3 && existing.id !== newCard.id) {
                 signals.push({
                   type: 'contradiction',

[Survived] StringLiteral
src/daemon.mjs:1006:28
                   summary: existing.summary,
                   card_id: existing.id,
                   similarity: jaccard,
-                  message: `⚡ New ${cat} may conflict with existing: "${existing.title}" — verify if the old approach is still valid`,
+                  message: ``,
                 });
                 break;

[Survived] OptionalChaining
src/daemon.mjs:1016:11
       }
 
       // 5. Related_decision: find prior decisions with overlapping tags
-      if (insights?.knowledge_cards?.length) {
+      if (insights.knowledge_cards?.length) {
         try {
           const newTags = new Set();

[Survived] ConditionalExpression
src/daemon.mjs:1016:11
       }
 
       // 5. Related_decision: find prior decisions with overlapping tags
-      if (insights?.knowledge_cards?.length) {
+      if (true) {
         try {
           const newTags = new Set();

[Survived] BlockStatement
src/daemon.mjs:1019:56
       if (insights?.knowledge_cards?.length) {
         try {
           const newTags = new Set();
-          for (const card of insights.knowledge_cards) {
-            const tags = card.tags || [];
-            for (const tag of (Array.isArray(tags) ? tags : [])) {
-              if (typeof tag === 'string' && tag.length >= 2) {
-                newTags.add(tag.toLowerCase());
-              }
-            }
-          }
+          for (const card of insights.knowledge_cards) {}
           if (newTags.size > 0) {
             const decisions = this.indexer.db

[Survived] LogicalOperator
src/daemon.mjs:1020:26
         try {
           const newTags = new Set();
           for (const card of insights.knowledge_cards) {
-            const tags = card.tags || [];
+            const tags = card.tags && [];
             for (const tag of (Array.isArray(tags) ? tags : [])) {
               if (typeof tag === 'string' && tag.length >= 2) {

[Survived] ConditionalExpression
src/daemon.mjs:1020:26
         try {
           const newTags = new Set();
           for (const card of insights.knowledge_cards) {
-            const tags = card.tags || [];
+            const tags = false;
             for (const tag of (Array.isArray(tags) ? tags : [])) {
               if (typeof tag === 'string' && tag.length >= 2) {

[Survived] BlockStatement
src/daemon.mjs:1021:66
           const newTags = new Set();
           for (const card of insights.knowledge_cards) {
             const tags = card.tags || [];
-            for (const tag of (Array.isArray(tags) ? tags : [])) {
-              if (typeof tag === 'string' && tag.length >= 2) {
-                newTags.add(tag.toLowerCase());
-              }
-            }
+            for (const tag of (Array.isArray(tags) ? tags : [])) {}
           }
           if (newTags.size > 0) {

[Survived] LogicalOperator
src/daemon.mjs:1022:19
           for (const card of insights.knowledge_cards) {
             const tags = card.tags || [];
             for (const tag of (Array.isArray(tags) ? tags : [])) {
-              if (typeof tag === 'string' && tag.length >= 2) {
+              if (typeof tag === 'string' || tag.length >= 2) {
                 newTags.add(tag.toLowerCase());
               }

[Survived] ConditionalExpression
src/daemon.mjs:1022:19
           for (const card of insights.knowledge_cards) {
             const tags = card.tags || [];
             for (const tag of (Array.isArray(tags) ? tags : [])) {
-              if (typeof tag === 'string' && tag.length >= 2) {
+              if (true) {
                 newTags.add(tag.toLowerCase());
               }

[Survived] MethodExpression
src/daemon.mjs:1023:29
             const tags = card.tags || [];
             for (const tag of (Array.isArray(tags) ? tags : [])) {
               if (typeof tag === 'string' && tag.length >= 2) {
-                newTags.add(tag.toLowerCase());
+                newTags.add(tag.toUpperCase());
               }
             }

[Survived] EqualityOperator
src/daemon.mjs:1027:15
               }
             }
           }
-          if (newTags.size > 0) {
+          if (newTags.size >= 0) {
             const decisions = this.indexer.db
               .prepare(

[Survived] ConditionalExpression
src/daemon.mjs:1027:15
               }
             }
           }
-          if (newTags.size > 0) {
+          if (false) {
             const decisions = this.indexer.db
               .prepare(

[Survived] StringLiteral
src/daemon.mjs:1030:17
           if (newTags.size > 0) {
             const decisions = this.indexer.db
               .prepare(
-                `SELECT id, title, summary, tags FROM knowledge_cards
-                 WHERE category = 'decision' AND status = 'active'
-                 ORDER BY created_at DESC LIMIT 20`
+                ``
               )
               .all();

[Survived] BlockStatement
src/daemon.mjs:1035:40
                  ORDER BY created_at DESC LIMIT 20`
               )
               .all();
-            for (const d of decisions) {
-              let cardTags = [];
-              try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
-              const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
-              if (overlap) {
-                signals.push({
-                  type: 'related_decision',
-                  title: d.title,
-                  summary: d.summary || '',
-                  card_id: d.id,
-                  message: `📌 Related prior decision: "${d.title}"`,
-                });
-                if (signals.filter(s => s.type === 'related_decision').length >= 2) break;
-              }
-            }
+            for (const d of decisions) {}
           }
         } catch { /* ignore */ }

[Survived] ConditionalExpression
src/daemon.mjs:1037:43
               .all();
             for (const d of decisions) {
               let cardTags = [];
-              try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
+              try { cardTags = JSON.parse(true); } catch { /* skip */ }
               const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
               if (overlap) {

[Survived] LogicalOperator
src/daemon.mjs:1037:43
               .all();
             for (const d of decisions) {
               let cardTags = [];
-              try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
+              try { cardTags = JSON.parse(d.tags && '[]'); } catch { /* skip */ }
               const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
               if (overlap) {

[Survived] ConditionalExpression
src/daemon.mjs:1038:50
             for (const d of decisions) {
               let cardTags = [];
               try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
-              const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
+              const overlap = cardTags.some(t => false);
               if (overlap) {
                 signals.push({

[Survived] MethodExpression
src/daemon.mjs:1038:31
             for (const d of decisions) {
               let cardTags = [];
               try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
-              const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
+              const overlap = cardTags.every(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
               if (overlap) {
                 signals.push({

[Survived] BlockStatement
src/daemon.mjs:1039:28
               let cardTags = [];
               try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
               const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
-              if (overlap) {
-                signals.push({
-                  type: 'related_decision',
-                  title: d.title,
-                  summary: d.summary || '',
-                  card_id: d.id,
-                  message: `📌 Related prior decision: "${d.title}"`,
-                });
-                if (signals.filter(s => s.type === 'related_decision').length >= 2) break;
-              }
+              if (overlap) {}
             }
           }

[Survived] ConditionalExpression
src/daemon.mjs:1039:19
               let cardTags = [];
               try { cardTags = JSON.parse(d.tags || '[]'); } catch { /* skip */ }
               const overlap = cardTags.some(t => typeof t === 'string' && newTags.has(t.toLowerCase()));
-              if (overlap) {
+              if (true) {
                 signals.push({
                   type: 'related_decision',

[Survived] ConditionalExpression
src/daemon.mjs:1043:28
                 signals.push({
                   type: 'related_decision',
                   title: d.title,
-                  summary: d.summary || '',
+                  summary: true,
                   card_id: d.id,
                   message: `📌 Related prior decision: "${d.title}"`,

[Survived] LogicalOperator
src/daemon.mjs:1043:28
                 signals.push({
                   type: 'related_decision',
                   title: d.title,
-                  summary: d.summary || '',
+                  summary: d.summary && '',
                   card_id: d.id,
                   message: `📌 Related prior decision: "${d.title}"`,

[Survived] EqualityOperator
src/daemon.mjs:1047:21
                   card_id: d.id,
                   message: `📌 Related prior decision: "${d.title}"`,
                 });
-                if (signals.filter(s => s.type === 'related_decision').length >= 2) break;
+                if (signals.filter(s => s.type === 'related_decision').length < 2) break;
               }
             }

[Survived] ConditionalExpression
src/daemon.mjs:1047:21
                   card_id: d.id,
                   message: `📌 Related prior decision: "${d.title}"`,
                 });
-                if (signals.filter(s => s.type === 'related_decision').length >= 2) break;
+                if (true) break;
               }
             }

[Survived] BlockStatement
src/daemon.mjs:1053:19
           }
         } catch { /* ignore */ }
       }
-    } catch (err) {
-      // Perception is best-effort, never block the write
-      if (process.env.DEBUG) {
-        console.warn('[awareness-local] perception failed:', err.message);
-      }
-    }
+    } catch (err) {}
 
     // Apply perception lifecycle: compute signal_id, filter dormant/dismissed/snoozed, update state

[Survived] BlockStatement
src/daemon.mjs:1055:30
       }
     } catch (err) {
       // Perception is best-effort, never block the write
-      if (process.env.DEBUG) {
-        console.warn('[awareness-local] perception failed:', err.message);
-      }
+      if (process.env.DEBUG) {}
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:1055:11
       }
     } catch (err) {
       // Perception is best-effort, never block the write
-      if (process.env.DEBUG) {
+      if (true) {
         console.warn('[awareness-local] perception failed:', err.message);
       }

[Survived] ArrayDeclaration
src/daemon.mjs:1061:29
     }
 
     // Apply perception lifecycle: compute signal_id, filter dormant/dismissed/snoozed, update state
-    const filteredSignals = [];
+    const filteredSignals = ["Stryker was here"];
     for (const sig of signals) {
       try {

[Survived] BlockStatement
src/daemon.mjs:1062:32
 
     // Apply perception lifecycle: compute signal_id, filter dormant/dismissed/snoozed, update state
     const filteredSignals = [];
-    for (const sig of signals) {
-      try {
-        const signalId = this._computeSignalId(sig);
-        sig.signal_id = signalId;
-        if (!this.indexer?.shouldShowPerception) {
-          filteredSignals.push(sig);
-          continue;
-        }
-        if (!this.indexer.shouldShowPerception(signalId)) continue;
-        // Touch state (increment exposure_count, apply decay)
-        this.indexer.touchPerceptionState({
-          signal_id: signalId,
-          signal_type: sig.type,
-          source_card_id: sig.card_id || null,
-          title: sig.title || sig.message || '',
-          metadata: { tag: sig.tag, count: sig.count, category: sig.category },
-        });
-        filteredSignals.push(sig);
-      } catch { /* non-fatal */ }
-    }
+    for (const sig of signals) {}
 
     return filteredSignals.slice(0, 5); // Cap at 5 signals

[Survived] BlockStatement
src/daemon.mjs:1063:11
     // Apply perception lifecycle: compute signal_id, filter dormant/dismissed/snoozed, update state
     const filteredSignals = [];
     for (const sig of signals) {
-      try {
-        const signalId = this._computeSignalId(sig);
-        sig.signal_id = signalId;
-        if (!this.indexer?.shouldShowPerception) {
-          filteredSignals.push(sig);
-          continue;
-        }
-        if (!this.indexer.shouldShowPerception(signalId)) continue;
-        // Touch state (increment exposure_count, apply decay)
-        this.indexer.touchPerceptionState({
-          signal_id: signalId,
-          signal_type: sig.type,
-          source_card_id: sig.card_id || null,
-          title: sig.title || sig.message || '',
-          metadata: { tag: sig.tag, count: sig.count, category: sig.category },
-        });
-        filteredSignals.push(sig);
-      } catch { /* non-fatal */ }
+      try {} catch { /* non-fatal */ }
     }
 

[Survived] BooleanLiteral
src/daemon.mjs:1066:13
       try {
         const signalId = this._computeSignalId(sig);
         sig.signal_id = signalId;
-        if (!this.indexer?.shouldShowPerception) {
+        if (this.indexer?.shouldShowPerception) {
           filteredSignals.push(sig);
           continue;

[Survived] BlockStatement
src/daemon.mjs:1066:50
       try {
         const signalId = this._computeSignalId(sig);
         sig.signal_id = signalId;
-        if (!this.indexer?.shouldShowPerception) {
-          filteredSignals.push(sig);
-          continue;
-        }
+        if (!this.indexer?.shouldShowPerception) {}
         if (!this.indexer.shouldShowPerception(signalId)) continue;
         // Touch state (increment exposure_count, apply decay)

[Survived] ConditionalExpression
src/daemon.mjs:1070:13
           filteredSignals.push(sig);
           continue;
         }
-        if (!this.indexer.shouldShowPerception(signalId)) continue;
+        if (false) continue;
         // Touch state (increment exposure_count, apply decay)
         this.indexer.touchPerceptionState({

[Survived] ConditionalExpression
src/daemon.mjs:1070:13
           filteredSignals.push(sig);
           continue;
         }
-        if (!this.indexer.shouldShowPerception(signalId)) continue;
+        if (true) continue;
         // Touch state (increment exposure_count, apply decay)
         this.indexer.touchPerceptionState({

[Survived] ConditionalExpression
src/daemon.mjs:1075:27
         this.indexer.touchPerceptionState({
           signal_id: signalId,
           signal_type: sig.type,
-          source_card_id: sig.card_id || null,
+          source_card_id: false,
           title: sig.title || sig.message || '',
           metadata: { tag: sig.tag, count: sig.count, category: sig.category },

[Survived] ConditionalExpression
src/daemon.mjs:1075:27
         this.indexer.touchPerceptionState({
           signal_id: signalId,
           signal_type: sig.type,
-          source_card_id: sig.card_id || null,
+          source_card_id: true,
           title: sig.title || sig.message || '',
           metadata: { tag: sig.tag, count: sig.count, category: sig.category },
