[Survived] LogicalOperator
src/daemon.mjs:1076:18
           signal_id: signalId,
           signal_type: sig.type,
           source_card_id: sig.card_id || null,
-          title: sig.title || sig.message || '',
+          title: (sig.title || sig.message) && '',
           metadata: { tag: sig.tag, count: sig.count, category: sig.category },
         });

[Survived] ConditionalExpression
src/daemon.mjs:1076:18
           signal_id: signalId,
           signal_type: sig.type,
           source_card_id: sig.card_id || null,
-          title: sig.title || sig.message || '',
+          title: true,
           metadata: { tag: sig.tag, count: sig.count, category: sig.category },
         });

[Survived] MethodExpression
src/daemon.mjs:1083:12
       } catch { /* non-fatal */ }
     }
 
-    return filteredSignals.slice(0, 5); // Cap at 5 signals
+    return filteredSignals; // Cap at 5 signals
   }
 

[Survived] BlockStatement
src/daemon.mjs:1090:25
    * Compute a stable signal_id based on type + source identifier.
    * Same signal produced in two different sessions must yield the same ID.
    */
-  _computeSignalId(sig) {
-    const parts = [sig.type];
-    if (sig.card_id) parts.push(sig.card_id);
-    else if (sig.tag) parts.push(`tag:${sig.tag}`);
-    else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
-    else parts.push(sig.message?.slice(0, 60) || '');
-    // Simple hash (deterministic)
-    const key = parts.join('|');
-    let hash = 0;
-    for (let i = 0; i < key.length; i++) {
-      hash = ((hash << 5) - hash + key.charCodeAt(i)) | 0;
-    }
-    return `sig_${sig.type}_${Math.abs(hash).toString(36)}`;
-  }
+  _computeSignalId(sig) {}
 
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */

[Survived] ConditionalExpression
src/daemon.mjs:1092:9
    */
   _computeSignalId(sig) {
     const parts = [sig.type];
-    if (sig.card_id) parts.push(sig.card_id);
+    if (false) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);

[Survived] ConditionalExpression
src/daemon.mjs:1092:9
    */
   _computeSignalId(sig) {
     const parts = [sig.type];
-    if (sig.card_id) parts.push(sig.card_id);
+    if (true) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);

[Survived] ConditionalExpression
src/daemon.mjs:1093:14
   _computeSignalId(sig) {
     const parts = [sig.type];
     if (sig.card_id) parts.push(sig.card_id);
-    else if (sig.tag) parts.push(`tag:${sig.tag}`);
+    else if (false) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
     else parts.push(sig.message?.slice(0, 60) || '');

[Survived] ConditionalExpression
src/daemon.mjs:1093:14
   _computeSignalId(sig) {
     const parts = [sig.type];
     if (sig.card_id) parts.push(sig.card_id);
-    else if (sig.tag) parts.push(`tag:${sig.tag}`);
+    else if (true) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
     else parts.push(sig.message?.slice(0, 60) || '');

[Survived] MethodExpression
src/daemon.mjs:1094:45
     const parts = [sig.type];
     if (sig.card_id) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
-    else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
+    else if (sig.title) parts.push(`title:${sig.title}`);
     else parts.push(sig.message?.slice(0, 60) || '');
     // Simple hash (deterministic)

[Survived] ConditionalExpression
src/daemon.mjs:1094:14
     const parts = [sig.type];
     if (sig.card_id) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
-    else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
+    else if (false) parts.push(`title:${sig.title.slice(0, 60)}`);
     else parts.push(sig.message?.slice(0, 60) || '');
     // Simple hash (deterministic)

[Survived] OptionalChaining
src/daemon.mjs:1095:21
     if (sig.card_id) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
-    else parts.push(sig.message?.slice(0, 60) || '');
+    else parts.push(sig.message.slice(0, 60) || '');
     // Simple hash (deterministic)
     const key = parts.join('|');

[Survived] MethodExpression
src/daemon.mjs:1095:21
     if (sig.card_id) parts.push(sig.card_id);
     else if (sig.tag) parts.push(`tag:${sig.tag}`);
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
-    else parts.push(sig.message?.slice(0, 60) || '');
+    else parts.push(sig.message || '');
     // Simple hash (deterministic)
     const key = parts.join('|');

[Survived] StringLiteral
src/daemon.mjs:1097:28
     else if (sig.title) parts.push(`title:${sig.title.slice(0, 60)}`);
     else parts.push(sig.message?.slice(0, 60) || '');
     // Simple hash (deterministic)
-    const key = parts.join('|');
+    const key = parts.join("");
     let hash = 0;
     for (let i = 0; i < key.length; i++) {

[Survived] ConditionalExpression
src/daemon.mjs:1099:21
     // Simple hash (deterministic)
     const key = parts.join('|');
     let hash = 0;
-    for (let i = 0; i < key.length; i++) {
+    for (let i = 0; false; i++) {
       hash = ((hash << 5) - hash + key.charCodeAt(i)) | 0;
     }

[Survived] EqualityOperator
src/daemon.mjs:1099:21
     // Simple hash (deterministic)
     const key = parts.join('|');
     let hash = 0;
-    for (let i = 0; i < key.length; i++) {
+    for (let i = 0; i >= key.length; i++) {
       hash = ((hash << 5) - hash + key.charCodeAt(i)) | 0;
     }

[Survived] ArithmeticOperator
src/daemon.mjs:1100:15
     const key = parts.join('|');
     let hash = 0;
     for (let i = 0; i < key.length; i++) {
-      hash = ((hash << 5) - hash + key.charCodeAt(i)) | 0;
+      hash = ((hash << 5) + hash + key.charCodeAt(i)) | 0;
     }
     return `sig_${sig.type}_${Math.abs(hash).toString(36)}`;

[Survived] ArithmeticOperator
src/daemon.mjs:1100:15
     const key = parts.join('|');
     let hash = 0;
     for (let i = 0; i < key.length; i++) {
-      hash = ((hash << 5) - hash + key.charCodeAt(i)) | 0;
+      hash = ((hash << 5) - hash - key.charCodeAt(i)) | 0;
     }
     return `sig_${sig.type}_${Math.abs(hash).toString(36)}`;

[Survived] BlockStatement
src/daemon.mjs:1106:15
   }
 
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */
-  _ordinal(n) {
-    if (n % 100 >= 11 && n % 100 <= 13) return `${n}th`;
-    const suffix = { 1: 'st', 2: 'nd', 3: 'rd' }[n % 10] || 'th';
-    return `${n}${suffix}`;
-  }
+  _ordinal(n) {}
 
   /** Write multiple memories in batch. */

[Survived] ConditionalExpression
src/daemon.mjs:1107:9
 
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */
   _ordinal(n) {
-    if (n % 100 >= 11 && n % 100 <= 13) return `${n}th`;
+    if (false) return `${n}th`;
     const suffix = { 1: 'st', 2: 'nd', 3: 'rd' }[n % 10] || 'th';
     return `${n}${suffix}`;

[Survived] ArithmeticOperator
src/daemon.mjs:1107:26
 
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */
   _ordinal(n) {
-    if (n % 100 >= 11 && n % 100 <= 13) return `${n}th`;
+    if (n % 100 >= 11 && n * 100 <= 13) return `${n}th`;
     const suffix = { 1: 'st', 2: 'nd', 3: 'rd' }[n % 10] || 'th';
     return `${n}${suffix}`;

[Survived] ConditionalExpression
src/daemon.mjs:1108:20
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */
   _ordinal(n) {
     if (n % 100 >= 11 && n % 100 <= 13) return `${n}th`;
-    const suffix = { 1: 'st', 2: 'nd', 3: 'rd' }[n % 10] || 'th';
+    const suffix = true;
     return `${n}${suffix}`;
   }

[Survived] ConditionalExpression
src/daemon.mjs:1108:20
   /** Return ordinal string (1st, 2nd, 3rd, etc.) */
   _ordinal(n) {
     if (n % 100 >= 11 && n % 100 <= 13) return `${n}th`;
-    const suffix = { 1: 'st', 2: 'nd', 3: 'rd' }[n % 10] || 'th';
+    const suffix = false;
     return `${n}${suffix}`;
   }

[Survived] ConditionalExpression
src/daemon.mjs:1114:19
 
   /** Write multiple memories in batch. */
   async _rememberBatch(params) {
-    const items = params.items || [];
+    const items = true;
     if (!items.length) {
       return { error: 'items array is required for remember_batch' };

[Survived] LogicalOperator
src/daemon.mjs:1114:19
 
   /** Write multiple memories in batch. */
   async _rememberBatch(params) {
-    const items = params.items || [];
+    const items = params.items && [];
     if (!items.length) {
       return { error: 'items array is required for remember_batch' };

[Survived] ConditionalExpression
src/daemon.mjs:1115:9
   /** Write multiple memories in batch. */
   async _rememberBatch(params) {
     const items = params.items || [];
-    if (!items.length) {
+    if (false) {
       return { error: 'items array is required for remember_batch' };
     }

[Survived] ConditionalExpression
src/daemon.mjs:1115:9
   /** Write multiple memories in batch. */
   async _rememberBatch(params) {
     const items = params.items || [];
-    if (!items.length) {
+    if (true) {
       return { error: 'items array is required for remember_batch' };
     }

[Survived] LogicalOperator
src/daemon.mjs:1120:27
     }
 
     // Batch-level insights go to the last item (summary item)
-    const batchInsights = params.insights || null;
+    const batchInsights = params.insights && null;
 
     const results = [];

[Survived] ConditionalExpression
src/daemon.mjs:1120:27
     }
 
     // Batch-level insights go to the last item (summary item)
-    const batchInsights = params.insights || null;
+    const batchInsights = true;
 
     const results = [];

[Survived] EqualityOperator
src/daemon.mjs:1123:21
     const batchInsights = params.insights || null;
 
     const results = [];
-    for (let i = 0; i < items.length; i++) {
+    for (let i = 0; i <= items.length; i++) {
       const item = items[i];
       const isLast = i === items.length - 1;

[Survived] BlockStatement
src/daemon.mjs:1123:44
     const batchInsights = params.insights || null;
 
     const results = [];
-    for (let i = 0; i < items.length; i++) {
-      const item = items[i];
-      const isLast = i === items.length - 1;
-      const result = await this._remember({
-        content: item.content,
-        title: item.title,
-        event_type: item.event_type,
-        tags: item.tags,
-        insights: item.insights || (isLast ? batchInsights : null),
-        session_id: params.session_id,
-        agent_role: params.agent_role,
-      });
-      results.push(result);
-    }
+    for (let i = 0; i < items.length; i++) {}
 
     return {

[Survived] EqualityOperator
src/daemon.mjs:1125:22
     const results = [];
     for (let i = 0; i < items.length; i++) {
       const item = items[i];
-      const isLast = i === items.length - 1;
+      const isLast = i !== items.length - 1;
       const result = await this._remember({
         content: item.content,

[Survived] ConditionalExpression
src/daemon.mjs:1125:22
     const results = [];
     for (let i = 0; i < items.length; i++) {
       const item = items[i];
-      const isLast = i === items.length - 1;
+      const isLast = false;
       const result = await this._remember({
         content: item.content,

[Survived] LogicalOperator
src/daemon.mjs:1131:19
         title: item.title,
         event_type: item.event_type,
         tags: item.tags,
-        insights: item.insights || (isLast ? batchInsights : null),
+        insights: item.insights && (isLast ? batchInsights : null),
         session_id: params.session_id,
         agent_role: params.agent_role,

[Survived] ConditionalExpression
src/daemon.mjs:1131:19
         title: item.title,
         event_type: item.event_type,
         tags: item.tags,
-        insights: item.insights || (isLast ? batchInsights : null),
+        insights: true,
         session_id: params.session_id,
         agent_role: params.agent_role,

[Survived] ObjectLiteral
src/daemon.mjs:1138:12
       results.push(result);
     }
 
-    return {
-      status: 'ok',
-      count: results.length,
-      items: results,
-      mode: 'local',
-    };
+    return {};
   }
 

[Survived] StringLiteral
src/daemon.mjs:1142:13
       status: 'ok',
       count: results.length,
       items: results,
-      mode: 'local',
+      mode: "",
     };
   }

[Survived] ConditionalExpression
src/daemon.mjs:1148:9
 
   /** Update a task's status. */
   async _updateTask(params) {
-    if (!params.task_id) {
+    if (false) {
       return { error: 'task_id is required for update_task' };
     }

[Survived] BlockStatement
src/daemon.mjs:1148:26
 
   /** Update a task's status. */
   async _updateTask(params) {
-    if (!params.task_id) {
-      return { error: 'task_id is required for update_task' };
-    }
+    if (!params.task_id) {}
 
     const task = this.indexer.db

[Survived] ObjectLiteral
src/daemon.mjs:1149:14
   /** Update a task's status. */
   async _updateTask(params) {
     if (!params.task_id) {
-      return { error: 'task_id is required for update_task' };
+      return {};
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:1156:9
       .prepare('SELECT * FROM tasks WHERE id = ?')
       .get(params.task_id);
 
-    if (!task) {
+    if (true) {
       return { error: `Task not found: ${params.task_id}` };
     }

[Survived] ObjectLiteral
src/daemon.mjs:1157:14
       .get(params.task_id);
 
     if (!task) {
-      return { error: `Task not found: ${params.task_id}` };
+      return {};
     }
 

[Survived] ConditionalExpression
src/daemon.mjs:1162:15
 
     this.indexer.indexTask({
       ...task,
-      status: params.status || task.status,
+      status: false,
       updated_at: nowISO(),
     });

[Survived] ConditionalExpression
src/daemon.mjs:1162:15
 
     this.indexer.indexTask({
       ...task,
-      status: params.status || task.status,
+      status: true,
       updated_at: nowISO(),
     });

[Survived] LogicalOperator
src/daemon.mjs:1169:19
     return {
       status: 'ok',
       task_id: params.task_id,
-      new_status: params.status || task.status,
+      new_status: params.status && task.status,
       mode: 'local',
     };

[Survived] ConditionalExpression
src/daemon.mjs:1169:19
     return {
       status: 'ok',
       task_id: params.task_id,
-      new_status: params.status || task.status,
+      new_status: true,
       mode: 'local',
     };

[Survived] LogicalOperator
src/daemon.mjs:1176:22
 
   /** Process pre-extracted insights and index them. */
   async _submitInsights(params) {
-    const insights = params.insights || {};
+    const insights = params.insights && {};
     let cardsCreated = 0;
     let tasksCreated = 0;

[Survived] ConditionalExpression
src/daemon.mjs:1176:22
 
   /** Process pre-extracted insights and index them. */
   async _submitInsights(params) {
-    const insights = params.insights || {};
+    const insights = true;
     let cardsCreated = 0;
     let tasksCreated = 0;

[Survived] StringLiteral
src/daemon.mjs:1181:73
     let tasksCreated = 0;
 
     // F-034: Track newly created eligible cards for crystallization detection
-    const CRYSTALLIZATION_CATEGORIES = new Set(['workflow', 'decision', 'problem_solution']);
+    const CRYSTALLIZATION_CATEGORIES = new Set(['workflow', 'decision', ""]);
     const crystallizationCandidates = [];
 

[Survived] ConditionalExpression
src/daemon.mjs:1185:9
     const crystallizationCandidates = [];
 
     // Process knowledge cards
-    if (Array.isArray(insights.knowledge_cards)) {
+    if (true) {
       for (const card of insights.knowledge_cards) {
         const cardId = `kc_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;

[Survived] ConditionalExpression
src/daemon.mjs:1185:9
     const crystallizationCandidates = [];
 
     // Process knowledge cards
-    if (Array.isArray(insights.knowledge_cards)) {
+    if (false) {
       for (const card of insights.knowledge_cards) {
         const cardId = `kc_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;

[Survived] MethodExpression
src/daemon.mjs:1187:44
     // Process knowledge cards
     if (Array.isArray(insights.knowledge_cards)) {
       for (const card of insights.knowledge_cards) {
-        const cardId = `kc_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
+        const cardId = `kc_${Date.now()}_${Math.random().toString(36)}`;
         const cardFilepath = path.join(
           this.awarenessDir,

[Survived] StringLiteral
src/daemon.mjs:1187:24
     // Process knowledge cards
     if (Array.isArray(insights.knowledge_cards)) {
       for (const card of insights.knowledge_cards) {
-        const cardId = `kc_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
+        const cardId = ``;
         const cardFilepath = path.join(
           this.awarenessDir,

[Survived] ConditionalExpression
src/daemon.mjs:1191:11
         const cardFilepath = path.join(
           this.awarenessDir,
           'knowledge',
-          card.category || 'insights',
+          true,
           `${cardId}.md`
         );

[Survived] LogicalOperator
src/daemon.mjs:1191:11
         const cardFilepath = path.join(
           this.awarenessDir,
           'knowledge',
-          card.category || 'insights',
+          card.category && 'insights',
           `${cardId}.md`
         );

[Survived] StringLiteral
src/daemon.mjs:1192:11
           this.awarenessDir,
           'knowledge',
           card.category || 'insights',
-          `${cardId}.md`
+          ``
         );
 

[Survived] BooleanLiteral
src/daemon.mjs:1196:63
         );
 
         // Ensure category directory exists
-        fs.mkdirSync(path.dirname(cardFilepath), { recursive: true });
+        fs.mkdirSync(path.dirname(cardFilepath), { recursive: false });
 
         // Write markdown file for the card

[Survived] ObjectLiteral
src/daemon.mjs:1196:50
         );
 
         // Ensure category directory exists
-        fs.mkdirSync(path.dirname(cardFilepath), { recursive: true });
+        fs.mkdirSync(path.dirname(cardFilepath), {});
 
         // Write markdown file for the card

[Survived] LogicalOperator
src/daemon.mjs:1201:13
         // Write markdown file for the card
         const cardContent = `---
 id: ${cardId}
-category: ${card.category || 'insight'}
+category: ${card.category && 'insight'}
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}

[Survived] ConditionalExpression
src/daemon.mjs:1201:13
         // Write markdown file for the card
         const cardContent = `---
 id: ${cardId}
-category: ${card.category || 'insight'}
+category: ${true}
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}

[Survived] ConditionalExpression
src/daemon.mjs:1202:12
         const cardContent = `---
 id: ${cardId}
 category: ${card.category || 'insight'}
-title: "${(card.title || '').replace(/"/g, '\\"')}"
+title: "${(false).replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
 status: ${card.status || 'active'}

[Survived] ConditionalExpression
src/daemon.mjs:1202:12
         const cardContent = `---
 id: ${cardId}
 category: ${card.category || 'insight'}
-title: "${(card.title || '').replace(/"/g, '\\"')}"
+title: "${(true).replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
 status: ${card.status || 'active'}

[Survived] LogicalOperator
src/daemon.mjs:1203:15
 id: ${cardId}
 category: ${card.category || 'insight'}
 title: "${(card.title || '').replace(/"/g, '\\"')}"
-confidence: ${card.confidence ?? 0.8}
+confidence: ${card.confidence && 0.8}
 status: ${card.status || 'active'}
 tags: ${JSON.stringify(card.tags || [])}

[Survived] ConditionalExpression
src/daemon.mjs:1204:11
 category: ${card.category || 'insight'}
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
-status: ${card.status || 'active'}
+status: ${true}
 tags: ${JSON.stringify(card.tags || [])}
 created_at: ${nowISO()}

[Survived] LogicalOperator
src/daemon.mjs:1204:11
 category: ${card.category || 'insight'}
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
-status: ${card.status || 'active'}
+status: ${card.status && 'active'}
 tags: ${JSON.stringify(card.tags || [])}
 created_at: ${nowISO()}

[Survived] LogicalOperator
src/daemon.mjs:1205:24
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
 status: ${card.status || 'active'}
-tags: ${JSON.stringify(card.tags || [])}
+tags: ${JSON.stringify(card.tags && [])}
 created_at: ${nowISO()}
 ---

[Survived] ConditionalExpression
src/daemon.mjs:1205:24
 title: "${(card.title || '').replace(/"/g, '\\"')}"
 confidence: ${card.confidence ?? 0.8}
 status: ${card.status || 'active'}
-tags: ${JSON.stringify(card.tags || [])}
+tags: ${JSON.stringify(true)}
 created_at: ${nowISO()}
 ---

[Survived] LogicalOperator
src/daemon.mjs:1209:3
 created_at: ${nowISO()}
 ---
 
-${card.summary || card.title || ''}
+${card.summary && card.title || ''}
 `;
         fs.mkdirSync(path.dirname(cardFilepath), { recursive: true });

[Survived] LogicalOperator
src/daemon.mjs:1209:3
 created_at: ${nowISO()}
 ---
 
-${card.summary || card.title || ''}
+${(card.summary || card.title) && ''}
 `;
         fs.mkdirSync(path.dirname(cardFilepath), { recursive: true });

[Survived] BooleanLiteral
src/daemon.mjs:1211:63
 
 ${card.summary || card.title || ''}
 `;
-        fs.mkdirSync(path.dirname(cardFilepath), { recursive: true });
+        fs.mkdirSync(path.dirname(cardFilepath), { recursive: false });
         fs.writeFileSync(cardFilepath, cardContent, 'utf-8');
 

[Survived] LogicalOperator
src/daemon.mjs:1216:21
 
         const cardData = {
           id: cardId,
-          category: card.category || 'insight',
+          category: card.category && 'insight',
           title: card.title || '',
           summary: card.summary || '',

[Survived] ConditionalExpression
src/daemon.mjs:1216:21
 
         const cardData = {
           id: cardId,
-          category: card.category || 'insight',
+          category: false,
           title: card.title || '',
           summary: card.summary || '',

[Survived] ConditionalExpression
src/daemon.mjs:1217:18
         const cardData = {
           id: cardId,
           category: card.category || 'insight',
-          title: card.title || '',
+          title: true,
           summary: card.summary || '',
           source_memories: JSON.stringify([]),

[Survived] ConditionalExpression
src/daemon.mjs:1217:18
         const cardData = {
           id: cardId,
           category: card.category || 'insight',
-          title: card.title || '',
+          title: false,
           summary: card.summary || '',
           source_memories: JSON.stringify([]),

[Survived] ConditionalExpression
src/daemon.mjs:1218:20
           id: cardId,
           category: card.category || 'insight',
           title: card.title || '',
-          summary: card.summary || '',
+          summary: false,
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,

[Survived] LogicalOperator
src/daemon.mjs:1218:20
           id: cardId,
           category: card.category || 'insight',
           title: card.title || '',
-          summary: card.summary || '',
+          summary: card.summary && '',
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,

[Survived] ArrayDeclaration
src/daemon.mjs:1219:43
           category: card.category || 'insight',
           title: card.title || '',
           summary: card.summary || '',
-          source_memories: JSON.stringify([]),
+          source_memories: JSON.stringify(["Stryker was here"]),
           confidence: card.confidence ?? 0.8,
           status: card.status || 'active',

[Survived] LogicalOperator
src/daemon.mjs:1220:23
           title: card.title || '',
           summary: card.summary || '',
           source_memories: JSON.stringify([]),
-          confidence: card.confidence ?? 0.8,
+          confidence: card.confidence && 0.8,
           status: card.status || 'active',
           tags: card.tags || [],

[Survived] LogicalOperator
src/daemon.mjs:1221:19
           summary: card.summary || '',
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,
-          status: card.status || 'active',
+          status: card.status && 'active',
           tags: card.tags || [],
           created_at: nowISO(),

[Survived] ConditionalExpression
src/daemon.mjs:1221:19
           summary: card.summary || '',
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,
-          status: card.status || 'active',
+          status: false,
           tags: card.tags || [],
           created_at: nowISO(),

[Survived] ConditionalExpression
src/daemon.mjs:1222:17
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,
           status: card.status || 'active',
-          tags: card.tags || [],
+          tags: false,
           created_at: nowISO(),
           filepath: cardFilepath,

[Survived] ConditionalExpression
src/daemon.mjs:1222:17
           source_memories: JSON.stringify([]),
           confidence: card.confidence ?? 0.8,
           status: card.status || 'active',
-          tags: card.tags || [],
+          tags: true,
           created_at: nowISO(),
           filepath: cardFilepath,

[Survived] ConditionalExpression
src/daemon.mjs:1225:20
           tags: card.tags || [],
           created_at: nowISO(),
           filepath: cardFilepath,
-          content: card.summary || card.title || '',
+          content: true,
           novelty_score: card.novelty_score ?? null,
           salience_reason: card.salience_reason || null,

[Survived] ConditionalExpression
src/daemon.mjs:1225:20
           tags: card.tags || [],
           created_at: nowISO(),
           filepath: cardFilepath,
-          content: card.summary || card.title || '',
+          content: false,
           novelty_score: card.novelty_score ?? null,
           salience_reason: card.salience_reason || null,

[Survived] LogicalOperator
src/daemon.mjs:1226:26
           created_at: nowISO(),
           filepath: cardFilepath,
           content: card.summary || card.title || '',
-          novelty_score: card.novelty_score ?? null,
+          novelty_score: card.novelty_score && null,
           salience_reason: card.salience_reason || null,
         };

[Survived] LogicalOperator
src/daemon.mjs:1227:28
           filepath: cardFilepath,
           content: card.summary || card.title || '',
           novelty_score: card.novelty_score ?? null,
-          salience_reason: card.salience_reason || null,
+          salience_reason: card.salience_reason && null,
         };
         this.indexer.indexKnowledgeCard(cardData);

[Survived] ConditionalExpression
src/daemon.mjs:1227:28
           filepath: cardFilepath,
           content: card.summary || card.title || '',
           novelty_score: card.novelty_score ?? null,
-          salience_reason: card.salience_reason || null,
+          salience_reason: true,
         };
         this.indexer.indexKnowledgeCard(cardData);

[Survived] BlockStatement
src/daemon.mjs:1232:13
         this.indexer.indexKnowledgeCard(cardData);
 
         // Incremental MOC: check if this card's tags trigger MOC creation
-        try {
-          const newMocIds = this.indexer.tryAutoMoc(cardData);
-          // Fire-and-forget: refine MOC titles with LLM if available
-          if (newMocIds.length > 0) {
-            this._refineMocTitles(newMocIds).catch(() => {});
-          }
-        } catch (e) {
+        try {} catch (e) {
           console.warn('[awareness-local] autoMoc error:', e.message);
         }

[Survived] ConditionalExpression
src/daemon.mjs:1235:15
         try {
           const newMocIds = this.indexer.tryAutoMoc(cardData);
           // Fire-and-forget: refine MOC titles with LLM if available
-          if (newMocIds.length > 0) {
+          if (false) {
             this._refineMocTitles(newMocIds).catch(() => {});
           }

[Survived] BlockStatement
src/daemon.mjs:1235:37
         try {
           const newMocIds = this.indexer.tryAutoMoc(cardData);
           // Fire-and-forget: refine MOC titles with LLM if available
-          if (newMocIds.length > 0) {
-            this._refineMocTitles(newMocIds).catch(() => {});
-          }
+          if (newMocIds.length > 0) {}
         } catch (e) {
           console.warn('[awareness-local] autoMoc error:', e.message);

[Survived] BlockStatement
src/daemon.mjs:1238:21
           if (newMocIds.length > 0) {
             this._refineMocTitles(newMocIds).catch(() => {});
           }
-        } catch (e) {
-          console.warn('[awareness-local] autoMoc error:', e.message);
-        }
+        } catch (e) {}
 
         // Skill auto-evolution: check if new card should evolve existing skills

[Survived] BlockStatement
src/daemon.mjs:1243:13
         }
 
         // Skill auto-evolution: check if new card should evolve existing skills
-        try {
-          if (this.extractor) {
-            this.extractor._checkSkillEvolution(cardData).catch((err) => {
-              console.warn('[awareness-local] skill evolution check failed:', err.message);
-            });
-          }
-        } catch { /* non-critical */ }
+        try {} catch { /* non-critical */ }
 
         // F-034: Track eligible cards for crystallization hint check
