[Survived] BlockStatement
src/daemon.mjs:1244:31
 
         // Skill auto-evolution: check if new card should evolve existing skills
         try {
-          if (this.extractor) {
-            this.extractor._checkSkillEvolution(cardData).catch((err) => {
-              console.warn('[awareness-local] skill evolution check failed:', err.message);
-            });
-          }
+          if (this.extractor) {}
         } catch { /* non-critical */ }
 

[Survived] ConditionalExpression
src/daemon.mjs:1244:15
 
         // Skill auto-evolution: check if new card should evolve existing skills
         try {
-          if (this.extractor) {
+          if (true) {
             this.extractor._checkSkillEvolution(cardData).catch((err) => {
               console.warn('[awareness-local] skill evolution check failed:', err.message);

[Survived] BlockStatement
src/daemon.mjs:1245:74
         // Skill auto-evolution: check if new card should evolve existing skills
         try {
           if (this.extractor) {
-            this.extractor._checkSkillEvolution(cardData).catch((err) => {
-              console.warn('[awareness-local] skill evolution check failed:', err.message);
-            });
+            this.extractor._checkSkillEvolution(cardData).catch((err) => {});
           }
         } catch { /* non-critical */ }

[Survived] ConditionalExpression
src/daemon.mjs:1252:13
         } catch { /* non-critical */ }
 
         // F-034: Track eligible cards for crystallization hint check
-        if (CRYSTALLIZATION_CATEGORIES.has(card.category)) {
+        if (false) {
           crystallizationCandidates.push({
             id: cardId,

[Survived] ConditionalExpression
src/daemon.mjs:1252:13
         } catch { /* non-critical */ }
 
         // F-034: Track eligible cards for crystallization hint check
-        if (CRYSTALLIZATION_CATEGORIES.has(card.category)) {
+        if (true) {
           crystallizationCandidates.push({
             id: cardId,

[Survived] ConditionalExpression
src/daemon.mjs:1255:20
         if (CRYSTALLIZATION_CATEGORIES.has(card.category)) {
           crystallizationCandidates.push({
             id: cardId,
-            title: card.title || '',
+            title: false,
             summary: card.summary || '',
             category: card.category,

[Survived] ConditionalExpression
src/daemon.mjs:1255:20
         if (CRYSTALLIZATION_CATEGORIES.has(card.category)) {
           crystallizationCandidates.push({
             id: cardId,
-            title: card.title || '',
+            title: true,
             summary: card.summary || '',
             category: card.category,

[Survived] UpdateOperator
src/daemon.mjs:1261:9
           });
         }
 
-        cardsCreated++;
+        cardsCreated--;
       }
     }

[Survived] ConditionalExpression
src/daemon.mjs:1266:9
     }
 
     // Process action items / tasks
-    if (Array.isArray(insights.action_items)) {
+    if (true) {
       for (const item of insights.action_items) {
         // Quality gate: reject noise tasks

[Survived] ConditionalExpression
src/daemon.mjs:1266:9
     }
 
     // Process action items / tasks
-    if (Array.isArray(insights.action_items)) {
+    if (false) {
       for (const item of insights.action_items) {
         // Quality gate: reject noise tasks

[Survived] ConditionalExpression
src/daemon.mjs:1270:13
       for (const item of insights.action_items) {
         // Quality gate: reject noise tasks
         const rejection = validateTaskQuality(item.title);
-        if (rejection) {
+        if (true) {
           console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(item.title || '').substring(0, 60)}`);
           continue;

[Survived] BlockStatement
src/daemon.mjs:1270:24
       for (const item of insights.action_items) {
         // Quality gate: reject noise tasks
         const rejection = validateTaskQuality(item.title);
-        if (rejection) {
-          console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(item.title || '').substring(0, 60)}`);
-          continue;
-        }
+        if (rejection) {}
 
         // Dedup gate: skip if similar open task already exists

[Survived] LogicalOperator
src/daemon.mjs:1271:82
         // Quality gate: reject noise tasks
         const rejection = validateTaskQuality(item.title);
         if (rejection) {
-          console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(item.title || '').substring(0, 60)}`);
+          console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(item.title && '').substring(0, 60)}`);
           continue;
         }

[Survived] ConditionalExpression
src/daemon.mjs:1271:82
         // Quality gate: reject noise tasks
         const rejection = validateTaskQuality(item.title);
         if (rejection) {
-          console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(item.title || '').substring(0, 60)}`);
+          console.warn(`[AwarenessDaemon] Rejected noise task (${rejection}): ${(false).substring(0, 60)}`);
           continue;
         }

[Survived] BlockStatement
src/daemon.mjs:1277:26
 
         // Dedup gate: skip if similar open task already exists
         const { isDuplicate, existingTaskId } = checkTaskDedup(this.indexer, item.title);
-        if (isDuplicate) {
-          console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(item.title || '').substring(0, 60)}" (existing: ${existingTaskId})`);
-          continue;
-        }
+        if (isDuplicate) {}
 
         const taskId = `task_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;

[Survived] ConditionalExpression
src/daemon.mjs:1277:13
 
         // Dedup gate: skip if similar open task already exists
         const { isDuplicate, existingTaskId } = checkTaskDedup(this.indexer, item.title);
-        if (isDuplicate) {
+        if (true) {
           console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(item.title || '').substring(0, 60)}" (existing: ${existingTaskId})`);
           continue;

[Survived] ConditionalExpression
src/daemon.mjs:1278:71
         // Dedup gate: skip if similar open task already exists
         const { isDuplicate, existingTaskId } = checkTaskDedup(this.indexer, item.title);
         if (isDuplicate) {
-          console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(item.title || '').substring(0, 60)}" (existing: ${existingTaskId})`);
+          console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(false).substring(0, 60)}" (existing: ${existingTaskId})`);
           continue;
         }

[Survived] LogicalOperator
src/daemon.mjs:1278:71
         // Dedup gate: skip if similar open task already exists
         const { isDuplicate, existingTaskId } = checkTaskDedup(this.indexer, item.title);
         if (isDuplicate) {
-          console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(item.title || '').substring(0, 60)}" (existing: ${existingTaskId})`);
+          console.warn(`[AwarenessDaemon] Skipped duplicate task: "${(item.title && '').substring(0, 60)}" (existing: ${existingTaskId})`);
           continue;
         }

[Survived] MethodExpression
src/daemon.mjs:1282:46
           continue;
         }
 
-        const taskId = `task_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
+        const taskId = `task_${Date.now()}_${Math.random().toString(36)}`;
         const taskFilepath = path.join(
           this.awarenessDir, 'tasks', 'open', `${taskId}.md`

[Survived] StringLiteral
src/daemon.mjs:1284:47
 
         const taskId = `task_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
         const taskFilepath = path.join(
-          this.awarenessDir, 'tasks', 'open', `${taskId}.md`
+          this.awarenessDir, 'tasks', 'open', ``
         );
 

[Survived] ConditionalExpression
src/daemon.mjs:1289:12
 
         const taskContent = `---
 id: ${taskId}
-title: "${(item.title || '').replace(/"/g, '\\"')}"
+title: "${(false).replace(/"/g, '\\"')}"
 priority: ${item.priority || 'medium'}
 status: ${item.status || 'open'}

[Survived] LogicalOperator
src/daemon.mjs:1289:12
 
         const taskContent = `---
 id: ${taskId}
-title: "${(item.title || '').replace(/"/g, '\\"')}"
+title: "${(item.title && '').replace(/"/g, '\\"')}"
 priority: ${item.priority || 'medium'}
 status: ${item.status || 'open'}

[Survived] LogicalOperator
src/daemon.mjs:1290:13
         const taskContent = `---
 id: ${taskId}
 title: "${(item.title || '').replace(/"/g, '\\"')}"
-priority: ${item.priority || 'medium'}
+priority: ${item.priority && 'medium'}
 status: ${item.status || 'open'}
 created_at: ${nowISO()}

[Survived] ConditionalExpression
src/daemon.mjs:1290:13
         const taskContent = `---
 id: ${taskId}
 title: "${(item.title || '').replace(/"/g, '\\"')}"
-priority: ${item.priority || 'medium'}
+priority: ${false}
 status: ${item.status || 'open'}
 created_at: ${nowISO()}

[Survived] ConditionalExpression
src/daemon.mjs:1291:11
 id: ${taskId}
 title: "${(item.title || '').replace(/"/g, '\\"')}"
 priority: ${item.priority || 'medium'}
-status: ${item.status || 'open'}
+status: ${false}
 created_at: ${nowISO()}
 ---

[Survived] LogicalOperator
src/daemon.mjs:1291:11
 id: ${taskId}
 title: "${(item.title || '').replace(/"/g, '\\"')}"
 priority: ${item.priority || 'medium'}
-status: ${item.status || 'open'}
+status: ${item.status && 'open'}
 created_at: ${nowISO()}
 ---

[Survived] ConditionalExpression
src/daemon.mjs:1295:3
 created_at: ${nowISO()}
 ---
 
-${item.description || item.title || ''}
+${false}
 `;
         fs.mkdirSync(path.dirname(taskFilepath), { recursive: true });

[Survived] ConditionalExpression
src/daemon.mjs:1295:3
 created_at: ${nowISO()}
 ---
 
-${item.description || item.title || ''}
+${false || ''}
 `;
         fs.mkdirSync(path.dirname(taskFilepath), { recursive: true });

[Survived] BooleanLiteral
src/daemon.mjs:1297:63
 
 ${item.description || item.title || ''}
 `;
-        fs.mkdirSync(path.dirname(taskFilepath), { recursive: true });
+        fs.mkdirSync(path.dirname(taskFilepath), { recursive: false });
         fs.writeFileSync(taskFilepath, taskContent, 'utf-8');
 

[Survived] ConditionalExpression
src/daemon.mjs:1302:18
 
         this.indexer.indexTask({
           id: taskId,
-          title: item.title || '',
+          title: true,
           description: item.description || '',
           status: item.status || 'open',

[Survived] ConditionalExpression
src/daemon.mjs:1302:18
 
         this.indexer.indexTask({
           id: taskId,
-          title: item.title || '',
+          title: false,
           description: item.description || '',
           status: item.status || 'open',

[Survived] ConditionalExpression
src/daemon.mjs:1303:24
         this.indexer.indexTask({
           id: taskId,
           title: item.title || '',
-          description: item.description || '',
+          description: false,
           status: item.status || 'open',
           priority: item.priority || 'medium',

[Survived] ConditionalExpression
src/daemon.mjs:1303:24
         this.indexer.indexTask({
           id: taskId,
           title: item.title || '',
-          description: item.description || '',
+          description: true,
           status: item.status || 'open',
           priority: item.priority || 'medium',

[Survived] ConditionalExpression
src/daemon.mjs:1304:19
           id: taskId,
           title: item.title || '',
           description: item.description || '',
-          status: item.status || 'open',
+          status: true,
           priority: item.priority || 'medium',
           agent_role: params.agent_role || null,

[Survived] ConditionalExpression
src/daemon.mjs:1304:19
           id: taskId,
           title: item.title || '',
           description: item.description || '',
-          status: item.status || 'open',
+          status: false,
           priority: item.priority || 'medium',
           agent_role: params.agent_role || null,

[Survived] LogicalOperator
src/daemon.mjs:1305:21
           title: item.title || '',
           description: item.description || '',
           status: item.status || 'open',
-          priority: item.priority || 'medium',
+          priority: item.priority && 'medium',
           agent_role: params.agent_role || null,
           created_at: nowISO(),

[Survived] ConditionalExpression
src/daemon.mjs:1305:21
           title: item.title || '',
           description: item.description || '',
           status: item.status || 'open',
-          priority: item.priority || 'medium',
+          priority: true,
           agent_role: params.agent_role || null,
           created_at: nowISO(),

[Survived] ConditionalExpression
src/daemon.mjs:1306:23
           description: item.description || '',
           status: item.status || 'open',
           priority: item.priority || 'medium',
-          agent_role: params.agent_role || null,
+          agent_role: false,
           created_at: nowISO(),
           updated_at: nowISO(),

[Survived] LogicalOperator
src/daemon.mjs:1306:23
           description: item.description || '',
           status: item.status || 'open',
           priority: item.priority || 'medium',
-          agent_role: params.agent_role || null,
+          agent_role: params.agent_role && null,
           created_at: nowISO(),
           updated_at: nowISO(),

[Survived] UpdateOperator
src/daemon.mjs:1312:9
           filepath: taskFilepath,
         });
 
-        tasksCreated++;
+        tasksCreated--;
       }
     }

[Survived] ConditionalExpression
src/daemon.mjs:1318:9
 
     // Auto-complete tasks identified by the LLM
     let tasksAutoCompleted = 0;
-    if (Array.isArray(insights.completed_tasks)) {
+    if (false) {
       for (const completed of insights.completed_tasks) {
         const taskId = (completed.task_id || '').trim();

[Survived] BlockStatement
src/daemon.mjs:1318:50
 
     // Auto-complete tasks identified by the LLM
     let tasksAutoCompleted = 0;
-    if (Array.isArray(insights.completed_tasks)) {
-      for (const completed of insights.completed_tasks) {
-        const taskId = (completed.task_id || '').trim();
-        if (!taskId) continue;
-        try {
-          const existing = this.indexer.db
-            .prepare('SELECT * FROM tasks WHERE id = ?')
-            .get(taskId);
-          if (existing && existing.status !== 'done') {
-            this.indexer.indexTask({
-              ...existing,
-              status: 'done',
-              updated_at: nowISO(),
-            });
-            tasksAutoCompleted++;
-          }
-        } catch (err) {
-          console.warn(`[AwarenessDaemon] Failed to auto-complete task '${taskId}':`, err.message);
-        }
-      }
-    }
+    if (Array.isArray(insights.completed_tasks)) {}
 
     // F-034: Handle skills submitted via insights.skills[] (crystallization result)

[Survived] BlockStatement
src/daemon.mjs:1319:57
     // Auto-complete tasks identified by the LLM
     let tasksAutoCompleted = 0;
     if (Array.isArray(insights.completed_tasks)) {
-      for (const completed of insights.completed_tasks) {
-        const taskId = (completed.task_id || '').trim();
-        if (!taskId) continue;
-        try {
-          const existing = this.indexer.db
-            .prepare('SELECT * FROM tasks WHERE id = ?')
-            .get(taskId);
-          if (existing && existing.status !== 'done') {
-            this.indexer.indexTask({
-              ...existing,
-              status: 'done',
-              updated_at: nowISO(),
-            });
-            tasksAutoCompleted++;
-          }
-        } catch (err) {
-          console.warn(`[AwarenessDaemon] Failed to auto-complete task '${taskId}':`, err.message);
-        }
-      }
+      for (const completed of insights.completed_tasks) {}
     }
 

[Survived] MethodExpression
src/daemon.mjs:1320:24
     let tasksAutoCompleted = 0;
     if (Array.isArray(insights.completed_tasks)) {
       for (const completed of insights.completed_tasks) {
-        const taskId = (completed.task_id || '').trim();
+        const taskId = completed.task_id || '';
         if (!taskId) continue;
         try {

[Survived] LogicalOperator
src/daemon.mjs:1320:25
     let tasksAutoCompleted = 0;
     if (Array.isArray(insights.completed_tasks)) {
       for (const completed of insights.completed_tasks) {
-        const taskId = (completed.task_id || '').trim();
+        const taskId = (completed.task_id && '').trim();
         if (!taskId) continue;
         try {

[Survived] ConditionalExpression
src/daemon.mjs:1321:13
     if (Array.isArray(insights.completed_tasks)) {
       for (const completed of insights.completed_tasks) {
         const taskId = (completed.task_id || '').trim();
-        if (!taskId) continue;
+        if (false) continue;
         try {
           const existing = this.indexer.db

[Survived] ConditionalExpression
src/daemon.mjs:1321:13
     if (Array.isArray(insights.completed_tasks)) {
       for (const completed of insights.completed_tasks) {
         const taskId = (completed.task_id || '').trim();
-        if (!taskId) continue;
+        if (true) continue;
         try {
           const existing = this.indexer.db

[Survived] BlockStatement
src/daemon.mjs:1322:13
       for (const completed of insights.completed_tasks) {
         const taskId = (completed.task_id || '').trim();
         if (!taskId) continue;
-        try {
-          const existing = this.indexer.db
-            .prepare('SELECT * FROM tasks WHERE id = ?')
-            .get(taskId);
-          if (existing && existing.status !== 'done') {
-            this.indexer.indexTask({
-              ...existing,
-              status: 'done',
-              updated_at: nowISO(),
-            });
-            tasksAutoCompleted++;
-          }
-        } catch (err) {
+        try {} catch (err) {
           console.warn(`[AwarenessDaemon] Failed to auto-complete task '${taskId}':`, err.message);
         }

[Survived] EqualityOperator
src/daemon.mjs:1326:27
           const existing = this.indexer.db
             .prepare('SELECT * FROM tasks WHERE id = ?')
             .get(taskId);
-          if (existing && existing.status !== 'done') {
+          if (existing && existing.status === 'done') {
             this.indexer.indexTask({
               ...existing,

[Survived] LogicalOperator
src/daemon.mjs:1326:15
           const existing = this.indexer.db
             .prepare('SELECT * FROM tasks WHERE id = ?')
             .get(taskId);
-          if (existing && existing.status !== 'done') {
+          if (existing || existing.status !== 'done') {
             this.indexer.indexTask({
               ...existing,

[Survived] UpdateOperator
src/daemon.mjs:1332:13
               status: 'done',
               updated_at: nowISO(),
             });
-            tasksAutoCompleted++;
+            tasksAutoCompleted--;
           }
         } catch (err) {

[Survived] BlockStatement
src/daemon.mjs:1334:23
             });
             tasksAutoCompleted++;
           }
-        } catch (err) {
-          console.warn(`[AwarenessDaemon] Failed to auto-complete task '${taskId}':`, err.message);
-        }
+        } catch (err) {}
       }
     }

[Survived] StringLiteral
src/daemon.mjs:1335:24
             tasksAutoCompleted++;
           }
         } catch (err) {
-          console.warn(`[AwarenessDaemon] Failed to auto-complete task '${taskId}':`, err.message);
+          console.warn(``, err.message);
         }
       }

[Survived] EqualityOperator
src/daemon.mjs:1343:9
     // F-034: Handle skills submitted via insights.skills[] (crystallization result)
     let skillsCreated = 0;
     const submittedSkills = Array.isArray(insights.skills) ? insights.skills : [];
-    if (submittedSkills.length > 0) {
+    if (submittedSkills.length >= 0) {
       for (const skill of submittedSkills) {
         if (!skill.name) continue;

[Survived] EqualityOperator
src/daemon.mjs:1343:9
     // F-034: Handle skills submitted via insights.skills[] (crystallization result)
     let skillsCreated = 0;
     const submittedSkills = Array.isArray(insights.skills) ? insights.skills : [];
-    if (submittedSkills.length > 0) {
+    if (submittedSkills.length <= 0) {
       for (const skill of submittedSkills) {
         if (!skill.name) continue;

[Survived] ConditionalExpression
src/daemon.mjs:1345:13
     const submittedSkills = Array.isArray(insights.skills) ? insights.skills : [];
     if (submittedSkills.length > 0) {
       for (const skill of submittedSkills) {
-        if (!skill.name) continue;
+        if (true) continue;
         try {
           const skillId = `skill_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;

[Survived] BooleanLiteral
src/daemon.mjs:1345:13
     const submittedSkills = Array.isArray(insights.skills) ? insights.skills : [];
     if (submittedSkills.length > 0) {
       for (const skill of submittedSkills) {
-        if (!skill.name) continue;
+        if (skill.name) continue;
         try {
           const skillId = `skill_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;

[Survived] BlockStatement
src/daemon.mjs:1346:13
     if (submittedSkills.length > 0) {
       for (const skill of submittedSkills) {
         if (!skill.name) continue;
-        try {
-          const skillId = `skill_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
-          const now = nowISO();
-          this.indexer.db.prepare(`
-            INSERT OR IGNORE INTO skills
-              (id, name, summary, methods, trigger_conditions, tags, source_card_ids,
-               decay_score, usage_count, status, created_at, updated_at)
-            VALUES (?, ?, ?, ?, ?, ?, ?, 1.0, 0, 'active', ?, ?)
-          `).run(
-            skillId,
-            skill.name,
-            skill.summary || '',
-            skill.methods ? JSON.stringify(skill.methods) : null,
-            skill.trigger_conditions ? JSON.stringify(skill.trigger_conditions) : null,
-            skill.tags ? JSON.stringify(skill.tags) : null,
-            skill.source_card_ids ? JSON.stringify(skill.source_card_ids) : null,
-            now,
-            now,
-          );
-          skillsCreated++;
-        } catch (err) {
+        try {} catch (err) {
           console.warn(`[AwarenessDaemon] Failed to save skill '${skill.name}':`, err.message);
         }

[Survived] MethodExpression
src/daemon.mjs:1347:50
       for (const skill of submittedSkills) {
         if (!skill.name) continue;
         try {
-          const skillId = `skill_${Date.now()}_${Math.random().toString(36).slice(2, 6)}`;
+          const skillId = `skill_${Date.now()}_${Math.random().toString(36)}`;
           const now = nowISO();
           this.indexer.db.prepare(`

[Survived] LogicalOperator
src/daemon.mjs:1357:13
           `).run(
             skillId,
             skill.name,
-            skill.summary || '',
+            skill.summary && '',
             skill.methods ? JSON.stringify(skill.methods) : null,
             skill.trigger_conditions ? JSON.stringify(skill.trigger_conditions) : null,

[Survived] ConditionalExpression
src/daemon.mjs:1357:13
           `).run(
             skillId,
             skill.name,
-            skill.summary || '',
+            true,
             skill.methods ? JSON.stringify(skill.methods) : null,
             skill.trigger_conditions ? JSON.stringify(skill.trigger_conditions) : null,

[Survived] UpdateOperator
src/daemon.mjs:1365:11
             now,
             now,
           );
-          skillsCreated++;
+          skillsCreated--;
         } catch (err) {
           console.warn(`[AwarenessDaemon] Failed to save skill '${skill.name}':`, err.message);

[Survived] BlockStatement
src/daemon.mjs:1366:23
             now,
           );
           skillsCreated++;
-        } catch (err) {
-          console.warn(`[AwarenessDaemon] Failed to save skill '${skill.name}':`, err.message);
-        }
+        } catch (err) {}
       }
     }

[Survived] ConditionalExpression
src/daemon.mjs:1374:49
 
     // F-034: Crystallization hint — check if newly created eligible cards match existing ones
     let crystallizationHint = null;
-    if (crystallizationCandidates.length > 0 && submittedSkills.length === 0) {
+    if (crystallizationCandidates.length > 0 && true) {
       const first = crystallizationCandidates[0];
       crystallizationHint = _checkCrystallizationLocal(this.indexer.db, first);

[Survived] EqualityOperator
src/daemon.mjs:1374:9
 
     // F-034: Crystallization hint — check if newly created eligible cards match existing ones
     let crystallizationHint = null;
-    if (crystallizationCandidates.length > 0 && submittedSkills.length === 0) {
+    if (crystallizationCandidates.length <= 0 && submittedSkills.length === 0) {
       const first = crystallizationCandidates[0];
       crystallizationHint = _checkCrystallizationLocal(this.indexer.db, first);

[Survived] StringLiteral
src/daemon.mjs:1380:15
     }
 
     const result = {
-      status: 'ok',
+      status: "",
       cards_created: cardsCreated,
       tasks_created: tasksCreated,

[Survived] StringLiteral
src/daemon.mjs:1385:13
       tasks_created: tasksCreated,
       tasks_auto_completed: tasksAutoCompleted,
       skills_created: skillsCreated,
-      mode: 'local',
+      mode: "",
     };
     if (crystallizationHint) {

[Survived] ConditionalExpression
src/daemon.mjs:1387:9
       skills_created: skillsCreated,
       mode: 'local',
     };
-    if (crystallizationHint) {
+    if (false) {
       result._skill_crystallization_hint = crystallizationHint;
     }

[Survived] BlockStatement
src/daemon.mjs:1387:30
       skills_created: skillsCreated,
       mode: 'local',
     };
-    if (crystallizationHint) {
-      result._skill_crystallization_hint = crystallizationHint;
-    }
+    if (crystallizationHint) {}
     return result;
   }

[Survived] BlockStatement
src/daemon.mjs:1398:23
     const { type, limit = 10, status, category, priority, session_id, agent_role, query } = params;
 
     switch (type) {
-      case 'context': {
-        // Full context dump with preference separation
-        const stats = this.indexer.getStats();
-        const knowledge = this.indexer.getRecentKnowledge(limit);
-        const tasks = this.indexer.getOpenTasks(0);
-        const rawSessions = this.indexer.getRecentSessions(7);
-        // De-noise: only sessions with content; fallback to 3 most recent
-        let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
-        if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
-        sessions = sessions.slice(0, 5);
-        const { user_preferences, knowledge_cards: otherCards } = splitPreferences(knowledge);
-        return { stats, user_preferences, knowledge_cards: otherCards, open_tasks: tasks, recent_sessions: sessions, mode: 'local' };
-      }
+      case 'context': {}
 
       case 'tasks': {

[Survived] ConditionalExpression
src/daemon.mjs:1398:7
     const { type, limit = 10, status, category, priority, session_id, agent_role, query } = params;
 
     switch (type) {
-      case 'context': {
-        // Full context dump with preference separation
-        const stats = this.indexer.getStats();
-        const knowledge = this.indexer.getRecentKnowledge(limit);
-        const tasks = this.indexer.getOpenTasks(0);
-        const rawSessions = this.indexer.getRecentSessions(7);
-        // De-noise: only sessions with content; fallback to 3 most recent
-        let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
-        if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
-        sessions = sessions.slice(0, 5);
-        const { user_preferences, knowledge_cards: otherCards } = splitPreferences(knowledge);
-        return { stats, user_preferences, knowledge_cards: otherCards, open_tasks: tasks, recent_sessions: sessions, mode: 'local' };
-      }
+      case 'context':
 
       case 'tasks': {

[Survived] LogicalOperator
src/daemon.mjs:1405:48
         const tasks = this.indexer.getOpenTasks(0);
         const rawSessions = this.indexer.getRecentSessions(7);
         // De-noise: only sessions with content; fallback to 3 most recent
-        let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
+        let sessions = rawSessions.filter(s => s.memory_count > 0 && s.summary);
         if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
         sessions = sessions.slice(0, 5);

[Survived] EqualityOperator
src/daemon.mjs:1405:48
         const tasks = this.indexer.getOpenTasks(0);
         const rawSessions = this.indexer.getRecentSessions(7);
         // De-noise: only sessions with content; fallback to 3 most recent
-        let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
+        let sessions = rawSessions.filter(s => s.memory_count >= 0 || s.summary);
         if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
         sessions = sessions.slice(0, 5);

[Survived] ConditionalExpression
src/daemon.mjs:1406:13
         const rawSessions = this.indexer.getRecentSessions(7);
         // De-noise: only sessions with content; fallback to 3 most recent
         let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
-        if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
+        if (false) sessions = rawSessions.slice(0, 3);
         sessions = sessions.slice(0, 5);
         const { user_preferences, knowledge_cards: otherCards } = splitPreferences(knowledge);
