[Survived] MethodExpression
src/daemon.mjs:1406:47
         const rawSessions = this.indexer.getRecentSessions(7);
         // De-noise: only sessions with content; fallback to 3 most recent
         let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
-        if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
+        if (sessions.length === 0) sessions = rawSessions;
         sessions = sessions.slice(0, 5);
         const { user_preferences, knowledge_cards: otherCards } = splitPreferences(knowledge);

[Survived] MethodExpression
src/daemon.mjs:1407:20
         // De-noise: only sessions with content; fallback to 3 most recent
         let sessions = rawSessions.filter(s => s.memory_count > 0 || s.summary);
         if (sessions.length === 0) sessions = rawSessions.slice(0, 3);
-        sessions = sessions.slice(0, 5);
+        sessions = sessions;
         const { user_preferences, knowledge_cards: otherCards } = splitPreferences(knowledge);
         return { stats, user_preferences, knowledge_cards: otherCards, open_tasks: tasks, recent_sessions: sessions, mode: 'local' };

[Survived] StringLiteral
src/daemon.mjs:1412:12
         return { stats, user_preferences, knowledge_cards: otherCards, open_tasks: tasks, recent_sessions: sessions, mode: 'local' };
       }
 
-      case 'tasks': {
+      case "": {
         let sql = 'SELECT * FROM tasks';
         const conditions = [];

[Survived] ArrayDeclaration
src/daemon.mjs:1414:28
 
       case 'tasks': {
         let sql = 'SELECT * FROM tasks';
-        const conditions = [];
+        const conditions = ["Stryker was here"];
         const sqlParams = [];
 

[Survived] BlockStatement
src/daemon.mjs:1417:21
         const conditions = [];
         const sqlParams = [];
 
-        if (status) {
-          conditions.push('status = ?');
-          sqlParams.push(status);
-        } else {
+        if (status) {} else {
           conditions.push("status = 'open'");
         }

[Survived] BlockStatement
src/daemon.mjs:1420:16
         if (status) {
           conditions.push('status = ?');
           sqlParams.push(status);
-        } else {
-          conditions.push("status = 'open'");
-        }
+        } else {}
         if (priority) {
           conditions.push('priority = ?');

[Survived] BlockStatement
src/daemon.mjs:1423:23
         } else {
           conditions.push("status = 'open'");
         }
-        if (priority) {
-          conditions.push('priority = ?');
-          sqlParams.push(priority);
-        }
+        if (priority) {}
         if (agent_role) {
           conditions.push('agent_role = ?');

[Survived] ConditionalExpression
src/daemon.mjs:1423:13
         } else {
           conditions.push("status = 'open'");
         }
-        if (priority) {
+        if (false) {
           conditions.push('priority = ?');
           sqlParams.push(priority);

[Survived] BlockStatement
src/daemon.mjs:1427:25
           conditions.push('priority = ?');
           sqlParams.push(priority);
         }
-        if (agent_role) {
-          conditions.push('agent_role = ?');
-          sqlParams.push(agent_role);
-        }
+        if (agent_role) {}
 
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');

[Survived] ConditionalExpression
src/daemon.mjs:1427:13
           conditions.push('priority = ?');
           sqlParams.push(priority);
         }
-        if (agent_role) {
+        if (true) {
           conditions.push('agent_role = ?');
           sqlParams.push(agent_role);

[Survived] ConditionalExpression
src/daemon.mjs:1432:13
           sqlParams.push(agent_role);
         }
 
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
+        if (false) sql += ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC';
         if (limit > 0) {

[Survived] ConditionalExpression
src/daemon.mjs:1432:13
           sqlParams.push(agent_role);
         }
 
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
+        if (true) sql += ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC';
         if (limit > 0) {

[Survived] StringLiteral
src/daemon.mjs:1433:16
         }
 
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
-        sql += ' ORDER BY created_at DESC';
+        sql += "";
         if (limit > 0) {
           sql += ' LIMIT ?';

[Survived] EqualityOperator
src/daemon.mjs:1434:13
 
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC';
-        if (limit > 0) {
+        if (limit >= 0) {
           sql += ' LIMIT ?';
           sqlParams.push(limit);

[Survived] BlockStatement
src/daemon.mjs:1434:24
 
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC';
-        if (limit > 0) {
-          sql += ' LIMIT ?';
-          sqlParams.push(limit);
-        }
+        if (limit > 0) {}
 
         const tasks = this.indexer.db.prepare(sql).all(...sqlParams);

[Survived] StringLiteral
src/daemon.mjs:1435:18
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC';
         if (limit > 0) {
-          sql += ' LIMIT ?';
+          sql += "";
           sqlParams.push(limit);
         }

[Survived] BlockStatement
src/daemon.mjs:1443:25
         return { tasks, total: tasks.length, mode: 'local' };
       }
 
-      case 'knowledge': {
-        let sql = 'SELECT * FROM knowledge_cards';
-        const conditions = [];
-        const sqlParams = [];
-
-        if (status) {
-          conditions.push('status = ?');
-          sqlParams.push(status);
-        } else {
-          conditions.push("status = 'active'");
-        }
-        if (category) {
-          conditions.push('category = ?');
-          sqlParams.push(category);
-        }
-
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
-        sql += ' ORDER BY created_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const cards = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { knowledge_cards: cards, total: cards.length, mode: 'local' };
-      }
+      case 'knowledge': {}
 
       case 'risks': {

[Survived] ConditionalExpression
src/daemon.mjs:1443:7
         return { tasks, total: tasks.length, mode: 'local' };
       }
 
-      case 'knowledge': {
-        let sql = 'SELECT * FROM knowledge_cards';
-        const conditions = [];
-        const sqlParams = [];
-
-        if (status) {
-          conditions.push('status = ?');
-          sqlParams.push(status);
-        } else {
-          conditions.push("status = 'active'");
-        }
-        if (category) {
-          conditions.push('category = ?');
-          sqlParams.push(category);
-        }
-
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
-        sql += ' ORDER BY created_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const cards = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { knowledge_cards: cards, total: cards.length, mode: 'local' };
-      }
+      case 'knowledge':
 
       case 'risks': {

[Survived] BlockStatement
src/daemon.mjs:1451:16
         if (status) {
           conditions.push('status = ?');
           sqlParams.push(status);
-        } else {
-          conditions.push("status = 'active'");
-        }
+        } else {}
         if (category) {
           conditions.push('category = ?');

[Survived] ConditionalExpression
src/daemon.mjs:1454:13
         } else {
           conditions.push("status = 'active'");
         }
-        if (category) {
+        if (true) {
           conditions.push('category = ?');
           sqlParams.push(category);

[Survived] ConditionalExpression
src/daemon.mjs:1454:13
         } else {
           conditions.push("status = 'active'");
         }
-        if (category) {
+        if (false) {
           conditions.push('category = ?');
           sqlParams.push(category);

[Survived] AssignmentOperator
src/daemon.mjs:1459:32
           sqlParams.push(category);
         }
 
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
+        if (conditions.length) sql -= ' WHERE ' + conditions.join(' AND ');
         sql += ' ORDER BY created_at DESC LIMIT ?';
         sqlParams.push(limit);

[Survived] BlockStatement
src/daemon.mjs:1467:21
         return { knowledge_cards: cards, total: cards.length, mode: 'local' };
       }
 
-      case 'risks': {
-        // Risks are stored as knowledge_cards with category containing 'risk' or 'pitfall'
-        let sql = "SELECT * FROM knowledge_cards WHERE (category = 'pitfall' OR category = 'risk')";
-        const sqlParams = [];
-
-        if (status) {
-          sql += ' AND status = ?';
-          sqlParams.push(status);
-        } else {
-          sql += " AND status = 'active'";
-        }
-
-        sql += ' ORDER BY created_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const risks = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { risks, total: risks.length, mode: 'local' };
-      }
+      case 'risks': {}
 
       case 'session_history': {

[Survived] ConditionalExpression
src/daemon.mjs:1467:7
         return { knowledge_cards: cards, total: cards.length, mode: 'local' };
       }
 
-      case 'risks': {
-        // Risks are stored as knowledge_cards with category containing 'risk' or 'pitfall'
-        let sql = "SELECT * FROM knowledge_cards WHERE (category = 'pitfall' OR category = 'risk')";
-        const sqlParams = [];
-
-        if (status) {
-          sql += ' AND status = ?';
-          sqlParams.push(status);
-        } else {
-          sql += " AND status = 'active'";
-        }
-
-        sql += ' ORDER BY created_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const risks = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { risks, total: risks.length, mode: 'local' };
-      }
+      case 'risks':
 
       case 'session_history': {

[Survived] BlockStatement
src/daemon.mjs:1475:16
         if (status) {
           sql += ' AND status = ?';
           sqlParams.push(status);
-        } else {
-          sql += " AND status = 'active'";
-        }
+        } else {}
 
         sql += ' ORDER BY created_at DESC LIMIT ?';

[Survived] StringLiteral
src/daemon.mjs:1476:18
           sql += ' AND status = ?';
           sqlParams.push(status);
         } else {
-          sql += " AND status = 'active'";
+          sql += "";
         }
 

[Survived] StringLiteral
src/daemon.mjs:1479:16
           sql += " AND status = 'active'";
         }
 
-        sql += ' ORDER BY created_at DESC LIMIT ?';
+        sql += "";
         sqlParams.push(limit);
 

[Survived] ConditionalExpression
src/daemon.mjs:1486:7
         return { risks, total: risks.length, mode: 'local' };
       }
 
-      case 'session_history': {
-        let sql = 'SELECT * FROM sessions';
-        const conditions = [];
-        const sqlParams = [];
-
-        if (session_id) {
-          conditions.push('id = ?');
-          sqlParams.push(session_id);
-        }
-
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
-        sql += ' ORDER BY started_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const sessions = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { sessions, total: sessions.length, mode: 'local' };
-      }
+      case 'session_history':
 
       case 'timeline': {

[Survived] BlockStatement
src/daemon.mjs:1486:31
         return { risks, total: risks.length, mode: 'local' };
       }
 
-      case 'session_history': {
-        let sql = 'SELECT * FROM sessions';
-        const conditions = [];
-        const sqlParams = [];
-
-        if (session_id) {
-          conditions.push('id = ?');
-          sqlParams.push(session_id);
-        }
-
-        if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');
-        sql += ' ORDER BY started_at DESC LIMIT ?';
-        sqlParams.push(limit);
-
-        const sessions = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { sessions, total: sessions.length, mode: 'local' };
-      }
+      case 'session_history': {}
 
       case 'timeline': {

[Survived] ConditionalExpression
src/daemon.mjs:1491:13
         const conditions = [];
         const sqlParams = [];
 
-        if (session_id) {
+        if (false) {
           conditions.push('id = ?');
           sqlParams.push(session_id);

[Survived] BlockStatement
src/daemon.mjs:1491:25
         const conditions = [];
         const sqlParams = [];
 
-        if (session_id) {
-          conditions.push('id = ?');
-          sqlParams.push(session_id);
-        }
+        if (session_id) {}
 
         if (conditions.length) sql += ' WHERE ' + conditions.join(' AND ');

[Survived] StringLiteral
src/daemon.mjs:1501:58
         sqlParams.push(limit);
 
         const sessions = this.indexer.db.prepare(sql).all(...sqlParams);
-        return { sessions, total: sessions.length, mode: 'local' };
+        return { sessions, total: sessions.length, mode: "" };
       }
 

[Survived] ConditionalExpression
src/daemon.mjs:1504:7
         return { sessions, total: sessions.length, mode: 'local' };
       }
 
-      case 'timeline': {
-        // Timeline = recent memories ordered by time
-        const memories = this.indexer.db
-          .prepare(
-            "SELECT * FROM memories WHERE status = 'active' ORDER BY created_at DESC LIMIT ?"
-          )
-          .all(limit);
-        return { events: memories, total: memories.length, mode: 'local' };
-      }
+      case 'timeline':
 
       case 'skills': {

[Survived] BlockStatement
src/daemon.mjs:1504:24
         return { sessions, total: sessions.length, mode: 'local' };
       }
 
-      case 'timeline': {
-        // Timeline = recent memories ordered by time
-        const memories = this.indexer.db
-          .prepare(
-            "SELECT * FROM memories WHERE status = 'active' ORDER BY created_at DESC LIMIT ?"
-          )
-          .all(limit);
-        return { events: memories, total: memories.length, mode: 'local' };
-      }
+      case 'timeline': {}
 
       case 'skills': {

[Survived] StringLiteral
src/daemon.mjs:1511:66
             "SELECT * FROM memories WHERE status = 'active' ORDER BY created_at DESC LIMIT ?"
           )
           .all(limit);
-        return { events: memories, total: memories.length, mode: 'local' };
+        return { events: memories, total: memories.length, mode: "" };
       }
 

[Survived] StringLiteral
src/daemon.mjs:1514:12
         return { events: memories, total: memories.length, mode: 'local' };
       }
 
-      case 'skills': {
+      case "": {
         // F-032: Query dedicated skills table (not deprecated knowledge_cards category)
         let skillSql = 'SELECT * FROM skills';

[Survived] ArrayDeclaration
src/daemon.mjs:1517:29
       case 'skills': {
         // F-032: Query dedicated skills table (not deprecated knowledge_cards category)
         let skillSql = 'SELECT * FROM skills';
-        const skillParams = [];
+        const skillParams = ["Stryker was here"];
 
         if (status) {

[Survived] BlockStatement
src/daemon.mjs:1522:16
         if (status) {
           skillSql += ' WHERE status = ?';
           skillParams.push(status);
-        } else {
-          skillSql += " WHERE status = 'active'";
-        }
+        } else {}
 
         skillSql += ' ORDER BY decay_score DESC, created_at DESC LIMIT ?';

[Survived] BlockStatement
src/daemon.mjs:1530:13
         skillParams.push(limit);
 
         let skills;
-        try {
-          skills = this.indexer.db.prepare(skillSql).all(...skillParams);
-        } catch {
+        try {} catch {
           // Fallback to legacy knowledge_cards if skills table doesn't exist yet
           skills = this.indexer.db.prepare(

[Survived] BlockStatement
src/daemon.mjs:1532:17
         let skills;
         try {
           skills = this.indexer.db.prepare(skillSql).all(...skillParams);
-        } catch {
-          // Fallback to legacy knowledge_cards if skills table doesn't exist yet
-          skills = this.indexer.db.prepare(
-            "SELECT * FROM knowledge_cards WHERE category = 'skill' AND status = 'active' ORDER BY created_at DESC LIMIT ?"
-          ).all(limit);
-        }
+        } catch {}
         return { skills, total: skills.length, mode: 'local' };
       }

[Survived] StringLiteral
src/daemon.mjs:1538:54
             "SELECT * FROM knowledge_cards WHERE category = 'skill' AND status = 'active' ORDER BY created_at DESC LIMIT ?"
           ).all(limit);
         }
-        return { skills, total: skills.length, mode: 'local' };
+        return { skills, total: skills.length, mode: "" };
       }
 

[Survived] ObjectLiteral
src/daemon.mjs:1538:16
             "SELECT * FROM knowledge_cards WHERE category = 'skill' AND status = 'active' ORDER BY created_at DESC LIMIT ?"
           ).all(limit);
         }
-        return { skills, total: skills.length, mode: 'local' };
+        return {};
       }
 

[Survived] ArrayDeclaration
src/daemon.mjs:1543:25
 
       case 'perception': {
         // Read perception signals from cache file + derive from recent knowledge
-        const signals = [];
+        const signals = ["Stryker was here"];
         const fs = await import('fs');
         const path = await import('path');

[Survived] BlockStatement
src/daemon.mjs:1549:13
         const os = await import('os');
 
         // 1. Read cached perception signals (written by awareness plugin hooks)
-        try {
-          const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
-          if (fs.existsSync(cachePath)) {
-            const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
-            if (Array.isArray(cached)) {
-              signals.push(...cached);
-            } else if (cached.signals) {
-              signals.push(...cached.signals);
-            }
-          }
-        } catch { /* no cache file */ }
+        try {} catch { /* no cache file */ }
 
         // 2. Derive staleness signals from old knowledge cards (30-day threshold, unified)

[Survived] ConditionalExpression
src/daemon.mjs:1551:15
         // 1. Read cached perception signals (written by awareness plugin hooks)
         try {
           const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
-          if (fs.existsSync(cachePath)) {
+          if (true) {
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
             if (Array.isArray(cached)) {

[Survived] ConditionalExpression
src/daemon.mjs:1551:15
         // 1. Read cached perception signals (written by awareness plugin hooks)
         try {
           const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
-          if (fs.existsSync(cachePath)) {
+          if (false) {
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
             if (Array.isArray(cached)) {

[Survived] StringLiteral
src/daemon.mjs:1552:66
         try {
           const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
           if (fs.existsSync(cachePath)) {
-            const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
+            const cached = JSON.parse(fs.readFileSync(cachePath, ""));
             if (Array.isArray(cached)) {
               signals.push(...cached);

[Survived] ConditionalExpression
src/daemon.mjs:1553:17
           const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
           if (fs.existsSync(cachePath)) {
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
-            if (Array.isArray(cached)) {
+            if (false) {
               signals.push(...cached);
             } else if (cached.signals) {

[Survived] ConditionalExpression
src/daemon.mjs:1553:17
           const cachePath = path.join(this.awarenessDir, 'perception-cache.json');
           if (fs.existsSync(cachePath)) {
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
-            if (Array.isArray(cached)) {
+            if (true) {
               signals.push(...cached);
             } else if (cached.signals) {

[Survived] BlockStatement
src/daemon.mjs:1555:40
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
             if (Array.isArray(cached)) {
               signals.push(...cached);
-            } else if (cached.signals) {
-              signals.push(...cached.signals);
-            }
+            } else if (cached.signals) {}
           }
         } catch { /* no cache file */ }

[Survived] ConditionalExpression
src/daemon.mjs:1555:24
             const cached = JSON.parse(fs.readFileSync(cachePath, 'utf8'));
             if (Array.isArray(cached)) {
               signals.push(...cached);
-            } else if (cached.signals) {
+            } else if (false) {
               signals.push(...cached.signals);
             }

[Survived] BlockStatement
src/daemon.mjs:1562:13
         } catch { /* no cache file */ }
 
         // 2. Derive staleness signals from old knowledge cards (30-day threshold, unified)
-        try {
-          const staleCards = this.indexer.db
-            .prepare(
-              `SELECT title, category, COALESCE(updated_at, created_at) AS last_touch
-               FROM knowledge_cards
-               WHERE status = 'active'
-                 AND COALESCE(updated_at, created_at) < datetime('now', '-30 days')
-               ORDER BY last_touch ASC LIMIT 3`
-            )
-            .all();
-          for (const card of staleCards) {
-            const daysOld = card.last_touch
-              ? Math.floor((Date.now() - new Date(card.last_touch).getTime()) / 86400000)
-              : 30;
-            signals.push({
-              type: 'staleness',
-              message: `⏳ Knowledge card "${card.title}" hasn't been updated in ${daysOld} days — may be outdated`,
-              card_title: card.title,
-              category: card.category,
-              days_since_update: daysOld,
-            });
-          }
-        } catch { /* db might not have the table */ }
+        try {} catch { /* db might not have the table */ }
 
         // 3. Derive pattern signals from tag co-occurrence (not just category count)

[Survived] BlockStatement
src/daemon.mjs:1572:42
                ORDER BY last_touch ASC LIMIT 3`
             )
             .all();
-          for (const card of staleCards) {
-            const daysOld = card.last_touch
-              ? Math.floor((Date.now() - new Date(card.last_touch).getTime()) / 86400000)
-              : 30;
-            signals.push({
-              type: 'staleness',
-              message: `⏳ Knowledge card "${card.title}" hasn't been updated in ${daysOld} days — may be outdated`,
-              card_title: card.title,
-              category: card.category,
-              days_since_update: daysOld,
-            });
-          }
+          for (const card of staleCards) {}
         } catch { /* db might not have the table */ }
 

[Survived] ArithmeticOperator
src/daemon.mjs:1574:28
             .all();
           for (const card of staleCards) {
             const daysOld = card.last_touch
-              ? Math.floor((Date.now() - new Date(card.last_touch).getTime()) / 86400000)
+              ? Math.floor((Date.now() - new Date(card.last_touch).getTime()) * 86400000)
               : 30;
             signals.push({

[Survived] ArithmeticOperator
src/daemon.mjs:1574:29
             .all();
           for (const card of staleCards) {
             const daysOld = card.last_touch
-              ? Math.floor((Date.now() - new Date(card.last_touch).getTime()) / 86400000)
+              ? Math.floor((Date.now() + new Date(card.last_touch).getTime()) / 86400000)
               : 30;
             signals.push({

[Survived] StringLiteral
src/daemon.mjs:1578:24
               : 30;
             signals.push({
               type: 'staleness',
-              message: `⏳ Knowledge card "${card.title}" hasn't been updated in ${daysOld} days — may be outdated`,
+              message: ``,
               card_title: card.title,
               category: card.category,

[Survived] ConditionalExpression
src/daemon.mjs:1597:37
           const tagCounts = new Map();
           for (const row of recentCards) {
             let tags = [];
-            try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
+            try { tags = JSON.parse(true); } catch { /* skip */ }
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {

[Survived] ConditionalExpression
src/daemon.mjs:1599:19
             let tags = [];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
+              if (false) {
                 const k = t.toLowerCase();
                 tagCounts.set(k, (tagCounts.get(k) || 0) + 1);

[Survived] EqualityOperator
src/daemon.mjs:1599:19
             let tags = [];
             try { tags = JSON.parse(row.tags || '[]'); } catch { /* skip */ }
             for (const t of tags) {
-              if (typeof t === 'string' && t.length >= 2) {
+              if (typeof t !== 'string' && t.length >= 2) {
                 const k = t.toLowerCase();
                 tagCounts.set(k, (tagCounts.get(k) || 0) + 1);

[Survived] ArithmeticOperator
src/daemon.mjs:1601:34
             for (const t of tags) {
               if (typeof t === 'string' && t.length >= 2) {
                 const k = t.toLowerCase();
-                tagCounts.set(k, (tagCounts.get(k) || 0) + 1);
+                tagCounts.set(k, (tagCounts.get(k) || 0) - 1);
               }
             }

[Survived] MethodExpression
src/daemon.mjs:1605:26
               }
             }
           }
-          const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
+          const themes = [...tagCounts.entries()]
             .sort((a, b) => b[1] - a[1])
             .slice(0, 3);

[Survived] MethodExpression
src/daemon.mjs:1605:26
               }
             }
           }
-          const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
-            .sort((a, b) => b[1] - a[1])
-            .slice(0, 3);
+          const themes = [...tagCounts.entries()].filter(([, count]) => count >= 3).sort((a, b) => b[1] - a[1]);
           for (const [tag, count] of themes) {
             signals.push({

[Survived] EqualityOperator
src/daemon.mjs:1606:36
             }
           }
           const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
+            .filter(([, count]) => count > 3)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 3);

[Survived] ConditionalExpression
src/daemon.mjs:1606:36
             }
           }
           const themes = [...tagCounts.entries()]
-            .filter(([, count]) => count >= 3)
+            .filter(([, count]) => false)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 3);

[Survived] BlockStatement
src/daemon.mjs:1609:46
             .filter(([, count]) => count >= 3)
             .sort((a, b) => b[1] - a[1])
             .slice(0, 3);
-          for (const [tag, count] of themes) {
-            signals.push({
-              type: 'pattern',
-              message: `🔄 Recurring theme in last 7 days: "${tag}" (${count} cards) — consider a systematic approach`,
-              tag,
-              count,
-            });
-          }
+          for (const [tag, count] of themes) {}
         } catch { /* db issue */ }
 

[Survived] StringLiteral
src/daemon.mjs:1619:56
           }
         } catch { /* db issue */ }
 
-        return { signals, total: signals.length, mode: 'local' };
+        return { signals, total: signals.length, mode: "" };
       }
 

[Survived] ConditionalExpression
src/daemon.mjs:1622:7
         return { signals, total: signals.length, mode: 'local' };
       }
 
-      default:
-        return { error: `Unknown lookup type: ${type}`, mode: 'local' };
+      default:
     }
   }

[Survived] BlockStatement
src/daemon.mjs:1635:27
    * Pre-warm the embedding model (downloads on first run, ~23MB) then backfill.
    * Runs in background — daemon is fully usable during warmup via FTS5 fallback.
    */
-  async _warmupEmbedder() {
-    return warmupEmbedder(this);
-  }
+  async _warmupEmbedder() {}
 
   /**

[Survived] BlockStatement
src/daemon.mjs:1643:31
    * Backfill embeddings for memories that were indexed before vector search was enabled.
    * Runs in background on startup — processes in batches to avoid blocking.
    */
-  async _backfillEmbeddings() {
-    return backfillEmbeddings(this);
-  }
+  async _backfillEmbeddings() {}
 
   /**

[Survived] BlockStatement
src/daemon.mjs:1651:43
    * Generate embedding for a memory and store it in the index.
    * Fire-and-forget — errors are logged but don't block the record flow.
    */
-  async _embedAndStore(memoryId, content) {
-    return embedAndStore(this, memoryId, content);
-  }
+  async _embedAndStore(memoryId, content) {}
 
   /**
