[Survived] BlockStatement
src/daemon.mjs:1659:77
    * Extract knowledge from a newly recorded memory and index the results.
    * Fire-and-forget — errors are logged but don't fail the record.
    */
-  async _extractAndIndex(memoryId, content, metadata, preExtractedInsights) {
-    return extractAndIndex(this, memoryId, content, metadata, preExtractedInsights);
-  }
+  async _extractAndIndex(memoryId, content, metadata, preExtractedInsights) {}
 
   // -----------------------------------------------------------------------

[Survived] BlockStatement
src/daemon.mjs:1668:23
   // -----------------------------------------------------------------------
 
   /** Start watching .awareness/memories/ for changes (debounced reindex). */
-  _startFileWatcher() {
-    this.watcher = startFileWatcher(this);
-  }
+  _startFileWatcher() {}
 
   // -----------------------------------------------------------------------

[Survived] ConditionalExpression
src/daemon.mjs:1683:11
   _initWorkspaceScanner() {
     try {
       this.scanConfig = loadScanConfig(this.projectDir);
-      if (!this.scanConfig.enabled) {
+      if (true) {
         console.log('[workspace-scanner] disabled via scan-config.json');
         return;

[Survived] BlockStatement
src/daemon.mjs:1683:37
   _initWorkspaceScanner() {
     try {
       this.scanConfig = loadScanConfig(this.projectDir);
-      if (!this.scanConfig.enabled) {
-        console.log('[workspace-scanner] disabled via scan-config.json');
-        return;
-      }
+      if (!this.scanConfig.enabled) {}
 
       // Load persisted state (for last_git_commit etc.)

[Survived] StringLiteral
src/daemon.mjs:1684:21
     try {
       this.scanConfig = loadScanConfig(this.projectDir);
       if (!this.scanConfig.enabled) {
-        console.log('[workspace-scanner] disabled via scan-config.json');
+        console.log("");
         return;
       }

[Survived] ConditionalExpression
src/daemon.mjs:1695:11
       this._workspaceWatcher = startWorkspaceWatcher(this);
 
       // Start .git/HEAD watcher
-      if (isGitRepo(this.projectDir)) {
+      if (false) {
         this._gitHeadWatcher = startGitHeadWatcher(this);
       }

[Survived] BlockStatement
src/daemon.mjs:1695:39
       this._workspaceWatcher = startWorkspaceWatcher(this);
 
       // Start .git/HEAD watcher
-      if (isGitRepo(this.projectDir)) {
-        this._gitHeadWatcher = startGitHeadWatcher(this);
-      }
+      if (isGitRepo(this.projectDir)) {}
 
       // Trigger initial scan in background (deferred 3s to avoid blocking startup)

[Survived] BlockStatement
src/daemon.mjs:1700:24
       }
 
       // Trigger initial scan in background (deferred 3s to avoid blocking startup)
-      setTimeout(() => {
-        this.triggerScan('incremental').catch(err => {
-          console.error('[workspace-scanner] initial scan failed:', err.message);
-        });
-      }, 3000);
+      setTimeout(() => {}, 3000);
 
       console.log('[workspace-scanner] initialized, first scan in 3s');

[Survived] BlockStatement
src/daemon.mjs:1701:54
 
       // Trigger initial scan in background (deferred 3s to avoid blocking startup)
       setTimeout(() => {
-        this.triggerScan('incremental').catch(err => {
-          console.error('[workspace-scanner] initial scan failed:', err.message);
-        });
+        this.triggerScan('incremental').catch(err => {});
       }, 3000);
 

[Survived] BlockStatement
src/daemon.mjs:1707:19
       }, 3000);
 
       console.log('[workspace-scanner] initialized, first scan in 3s');
-    } catch (err) {
-      console.error('[workspace-scanner] init failed (degraded):', err.message);
-    }
+    } catch (err) {}
   }
 

[Survived] StringLiteral
src/daemon.mjs:1723:28
    * @param {'full'|'incremental'} mode
    * @returns {Promise<import('./core/workspace-scanner.mjs').IndexResult>}
    */
-  async triggerScan(mode = 'incremental') {
+  async triggerScan(mode = "") {
     if (!this.indexer || !this.scanConfig?.enabled) {
       return { indexed: 0, skipped: 0, errors: 0, edges: 0 };

[Survived] BooleanLiteral
src/daemon.mjs:1724:26
    * @returns {Promise<import('./core/workspace-scanner.mjs').IndexResult>}
    */
   async triggerScan(mode = 'incremental') {
-    if (!this.indexer || !this.scanConfig?.enabled) {
+    if (!this.indexer || this.scanConfig?.enabled) {
       return { indexed: 0, skipped: 0, errors: 0, edges: 0 };
     }

[Survived] LogicalOperator
src/daemon.mjs:1724:9
    * @returns {Promise<import('./core/workspace-scanner.mjs').IndexResult>}
    */
   async triggerScan(mode = 'incremental') {
-    if (!this.indexer || !this.scanConfig?.enabled) {
+    if (!this.indexer && !this.scanConfig?.enabled) {
       return { indexed: 0, skipped: 0, errors: 0, edges: 0 };
     }

[Survived] EqualityOperator
src/daemon.mjs:1729:9
     }
 
     // Prevent concurrent scans
-    if (this.scanState.status === 'scanning' || this.scanState.status === 'indexing') {
+    if (this.scanState.status !== 'scanning' || this.scanState.status === 'indexing') {
       console.log('[workspace-scanner] scan already in progress, skipping');
       return { indexed: 0, skipped: 0, errors: 0, edges: 0 };

[Survived] ConditionalExpression
src/daemon.mjs:1729:9
     }
 
     // Prevent concurrent scans
-    if (this.scanState.status === 'scanning' || this.scanState.status === 'indexing') {
+    if (false) {
       console.log('[workspace-scanner] scan already in progress, skipping');
       return { indexed: 0, skipped: 0, errors: 0, edges: 0 };

[Survived] StringLiteral
src/daemon.mjs:1740:16
     try {
       this.scanState = updateScanState(this.scanState, {
         status: 'scanning',
-        phase: 'discovering',
+        phase: "",
       });
 

[Survived] LogicalOperator
src/daemon.mjs:1750:11
 
       let filesToIndex;
 
-      if (mode === 'incremental' && config.git_incremental && isGitRepo(this.projectDir)) {
+      if (mode === 'incremental' && config.git_incremental || isGitRepo(this.projectDir)) {
         const currentCommit = getCurrentCommit(this.projectDir);
         const lastCommit = this.scanState.last_git_commit;

[Survived] LogicalOperator
src/daemon.mjs:1750:11
 
       let filesToIndex;
 
-      if (mode === 'incremental' && config.git_incremental && isGitRepo(this.projectDir)) {
+      if (mode === 'incremental' || config.git_incremental && isGitRepo(this.projectDir)) {
         const currentCommit = getCurrentCommit(this.projectDir);
         const lastCommit = this.scanState.last_git_commit;

[Survived] BlockStatement
src/daemon.mjs:1754:60
         const currentCommit = getCurrentCommit(this.projectDir);
         const lastCommit = this.scanState.last_git_commit;
 
-        if (currentCommit && currentCommit === lastCommit) {
-          // No changes since last scan
-          this.scanState = updateScanState(this.scanState, {
-            status: 'idle',
-            phase: null,
-            last_incremental_at: new Date().toISOString(),
-          });
-          return { indexed: 0, skipped: 0, errors: 0, edges: 0 };
-        }
+        if (currentCommit && currentCommit === lastCommit) {}
 
         const gitChanges = getGitChanges(this.projectDir, lastCommit);

[Survived] LogicalOperator
src/daemon.mjs:1754:13
         const currentCommit = getCurrentCommit(this.projectDir);
         const lastCommit = this.scanState.last_git_commit;
 
-        if (currentCommit && currentCommit === lastCommit) {
+        if (currentCommit || currentCommit === lastCommit) {
           // No changes since last scan
           this.scanState = updateScanState(this.scanState, {

[Survived] ObjectLiteral
src/daemon.mjs:1756:60
 
         if (currentCommit && currentCommit === lastCommit) {
           // No changes since last scan
-          this.scanState = updateScanState(this.scanState, {
-            status: 'idle',
-            phase: null,
-            last_incremental_at: new Date().toISOString(),
-          });
+          this.scanState = updateScanState(this.scanState, {});
           return { indexed: 0, skipped: 0, errors: 0, edges: 0 };
         }

[Survived] ConditionalExpression
src/daemon.mjs:1766:13
 
         const gitChanges = getGitChanges(this.projectDir, lastCommit);
 
-        if (gitChanges) {
+        if (true) {
           // Handle deletions and renames first
           if (gitChanges.deleted.length > 0) {

[Survived] ConditionalExpression
src/daemon.mjs:1766:13
 
         const gitChanges = getGitChanges(this.projectDir, lastCommit);
 
-        if (gitChanges) {
+        if (false) {
           // Handle deletions and renames first
           if (gitChanges.deleted.length > 0) {

[Survived] ConditionalExpression
src/daemon.mjs:1768:15
 
         if (gitChanges) {
           // Handle deletions and renames first
-          if (gitChanges.deleted.length > 0) {
+          if (false) {
             markDeletedFiles(gitChanges.deleted, this.indexer);
           }

[Survived] BlockStatement
src/daemon.mjs:1768:46
 
         if (gitChanges) {
           // Handle deletions and renames first
-          if (gitChanges.deleted.length > 0) {
-            markDeletedFiles(gitChanges.deleted, this.indexer);
-          }
+          if (gitChanges.deleted.length > 0) {}
           if (gitChanges.renamed.length > 0) {
             handleRenamedFiles(gitChanges.renamed, this.indexer);

[Survived] EqualityOperator
src/daemon.mjs:1771:15
           if (gitChanges.deleted.length > 0) {
             markDeletedFiles(gitChanges.deleted, this.indexer);
           }
-          if (gitChanges.renamed.length > 0) {
+          if (gitChanges.renamed.length >= 0) {
             handleRenamedFiles(gitChanges.renamed, this.indexer);
           }

[Survived] ConditionalExpression
src/daemon.mjs:1771:15
           if (gitChanges.deleted.length > 0) {
             markDeletedFiles(gitChanges.deleted, this.indexer);
           }
-          if (gitChanges.renamed.length > 0) {
+          if (false) {
             handleRenamedFiles(gitChanges.renamed, this.indexer);
           }

[Survived] ArrowFunction
src/daemon.mjs:1779:39
           const changedPaths = [
             ...gitChanges.added,
             ...gitChanges.modified,
-            ...gitChanges.renamed.map(r => r.to),
+            ...gitChanges.renamed.map(() => undefined),
           ];
 

[Survived] MethodExpression
src/daemon.mjs:1782:26
             ...gitChanges.renamed.map(r => r.to),
           ];
 
-          filesToIndex = changedPaths
-            .map(relPath => {
-              const absPath = path.join(this.projectDir, relPath);
-              if (!fs.existsSync(absPath)) return null;
-
-              const classification = classifyFile(relPath, config);
-              if (classification.excluded) return null;
-              if (gitignore.isIgnored(relPath)) return null;
-
-              let stat;
-              try { stat = fs.statSync(absPath); } catch { return null; }
-
-              return {
-                absolutePath: absPath,
-                relativePath: relPath,
-                category: classification.category,
-                size: stat.size,
-                mtime: stat.mtimeMs,
-                oversized: stat.size > (config.max_file_size_kb || 500) * 1024,
-              };
-            })
-            .filter(Boolean);
+          filesToIndex = changedPaths.map(relPath => {
+  const absPath = path.join(this.projectDir, relPath);
+  if (!fs.existsSync(absPath)) return null;
+  const classification = classifyFile(relPath, config);
+  if (classification.excluded) return null;
+  if (gitignore.isIgnored(relPath)) return null;
+  let stat;
+  try {
+    stat = fs.statSync(absPath);
+  } catch {
+    return null;
+  }
+  return {
+    absolutePath: absPath,
+    relativePath: relPath,
+    category: classification.category,
+    size: stat.size,
+    mtime: stat.mtimeMs,
+    oversized: stat.size > (config.max_file_size_kb || 500) * 1024
+  };
+});
 
           // Update commit tracking

[Survived] BlockStatement
src/daemon.mjs:1783:29
           ];
 
           filesToIndex = changedPaths
-            .map(relPath => {
-              const absPath = path.join(this.projectDir, relPath);
-              if (!fs.existsSync(absPath)) return null;
-
-              const classification = classifyFile(relPath, config);
-              if (classification.excluded) return null;
-              if (gitignore.isIgnored(relPath)) return null;
-
-              let stat;
-              try { stat = fs.statSync(absPath); } catch { return null; }
-
-              return {
-                absolutePath: absPath,
-                relativePath: relPath,
-                category: classification.category,
-                size: stat.size,
-                mtime: stat.mtimeMs,
-                oversized: stat.size > (config.max_file_size_kb || 500) * 1024,
-              };
-            })
+            .map(relPath => {})
             .filter(Boolean);
 

[Survived] BooleanLiteral
src/daemon.mjs:1785:19
           filesToIndex = changedPaths
             .map(relPath => {
               const absPath = path.join(this.projectDir, relPath);
-              if (!fs.existsSync(absPath)) return null;
+              if (fs.existsSync(absPath)) return null;
 
               const classification = classifyFile(relPath, config);

[Survived] ConditionalExpression
src/daemon.mjs:1785:19
           filesToIndex = changedPaths
             .map(relPath => {
               const absPath = path.join(this.projectDir, relPath);
-              if (!fs.existsSync(absPath)) return null;
+              if (true) return null;
 
               const classification = classifyFile(relPath, config);

[Survived] ConditionalExpression
src/daemon.mjs:1788:19
               if (!fs.existsSync(absPath)) return null;
 
               const classification = classifyFile(relPath, config);
-              if (classification.excluded) return null;
+              if (false) return null;
               if (gitignore.isIgnored(relPath)) return null;
 

[Survived] ConditionalExpression
src/daemon.mjs:1788:19
               if (!fs.existsSync(absPath)) return null;
 
               const classification = classifyFile(relPath, config);
-              if (classification.excluded) return null;
+              if (true) return null;
               if (gitignore.isIgnored(relPath)) return null;
 

[Survived] ConditionalExpression
src/daemon.mjs:1789:19
 
               const classification = classifyFile(relPath, config);
               if (classification.excluded) return null;
-              if (gitignore.isIgnored(relPath)) return null;
+              if (false) return null;
 
               let stat;

[Survived] ConditionalExpression
src/daemon.mjs:1789:19
 
               const classification = classifyFile(relPath, config);
               if (classification.excluded) return null;
-              if (gitignore.isIgnored(relPath)) return null;
+              if (true) return null;
 
               let stat;

[Survived] BlockStatement
src/daemon.mjs:1792:58
               if (gitignore.isIgnored(relPath)) return null;
 
               let stat;
-              try { stat = fs.statSync(absPath); } catch { return null; }
+              try { stat = fs.statSync(absPath); } catch {}
 
               return {

[Survived] BlockStatement
src/daemon.mjs:1792:19
               if (gitignore.isIgnored(relPath)) return null;
 
               let stat;
-              try { stat = fs.statSync(absPath); } catch { return null; }
+              try {} catch { return null; }
 
               return {

[Survived] ObjectLiteral
src/daemon.mjs:1794:22
               let stat;
               try { stat = fs.statSync(absPath); } catch { return null; }
 
-              return {
-                absolutePath: absPath,
-                relativePath: relPath,
-                category: classification.category,
-                size: stat.size,
-                mtime: stat.mtimeMs,
-                oversized: stat.size > (config.max_file_size_kb || 500) * 1024,
-              };
+              return {};
             })
             .filter(Boolean);

[Survived] EqualityOperator
src/daemon.mjs:1800:28
                 category: classification.category,
                 size: stat.size,
                 mtime: stat.mtimeMs,
-                oversized: stat.size > (config.max_file_size_kb || 500) * 1024,
+                oversized: stat.size <= (config.max_file_size_kb || 500) * 1024,
               };
             })

[Survived] ConditionalExpression
src/daemon.mjs:1800:28
                 category: classification.category,
                 size: stat.size,
                 mtime: stat.mtimeMs,
-                oversized: stat.size > (config.max_file_size_kb || 500) * 1024,
+                oversized: false,
               };
             })

[Survived] ConditionalExpression
src/daemon.mjs:1806:15
             .filter(Boolean);
 
           // Update commit tracking
-          if (currentCommit) {
+          if (false) {
             this.scanState = updateScanState(this.scanState, {
               last_git_commit: currentCommit,

[Survived] BlockStatement
src/daemon.mjs:1806:30
             .filter(Boolean);
 
           // Update commit tracking
-          if (currentCommit) {
-            this.scanState = updateScanState(this.scanState, {
-              last_git_commit: currentCommit,
-            });
-          }
+          if (currentCommit) {}
         } else {
           // Git changes unavailable — do full scan

[Survived] ObjectLiteral
src/daemon.mjs:1807:62
 
           // Update commit tracking
           if (currentCommit) {
-            this.scanState = updateScanState(this.scanState, {
-              last_git_commit: currentCommit,
-            });
+            this.scanState = updateScanState(this.scanState, {});
           }
         } else {

[Survived] BlockStatement
src/daemon.mjs:1811:16
               last_git_commit: currentCommit,
             });
           }
-        } else {
-          // Git changes unavailable — do full scan
-          filesToIndex = scanWorkspace(this.projectDir, {
-            config,
-            gitignore,
-            signal: this._scanAbortController.signal,
-          });
-        }
+        } else {}
       } else {
         // Full scan

[Survived] BlockStatement
src/daemon.mjs:1819:14
             signal: this._scanAbortController.signal,
           });
         }
-      } else {
-        // Full scan
-        filesToIndex = scanWorkspace(this.projectDir, {
-          config,
-          gitignore,
-          signal: this._scanAbortController.signal,
-        });
-      }
+      } else {}
 
       this.scanState = updateScanState(this.scanState, {

[Survived] ObjectLiteral
src/daemon.mjs:1828:56
         });
       }
 
-      this.scanState = updateScanState(this.scanState, {
-        status: 'indexing',
-        phase: 'parsing',
-        discovered_total: filesToIndex.length,
-        index_total: filesToIndex.length,
-        index_done: 0,
-        index_skipped: 0,
-      });
+      this.scanState = updateScanState(this.scanState, {});
 
       // Index the files

[Survived] ObjectLiteral
src/daemon.mjs:1838:76
       });
 
       // Index the files
-      const result = await indexWorkspaceFiles(filesToIndex, this.indexer, {
-        signal: this._scanAbortController.signal,
-        onProgress: (progress) => {
-          this.scanState = updateScanState(this.scanState, {
-            index_done: progress.done,
-            index_skipped: progress.skipped,
-          });
-        },
-      });
+      const result = await indexWorkspaceFiles(filesToIndex, this.indexer, {});
 
       // Update git commit tracking (needed for both full and incremental scans)

[Survived] BlockStatement
src/daemon.mjs:1840:35
       // Index the files
       const result = await indexWorkspaceFiles(filesToIndex, this.indexer, {
         signal: this._scanAbortController.signal,
-        onProgress: (progress) => {
-          this.scanState = updateScanState(this.scanState, {
-            index_done: progress.done,
-            index_skipped: progress.skipped,
-          });
-        },
+        onProgress: (progress) => {},
       });
 

[Survived] ConditionalExpression
src/daemon.mjs:1849:11
       });
 
       // Update git commit tracking (needed for both full and incremental scans)
-      if (!this.scanState.last_git_commit && isGitRepo(this.projectDir)) {
+      if (false) {
         const headCommit = getCurrentCommit(this.projectDir);
         if (headCommit) {

[Survived] ConditionalExpression
src/daemon.mjs:1849:11
       });
 
       // Update git commit tracking (needed for both full and incremental scans)
-      if (!this.scanState.last_git_commit && isGitRepo(this.projectDir)) {
+      if (true) {
         const headCommit = getCurrentCommit(this.projectDir);
         if (headCommit) {

[Survived] ConditionalExpression
src/daemon.mjs:1851:13
       // Update git commit tracking (needed for both full and incremental scans)
       if (!this.scanState.last_git_commit && isGitRepo(this.projectDir)) {
         const headCommit = getCurrentCommit(this.projectDir);
-        if (headCommit) {
+        if (true) {
           this.scanState = updateScanState(this.scanState, {
             last_git_commit: headCommit,

[Survived] ConditionalExpression
src/daemon.mjs:1851:13
       // Update git commit tracking (needed for both full and incremental scans)
       if (!this.scanState.last_git_commit && isGitRepo(this.projectDir)) {
         const headCommit = getCurrentCommit(this.projectDir);
-        if (headCommit) {
+        if (false) {
           this.scanState = updateScanState(this.scanState, {
             last_git_commit: headCommit,

[Survived] ObjectLiteral
src/daemon.mjs:1852:60
       if (!this.scanState.last_git_commit && isGitRepo(this.projectDir)) {
         const headCommit = getCurrentCommit(this.projectDir);
         if (headCommit) {
-          this.scanState = updateScanState(this.scanState, {
-            last_git_commit: headCommit,
-          });
+          this.scanState = updateScanState(this.scanState, {});
         }
       }

[Survived] BlockStatement
src/daemon.mjs:1863:11
       let totalCodeFiles = 0;
       let totalDocFiles = 0;
       let totalSymbols = 0;
-      try {
-        totalFiles = this.indexer.db.prepare(
-          "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'file' AND status = 'active'"
-        ).get().c;
-        totalCodeFiles = this.indexer.db.prepare(
-          "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'file' AND status = 'active' AND json_extract(metadata, '$.category') = 'code'"
-        ).get().c;
-        totalDocFiles = this.indexer.db.prepare(
-          "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'file' AND status = 'active' AND json_extract(metadata, '$.category') = 'docs'"
-        ).get().c;
-        totalSymbols = this.indexer.db.prepare(
-          "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'symbol' AND status = 'active'"
-        ).get().c;
-      } catch { /* stats are non-critical */ }
+      try {} catch { /* stats are non-critical */ }
 
       const duration = Date.now() - startTime;

[Survived] StringLiteral
src/daemon.mjs:1871:11
           "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'file' AND status = 'active' AND json_extract(metadata, '$.category') = 'code'"
         ).get().c;
         totalDocFiles = this.indexer.db.prepare(
-          "SELECT count(*) AS c FROM graph_nodes WHERE node_type = 'file' AND status = 'active' AND json_extract(metadata, '$.category') = 'docs'"
+          ""
         ).get().c;
         totalSymbols = this.indexer.db.prepare(

[Survived] ArithmeticOperator
src/daemon.mjs:1878:24
         ).get().c;
       } catch { /* stats are non-critical */ }
 
-      const duration = Date.now() - startTime;
+      const duration = Date.now() + startTime;
       const scanType = mode === 'full' ? 'last_full_scan_at' : 'last_incremental_at';
 

[Survived] ConditionalExpression
src/daemon.mjs:1879:24
       } catch { /* stats are non-critical */ }
 
       const duration = Date.now() - startTime;
-      const scanType = mode === 'full' ? 'last_full_scan_at' : 'last_incremental_at';
+      const scanType = false ? 'last_full_scan_at' : 'last_incremental_at';
 
       this.scanState = updateScanState(this.scanState, {

[Survived] ConditionalExpression
src/daemon.mjs:1879:24
       } catch { /* stats are non-critical */ }
 
       const duration = Date.now() - startTime;
-      const scanType = mode === 'full' ? 'last_full_scan_at' : 'last_incremental_at';
+      const scanType = true ? 'last_full_scan_at' : 'last_incremental_at';
 
       this.scanState = updateScanState(this.scanState, {

[Survived] EqualityOperator
src/daemon.mjs:1895:33
       // Persist state
       saveScanState(this.projectDir, this.scanState);
 
-      if (result.indexed > 0 || result.edges > 0) {
+      if (result.indexed > 0 || result.edges <= 0) {
         console.log(
           `[workspace-scanner] ${mode} scan done: ${result.indexed} indexed, ${result.skipped} skipped, ${result.edges} edges (${duration}ms)`

[Survived] EqualityOperator
src/daemon.mjs:1895:11
       // Persist state
       saveScanState(this.projectDir, this.scanState);
 
-      if (result.indexed > 0 || result.edges > 0) {
+      if (result.indexed <= 0 || result.edges > 0) {
         console.log(
           `[workspace-scanner] ${mode} scan done: ${result.indexed} indexed, ${result.skipped} skipped, ${result.edges} edges (${duration}ms)`

[Survived] ConditionalExpression
src/daemon.mjs:1903:11
 
       // Fire-and-forget: embed graph nodes + generate similarity edges
       // Runs in background after scan completes — does not block return
-      if (result.indexed > 0 && this._embedder) {
+      if (true) {
         this._triggerGraphEmbedding();
       }

[Survived] ConditionalExpression
src/daemon.mjs:1903:11
 
       // Fire-and-forget: embed graph nodes + generate similarity edges
       // Runs in background after scan completes — does not block return
-      if (result.indexed > 0 && this._embedder) {
+      if (true && this._embedder) {
         this._triggerGraphEmbedding();
       }

[Survived] BlockStatement
src/daemon.mjs:1908:19
       }
 
       return result;
-    } catch (err) {
-      this.scanState = appendScanError(
-        updateScanState(this.scanState, { status: 'error', phase: null }),
-        err.message
-      );
-      saveScanState(this.projectDir, this.scanState);
-      console.error('[workspace-scanner] scan error:', err.message);
-      return { indexed: 0, skipped: 0, errors: 1, edges: 0 };
-    }
+    } catch (err) {}
   }
 

[Survived] StringLiteral
src/daemon.mjs:1914:21
         err.message
       );
       saveScanState(this.projectDir, this.scanState);
-      console.error('[workspace-scanner] scan error:', err.message);
+      console.error("", err.message);
       return { indexed: 0, skipped: 0, errors: 1, edges: 0 };
     }

[Survived] ObjectLiteral
src/daemon.mjs:1929:54
    */
   _triggerGraphEmbedding() {
     // Update state to show embedding phase
-    this.scanState = updateScanState(this.scanState, {
-      status: 'indexing',
-      phase: 'embedding',
-      embed_total: 0,
-      embed_done: 0,
-    });
+    this.scanState = updateScanState(this.scanState, {});
 
     runGraphEmbeddingPipeline(this, {

[Survived] ObjectLiteral
src/daemon.mjs:1936:37
       embed_done: 0,
     });
 
-    runGraphEmbeddingPipeline(this, {
-      onProgress: (done, total) => {
-        this.scanState = updateScanState(this.scanState, {
-          embed_total: total,
-          embed_done: done,
-        });
-      },
-    })
+    runGraphEmbeddingPipeline(this, {})
       .then(({ embedding, similarity }) => {
         this.scanState = updateScanState(this.scanState, {

[Survived] BlockStatement
src/daemon.mjs:1937:36
     });
 
     runGraphEmbeddingPipeline(this, {
-      onProgress: (done, total) => {
-        this.scanState = updateScanState(this.scanState, {
-          embed_total: total,
-          embed_done: done,
-        });
-      },
+      onProgress: (done, total) => {},
     })
       .then(({ embedding, similarity }) => {

[Survived] ObjectLiteral
src/daemon.mjs:1938:58
 
     runGraphEmbeddingPipeline(this, {
       onProgress: (done, total) => {
-        this.scanState = updateScanState(this.scanState, {
-          embed_total: total,
-          embed_done: done,
-        });
+        this.scanState = updateScanState(this.scanState, {});
       },
     })

[Survived] BlockStatement
src/daemon.mjs:1944:44
         });
       },
     })
-      .then(({ embedding, similarity }) => {
-        this.scanState = updateScanState(this.scanState, {
-          status: 'idle',
-          phase: null,
-          embed_total: embedding.total,
-          embed_done: embedding.embedded,
-        });
-        saveScanState(this.projectDir, this.scanState);
-      })
+      .then(({ embedding, similarity }) => {})
       .catch((err) => {
         console.warn('[graph-embedder] pipeline error:', err.message);

[Survived] BlockStatement
src/daemon.mjs:1953:23
         });
         saveScanState(this.projectDir, this.scanState);
       })
-      .catch((err) => {
-        console.warn('[graph-embedder] pipeline error:', err.message);
-        this.scanState = updateScanState(this.scanState, {
-          status: 'idle',
-          phase: null,
-        });
-        saveScanState(this.projectDir, this.scanState);
-      });
+      .catch((err) => {});
   }
 
