[Survived] BlockStatement
src/daemon.mjs:1971:27
    * Start a 24-hour interval that recalculates skill decay scores.
    * Also runs once at startup.
    */
-  _startSkillDecayTimer() {
-    const TWENTY_FOUR_HOURS = 24 * 60 * 60 * 1000;
-    // Run once at startup (deferred so it doesn't block start)
-    setTimeout(() => this._runSkillDecay(), 5000);
-    this._skillDecayTimer = setInterval(
-      () => this._runSkillDecay(),
-      TWENTY_FOUR_HOURS,
-    );
-    // Allow process to exit even if timer is pending
-    if (this._skillDecayTimer.unref) this._skillDecayTimer.unref();
-  }
+  _startSkillDecayTimer() {}
 
   /**

[Survived] ArithmeticOperator
src/daemon.mjs:1972:31
    * Also runs once at startup.
    */
   _startSkillDecayTimer() {
-    const TWENTY_FOUR_HOURS = 24 * 60 * 60 * 1000;
+    const TWENTY_FOUR_HOURS = 24 / 60 * 60 * 1000;
     // Run once at startup (deferred so it doesn't block start)
     setTimeout(() => this._runSkillDecay(), 5000);

[Survived] ArithmeticOperator
src/daemon.mjs:1972:31
    * Also runs once at startup.
    */
   _startSkillDecayTimer() {
-    const TWENTY_FOUR_HOURS = 24 * 60 * 60 * 1000;
+    const TWENTY_FOUR_HOURS = 24 * 60 * 60 / 1000;
     // Run once at startup (deferred so it doesn't block start)
     setTimeout(() => this._runSkillDecay(), 5000);

[Survived] ArrowFunction
src/daemon.mjs:1974:16
   _startSkillDecayTimer() {
     const TWENTY_FOUR_HOURS = 24 * 60 * 60 * 1000;
     // Run once at startup (deferred so it doesn't block start)
-    setTimeout(() => this._runSkillDecay(), 5000);
+    setTimeout(() => undefined, 5000);
     this._skillDecayTimer = setInterval(
       () => this._runSkillDecay(),

[Survived] ArrowFunction
src/daemon.mjs:1976:7
     // Run once at startup (deferred so it doesn't block start)
     setTimeout(() => this._runSkillDecay(), 5000);
     this._skillDecayTimer = setInterval(
-      () => this._runSkillDecay(),
+      () => undefined,
       TWENTY_FOUR_HOURS,
     );

[Survived] ConditionalExpression
src/daemon.mjs:1980:9
       TWENTY_FOUR_HOURS,
     );
     // Allow process to exit even if timer is pending
-    if (this._skillDecayTimer.unref) this._skillDecayTimer.unref();
+    if (true) this._skillDecayTimer.unref();
   }
 

[Survived] ConditionalExpression
src/daemon.mjs:1980:9
       TWENTY_FOUR_HOURS,
     );
     // Allow process to exit even if timer is pending
-    if (this._skillDecayTimer.unref) this._skillDecayTimer.unref();
+    if (false) this._skillDecayTimer.unref();
   }
 

[Survived] LogicalOperator
src/daemon.mjs:1992:9
    * Pinned skills always keep decay_score = 1.0.
    */
   _runSkillDecay() {
-    if (!this.indexer || !this.indexer.db) return;
+    if (!this.indexer && !this.indexer.db) return;
     try {
       const now = Date.now();

[Survived] BooleanLiteral
src/daemon.mjs:1992:26
    * Pinned skills always keep decay_score = 1.0.
    */
   _runSkillDecay() {
-    if (!this.indexer || !this.indexer.db) return;
+    if (!this.indexer || this.indexer.db) return;
     try {
       const now = Date.now();

[Survived] StringLiteral
src/daemon.mjs:1997:14
       const now = Date.now();
       const skills = this.indexer.db
         .prepare('SELECT id, last_used_at, usage_count, pinned FROM skills WHERE status = ?')
-        .all('active');
+        .all("");
 
       const update = this.indexer.db.prepare(

[Survived] StringLiteral
src/daemon.mjs:2000:9
         .all('active');
 
       const update = this.indexer.db.prepare(
-        'UPDATE skills SET decay_score = ?, updated_at = ? WHERE id = ?',
+        "",
       );
 

[Survived] ArithmeticOperator
src/daemon.mjs:2006:22
       const nowISO_ = new Date(now).toISOString();
       const LN_20 = Math.log(20);
       const HALF_LIFE_DAYS = 30;
-      const LAMBDA = 0.693 / HALF_LIFE_DAYS; // ln(2) / half-life
+      const LAMBDA = 0.693 * HALF_LIFE_DAYS; // ln(2) / half-life
 
       const batch = this.indexer.db.transaction(() => {

[Survived] BlockStatement
src/daemon.mjs:2008:55
       const HALF_LIFE_DAYS = 30;
       const LAMBDA = 0.693 / HALF_LIFE_DAYS; // ln(2) / half-life
 
-      const batch = this.indexer.db.transaction(() => {
-        for (const skill of skills) {
-          if (skill.pinned) {
-            update.run(1.0, nowISO_, skill.id);
-            continue;
-          }
-          const lastUsed = skill.last_used_at
-            ? new Date(skill.last_used_at).getTime()
-            : now;
-          const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
-          const baseDecay = Math.exp(-LAMBDA * daysSince);
-          const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
-          const score = Math.min(1.0, baseDecay + usageBoost);
-          update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
-        }
-      });
+      const batch = this.indexer.db.transaction(() => {});
       batch();
 

[Survived] BlockStatement
src/daemon.mjs:2009:37
       const LAMBDA = 0.693 / HALF_LIFE_DAYS; // ln(2) / half-life
 
       const batch = this.indexer.db.transaction(() => {
-        for (const skill of skills) {
-          if (skill.pinned) {
-            update.run(1.0, nowISO_, skill.id);
-            continue;
-          }
-          const lastUsed = skill.last_used_at
-            ? new Date(skill.last_used_at).getTime()
-            : now;
-          const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
-          const baseDecay = Math.exp(-LAMBDA * daysSince);
-          const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
-          const score = Math.min(1.0, baseDecay + usageBoost);
-          update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
-        }
+        for (const skill of skills) {}
       });
       batch();

[Survived] ConditionalExpression
src/daemon.mjs:2010:15
 
       const batch = this.indexer.db.transaction(() => {
         for (const skill of skills) {
-          if (skill.pinned) {
+          if (false) {
             update.run(1.0, nowISO_, skill.id);
             continue;

[Survived] BlockStatement
src/daemon.mjs:2010:29
 
       const batch = this.indexer.db.transaction(() => {
         for (const skill of skills) {
-          if (skill.pinned) {
-            update.run(1.0, nowISO_, skill.id);
-            continue;
-          }
+          if (skill.pinned) {}
           const lastUsed = skill.last_used_at
             ? new Date(skill.last_used_at).getTime()

[Survived] ArithmeticOperator
src/daemon.mjs:2017:30
           const lastUsed = skill.last_used_at
             ? new Date(skill.last_used_at).getTime()
             : now;
-          const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
+          const daysSince = (now + lastUsed) / (1000 * 60 * 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;

[Survived] ArithmeticOperator
src/daemon.mjs:2017:49
           const lastUsed = skill.last_used_at
             ? new Date(skill.last_used_at).getTime()
             : now;
-          const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
+          const daysSince = (now - lastUsed) / (1000 * 60 / 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;

[Survived] UnaryOperator
src/daemon.mjs:2018:38
             ? new Date(skill.last_used_at).getTime()
             : now;
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
-          const baseDecay = Math.exp(-LAMBDA * daysSince);
+          const baseDecay = Math.exp(+LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);

[Survived] ArithmeticOperator
src/daemon.mjs:2018:38
             ? new Date(skill.last_used_at).getTime()
             : now;
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
-          const baseDecay = Math.exp(-LAMBDA * daysSince);
+          const baseDecay = Math.exp(-LAMBDA / daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);

[Survived] ConditionalExpression
src/daemon.mjs:2019:40
             : now;
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
-          const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
+          const usageBoost = Math.log((false) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);
           update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);

[Survived] ConditionalExpression
src/daemon.mjs:2019:40
             : now;
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
-          const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
+          const usageBoost = Math.log((true) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);
           update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);

[Survived] MethodExpression
src/daemon.mjs:2020:25
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
-          const score = Math.min(1.0, baseDecay + usageBoost);
+          const score = Math.max(1.0, baseDecay + usageBoost);
           update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
         }

[Survived] ArithmeticOperator
src/daemon.mjs:2020:39
           const daysSince = (now - lastUsed) / (1000 * 60 * 60 * 24);
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
-          const score = Math.min(1.0, baseDecay + usageBoost);
+          const score = Math.min(1.0, baseDecay - usageBoost);
           update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
         }

[Survived] ArithmeticOperator
src/daemon.mjs:2021:22
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);
-          update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
+          update.run(Math.round(score * 1000) * 1000, nowISO_, skill.id);
         }
       });

[Survived] ArithmeticOperator
src/daemon.mjs:2021:33
           const baseDecay = Math.exp(-LAMBDA * daysSince);
           const usageBoost = Math.log((skill.usage_count || 0) + 1) / LN_20;
           const score = Math.min(1.0, baseDecay + usageBoost);
-          update.run(Math.round(score * 1000) / 1000, nowISO_, skill.id);
+          update.run(Math.round(score / 1000) / 1000, nowISO_, skill.id);
         }
       });

[Survived] ConditionalExpression
src/daemon.mjs:2026:11
       });
       batch();
 
-      if (skills.length > 0) {
+      if (false) {
         console.log(`[awareness-local] skill decay: updated ${skills.length} skills`);
       }

[Survived] BlockStatement
src/daemon.mjs:2026:30
       });
       batch();
 
-      if (skills.length > 0) {
-        console.log(`[awareness-local] skill decay: updated ${skills.length} skills`);
-      }
+      if (skills.length > 0) {}
     } catch (err) {
       console.error('[awareness-local] skill decay error:', err.message);

[Survived] BlockStatement
src/daemon.mjs:2029:19
       if (skills.length > 0) {
         console.log(`[awareness-local] skill decay: updated ${skills.length} skills`);
       }
-    } catch (err) {
-      console.error('[awareness-local] skill decay error:', err.message);
-    }
+    } catch (err) {}
   }
 

[Survived] ConditionalExpression
src/daemon.mjs:2043:9
    * Closes current indexer/search, re-initializes with new project's .awareness/ data.
    */
   async switchProject(newProjectDir) {
-    if (!fs.existsSync(newProjectDir)) {
+    if (true) {
       throw new Error(`Project directory does not exist: ${newProjectDir}`);
     }

[Survived] ConditionalExpression
src/daemon.mjs:2043:9
    * Closes current indexer/search, re-initializes with new project's .awareness/ data.
    */
   async switchProject(newProjectDir) {
-    if (!fs.existsSync(newProjectDir)) {
+    if (false) {
       throw new Error(`Project directory does not exist: ${newProjectDir}`);
     }

[Survived] BooleanLiteral
src/daemon.mjs:2047:23
       throw new Error(`Project directory does not exist: ${newProjectDir}`);
     }
 
-    this._switching = true;
+    this._switching = false;
     try {
       const newAwarenessDir = path.join(newProjectDir, AWARENESS_DIR);

[Survived] ConditionalExpression
src/daemon.mjs:2053:11
       console.log(`[awareness-local] switching project: ${this.projectDir} → ${newProjectDir}`);
 
       // 1. Stop watchers & timers
-      if (this.watcher) { this.watcher.close(); this.watcher = null; }
+      if (false) { this.watcher.close(); this.watcher = null; }
       if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }

[Survived] ConditionalExpression
src/daemon.mjs:2053:11
       console.log(`[awareness-local] switching project: ${this.projectDir} → ${newProjectDir}`);
 
       // 1. Stop watchers & timers
-      if (this.watcher) { this.watcher.close(); this.watcher = null; }
+      if (true) { this.watcher.close(); this.watcher = null; }
       if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }

[Survived] ConditionalExpression
src/daemon.mjs:2054:11
 
       // 1. Stop watchers & timers
       if (this.watcher) { this.watcher.close(); this.watcher = null; }
-      if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
+      if (true) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
 

[Survived] ConditionalExpression
src/daemon.mjs:2054:11
 
       // 1. Stop watchers & timers
       if (this.watcher) { this.watcher.close(); this.watcher = null; }
-      if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
+      if (false) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
 

[Survived] BlockStatement
src/daemon.mjs:2055:27
       // 1. Stop watchers & timers
       if (this.watcher) { this.watcher.close(); this.watcher = null; }
       if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
-      if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
+      if (this.cloudSync) {}
 
       // 2. Close old indexer

[Survived] ConditionalExpression
src/daemon.mjs:2055:11
       // 1. Stop watchers & timers
       if (this.watcher) { this.watcher.close(); this.watcher = null; }
       if (this._reindexTimer) { clearTimeout(this._reindexTimer); this._reindexTimer = null; }
-      if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
+      if (true) { this.cloudSync.stop(); this.cloudSync = null; }
 
       // 2. Close old indexer

[Survived] ConditionalExpression
src/daemon.mjs:2058:11
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
 
       // 2. Close old indexer
-      if (this.indexer && this.indexer.close) {
+      if (true) {
         this.indexer.close();
       }

[Survived] ConditionalExpression
src/daemon.mjs:2058:11
       if (this.cloudSync) { this.cloudSync.stop(); this.cloudSync = null; }
 
       // 2. Close old indexer
-      if (this.indexer && this.indexer.close) {
+      if (false) {
         this.indexer.close();
       }

[Survived] BooleanLiteral
src/daemon.mjs:2070:75
       this.logFile = path.join(this.awarenessDir, LOG_FILENAME);
 
       // 4. Ensure directory structure
-      fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: true });
+      fs.mkdirSync(path.join(this.awarenessDir, 'memories'), { recursive: false });
       fs.mkdirSync(path.join(this.awarenessDir, 'knowledge'), { recursive: true });
       fs.mkdirSync(path.join(this.awarenessDir, 'tasks'), { recursive: true });

[Survived] BlockStatement
src/daemon.mjs:2076:11
 
       // 5. Re-init core modules
       this.memoryStore = new MemoryStore(this.projectDir);
-      try {
-        this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-      } catch (e) {
+      try {} catch (e) {
         console.error(`[awareness-local] SQLite indexer unavailable after switch: ${e.message}`);
         this.indexer = createNoopIndexer();

[Survived] StringLiteral
src/daemon.mjs:2077:65
       // 5. Re-init core modules
       this.memoryStore = new MemoryStore(this.projectDir);
       try {
-        this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
+        this.indexer = new Indexer(path.join(this.awarenessDir, ""));
       } catch (e) {
         console.error(`[awareness-local] SQLite indexer unavailable after switch: ${e.message}`);

[Survived] BlockStatement
src/daemon.mjs:2078:19
       this.memoryStore = new MemoryStore(this.projectDir);
       try {
         this.indexer = new Indexer(path.join(this.awarenessDir, 'index.db'));
-      } catch (e) {
-        console.error(`[awareness-local] SQLite indexer unavailable after switch: ${e.message}`);
-        this.indexer = createNoopIndexer();
-      }
+      } catch (e) {}
       this.search = await this._loadSearchEngine();
       this.extractor = await this._loadKnowledgeExtractor();

[Survived] BlockStatement
src/daemon.mjs:2086:11
       this.extractor = await this._loadKnowledgeExtractor();
 
       // 6. Incremental index
-      try {
-        const result = await this.indexer.incrementalIndex(this.memoryStore);
-        console.log(`[awareness-local] re-indexed: ${result.indexed} files, ${result.skipped} skipped`);
-      } catch (err) {
+      try {} catch (err) {
         console.error('[awareness-local] re-index error:', err.message);
       }

[Survived] BlockStatement
src/daemon.mjs:2089:21
       try {
         const result = await this.indexer.incrementalIndex(this.memoryStore);
         console.log(`[awareness-local] re-indexed: ${result.indexed} files, ${result.skipped} skipped`);
-      } catch (err) {
-        console.error('[awareness-local] re-index error:', err.message);
-      }
+      } catch (err) {}
 
       // 7. Restart cloud sync if configured

[Survived] OptionalChaining
src/daemon.mjs:2095:11
 
       // 7. Restart cloud sync if configured
       const config = this._loadConfig();
-      if (config.cloud?.enabled) {
+      if (config.cloud.enabled) {
         try {
           const { CloudSync } = await import('./core/cloud-sync.mjs');

[Survived] BlockStatement
src/daemon.mjs:2095:34
 
       // 7. Restart cloud sync if configured
       const config = this._loadConfig();
-      if (config.cloud?.enabled) {
-        try {
-          const { CloudSync } = await import('./core/cloud-sync.mjs');
-          this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-          this.cloudSync.start().catch(() => {});
-        } catch { /* CloudSync not available */ }
-      }
+      if (config.cloud?.enabled) {}
 
       // 8. Update workspace registry

[Survived] BlockStatement
src/daemon.mjs:2096:13
       // 7. Restart cloud sync if configured
       const config = this._loadConfig();
       if (config.cloud?.enabled) {
-        try {
-          const { CloudSync } = await import('./core/cloud-sync.mjs');
-          this.cloudSync = new CloudSync(config, this.indexer, this.memoryStore);
-          this.cloudSync.start().catch(() => {});
-        } catch { /* CloudSync not available */ }
+        try {} catch { /* CloudSync not available */ }
       }
 

[Survived] BlockStatement
src/daemon.mjs:2104:11
       }
 
       // 8. Update workspace registry
-      try {
-        const { registerWorkspace } = await import('./core/config.mjs');
-        registerWorkspace(newProjectDir, { port: this.port });
-      } catch { /* config.mjs not available */ }
+      try {} catch { /* config.mjs not available */ }
 
       console.log(`[awareness-local] switched to: ${newProjectDir} (${this.indexer.getStats().totalMemories} memories)`);

[Survived] ObjectLiteral
src/daemon.mjs:2106:42
       // 8. Update workspace registry
       try {
         const { registerWorkspace } = await import('./core/config.mjs');
-        registerWorkspace(newProjectDir, { port: this.port });
+        registerWorkspace(newProjectDir, {});
       } catch { /* config.mjs not available */ }
 

[Survived] ObjectLiteral
src/daemon.mjs:2110:14
       } catch { /* config.mjs not available */ }
 
       console.log(`[awareness-local] switched to: ${newProjectDir} (${this.indexer.getStats().totalMemories} memories)`);
-      return { projectDir: newProjectDir, stats: this.indexer.getStats() };
+      return {};
     } finally {
       this._switching = false;

[Survived] BlockStatement
src/daemon.mjs:2111:15
 
       console.log(`[awareness-local] switched to: ${newProjectDir} (${this.indexer.getStats().totalMemories} memories)`);
       return { projectDir: newProjectDir, stats: this.indexer.getStats() };
-    } finally {
-      this._switching = false;
-    }
+    } finally {}
   }
 

[Survived] BooleanLiteral
src/daemon.mjs:2112:25
       console.log(`[awareness-local] switched to: ${newProjectDir} (${this.indexer.getStats().totalMemories} memories)`);
       return { projectDir: newProjectDir, stats: this.indexer.getStats() };
     } finally {
-      this._switching = false;
+      this._switching = true;
     }
   }

[Survived] BlockStatement
src/daemon.mjs:2117:17
   }
 
   /** Load .awareness/config.json (or return defaults). */
-  _loadConfig() {
-    return loadDaemonConfig({
-      awarenessDir: this.awarenessDir,
-      port: this.port,
-    });
-  }
+  _loadConfig() {}
 
   /**

[Survived] BlockStatement
src/daemon.mjs:2132:41
    * @param {string} errMsg - The error message from the failed require()
    * @returns {Promise<boolean>} true if rebuild succeeded
    */
-  async _tryRebuildBetterSqlite(errMsg) {
-    try {
-      const match = errMsg.match(/The module '(.+?better-sqlite3.+?\.node)'/);
-      if (!match) return false;
-      const moduleDir = match[1].split('/build/')[0];
-      const { execSync } = await import('node:child_process');
-      console.log(`[awareness-local] Node.js version changed — auto-rebuilding better-sqlite3 for ${process.version}...`);
-      execSync('npm rebuild', { cwd: moduleDir, stdio: 'pipe' });
-      console.log('[awareness-local] better-sqlite3 rebuilt successfully');
-      return true;
-    } catch (rebuildErr) {
-      console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);
-      console.error('[awareness-local] Falling back to file-only mode (no search)');
-      return false;
-    }
-  }
+  async _tryRebuildBetterSqlite(errMsg) {}
 
   /** Load awareness-spec.json from the bundled spec directory. */

[Survived] BlockStatement
src/daemon.mjs:2133:9
    * @returns {Promise<boolean>} true if rebuild succeeded
    */
   async _tryRebuildBetterSqlite(errMsg) {
-    try {
-      const match = errMsg.match(/The module '(.+?better-sqlite3.+?\.node)'/);
-      if (!match) return false;
-      const moduleDir = match[1].split('/build/')[0];
-      const { execSync } = await import('node:child_process');
-      console.log(`[awareness-local] Node.js version changed — auto-rebuilding better-sqlite3 for ${process.version}...`);
-      execSync('npm rebuild', { cwd: moduleDir, stdio: 'pipe' });
-      console.log('[awareness-local] better-sqlite3 rebuilt successfully');
-      return true;
-    } catch (rebuildErr) {
+    try {} catch (rebuildErr) {
       console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);
       console.error('[awareness-local] Falling back to file-only mode (no search)');

[Survived] Regex
src/daemon.mjs:2134:34
    */
   async _tryRebuildBetterSqlite(errMsg) {
     try {
-      const match = errMsg.match(/The module '(.+?better-sqlite3.+?\.node)'/);
+      const match = errMsg.match(/The module '(.better-sqlite3.+?\.node)'/);
       if (!match) return false;
       const moduleDir = match[1].split('/build/')[0];

[Survived] ConditionalExpression
src/daemon.mjs:2135:11
   async _tryRebuildBetterSqlite(errMsg) {
     try {
       const match = errMsg.match(/The module '(.+?better-sqlite3.+?\.node)'/);
-      if (!match) return false;
+      if (false) return false;
       const moduleDir = match[1].split('/build/')[0];
       const { execSync } = await import('node:child_process');

[Survived] ConditionalExpression
src/daemon.mjs:2135:11
   async _tryRebuildBetterSqlite(errMsg) {
     try {
       const match = errMsg.match(/The module '(.+?better-sqlite3.+?\.node)'/);
-      if (!match) return false;
+      if (true) return false;
       const moduleDir = match[1].split('/build/')[0];
       const { execSync } = await import('node:child_process');

[Survived] BooleanLiteral
src/daemon.mjs:2141:14
       console.log(`[awareness-local] Node.js version changed — auto-rebuilding better-sqlite3 for ${process.version}...`);
       execSync('npm rebuild', { cwd: moduleDir, stdio: 'pipe' });
       console.log('[awareness-local] better-sqlite3 rebuilt successfully');
-      return true;
+      return false;
     } catch (rebuildErr) {
       console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);

[Survived] BlockStatement
src/daemon.mjs:2142:26
       execSync('npm rebuild', { cwd: moduleDir, stdio: 'pipe' });
       console.log('[awareness-local] better-sqlite3 rebuilt successfully');
       return true;
-    } catch (rebuildErr) {
-      console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);
-      console.error('[awareness-local] Falling back to file-only mode (no search)');
-      return false;
-    }
+    } catch (rebuildErr) {}
   }
 

[Survived] StringLiteral
src/daemon.mjs:2143:21
       console.log('[awareness-local] better-sqlite3 rebuilt successfully');
       return true;
     } catch (rebuildErr) {
-      console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);
+      console.error(``);
       console.error('[awareness-local] Falling back to file-only mode (no search)');
       return false;

[Survived] BooleanLiteral
src/daemon.mjs:2145:14
     } catch (rebuildErr) {
       console.error(`[awareness-local] Auto-rebuild failed: ${rebuildErr.message}`);
       console.error('[awareness-local] Falling back to file-only mode (no search)');
-      return false;
+      return true;
     }
   }

[Survived] BlockStatement
src/daemon.mjs:2150:15
   }
 
   /** Load awareness-spec.json from the bundled spec directory. */
-  _loadSpec() {
-    return loadDaemonSpec(import.meta.url);
-  }
+  _loadSpec() {}
 
   // -----------------------------------------------------------------------

[Survived] BlockStatement
src/daemon.mjs:2162:25
    * Lazy-load the embedder module (shared by SearchEngine + KnowledgeExtractor).
    * Caches at this._embedder. Returns null when unavailable (graceful degradation).
    */
-  async _loadEmbedder() {
-    this._embedder = await loadEmbedderModule({
-      importMetaUrl: import.meta.url,
-      cachedEmbedder: this._embedder,
-    });
-    return this._embedder;
-  }
+  async _loadEmbedder() {}
 
   /** Try to load SearchEngine from Phase 1 core. Returns null if not available. */

[Survived] BlockStatement
src/daemon.mjs:2171:29
   }
 
   /** Try to load SearchEngine from Phase 1 core. Returns null if not available. */
-  async _loadSearchEngine() {
-    return loadSearchEngineModule({
-      importMetaUrl: import.meta.url,
-      indexer: this.indexer,
-      memoryStore: this.memoryStore,
-      loadEmbedder: () => this._loadEmbedder(),
-    });
-  }
+  async _loadSearchEngine() {}
 
   /** Try to load KnowledgeExtractor from Phase 1 core. Returns null if not available. */

[Survived] ArrowFunction
src/daemon.mjs:2176:21
       importMetaUrl: import.meta.url,
       indexer: this.indexer,
       memoryStore: this.memoryStore,
-      loadEmbedder: () => this._loadEmbedder(),
+      loadEmbedder: () => undefined,
     });
   }

[Survived] BlockStatement
src/daemon.mjs:2181:35
   }
 
   /** Try to load KnowledgeExtractor from Phase 1 core. Returns null if not available. */
-  async _loadKnowledgeExtractor() {
-    return loadKnowledgeExtractorModule({
-      importMetaUrl: import.meta.url,
-      memoryStore: this.memoryStore,
-      indexer: this.indexer,
-      loadEmbedder: () => this._loadEmbedder(),
-    });
-  }
+  async _loadKnowledgeExtractor() {}
 
   // -----------------------------------------------------------------------

[Survived] ArrowFunction
src/daemon.mjs:2186:21
       importMetaUrl: import.meta.url,
       memoryStore: this.memoryStore,
       indexer: this.indexer,
-      loadEmbedder: () => this._loadEmbedder(),
+      loadEmbedder: () => undefined,
     });
   }

[Survived] OptionalChaining
src/daemon.mjs:2200:36
    */
   async _refineMocTitles(mocIds) {
     const config = this._loadConfig();
-    if (!config.cloud?.enabled || !config.cloud?.api_key) return;
+    if (!config.cloud?.enabled || !config.cloud.api_key) return;
 
     const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
