[Survived] LogicalOperator
src/daemon.mjs:2200:9
    */
   async _refineMocTitles(mocIds) {
     const config = this._loadConfig();
-    if (!config.cloud?.enabled || !config.cloud?.api_key) return;
+    if (!config.cloud?.enabled && !config.cloud?.api_key) return;
 
     const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';

[Survived] ConditionalExpression
src/daemon.mjs:2202:21
     const config = this._loadConfig();
     if (!config.cloud?.enabled || !config.cloud?.api_key) return;
 
-    const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
+    const apiBase = true;
     const memoryId = config.cloud.memory_id;
     const apiKey = config.cloud.api_key;

[Survived] ConditionalExpression
src/daemon.mjs:2202:21
     const config = this._loadConfig();
     if (!config.cloud?.enabled || !config.cloud?.api_key) return;
 
-    const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
+    const apiBase = false;
     const memoryId = config.cloud.memory_id;
     const apiKey = config.cloud.api_key;

[Survived] BlockStatement
src/daemon.mjs:2207:59
     const apiKey = config.cloud.api_key;
 
     // Simple LLM inference via cloud API's chat endpoint
-    const llmInfer = async (systemPrompt, userContent) => {
-      const { httpJson } = await import('./daemon/cloud-http.mjs');
-      const resp = await httpJson('POST', `${apiBase}/memories/${memoryId}/chat`, {
-        messages: [
-          { role: 'system', content: systemPrompt },
-          { role: 'user', content: userContent },
-        ],
-        max_tokens: 200,
-      }, { Authorization: `Bearer ${apiKey}` });
-      // The chat endpoint may return different formats
-      if (typeof resp === 'string') return resp;
-      return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
-    };
+    const llmInfer = async (systemPrompt, userContent) => {};
 
     for (const mocId of mocIds) {

[Survived] StringLiteral
src/daemon.mjs:2215:27
           { role: 'user', content: userContent },
         ],
         max_tokens: 200,
-      }, { Authorization: `Bearer ${apiKey}` });
+      }, { Authorization: `` });
       // The chat endpoint may return different formats
       if (typeof resp === 'string') return resp;

[Survived] ConditionalExpression
src/daemon.mjs:2217:11
         max_tokens: 200,
       }, { Authorization: `Bearer ${apiKey}` });
       // The chat endpoint may return different formats
-      if (typeof resp === 'string') return resp;
+      if (true) return resp;
       return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
     };

[Survived] ConditionalExpression
src/daemon.mjs:2217:11
         max_tokens: 200,
       }, { Authorization: `Bearer ${apiKey}` });
       // The chat endpoint may return different formats
-      if (typeof resp === 'string') return resp;
+      if (false) return resp;
       return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
     };

[Survived] OptionalChaining
src/daemon.mjs:2218:31
       }, { Authorization: `Bearer ${apiKey}` });
       // The chat endpoint may return different formats
       if (typeof resp === 'string') return resp;
-      return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
+      return resp?.content || resp?.choices?.[0].message?.content || JSON.stringify(resp);
     };
 

[Survived] ConditionalExpression
src/daemon.mjs:2218:14
       }, { Authorization: `Bearer ${apiKey}` });
       // The chat endpoint may return different formats
       if (typeof resp === 'string') return resp;
-      return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
+      return true;
     };
 

[Survived] BlockStatement
src/daemon.mjs:2221:33
       return resp?.content || resp?.choices?.[0]?.message?.content || JSON.stringify(resp);
     };
 
-    for (const mocId of mocIds) {
-      try {
-        await this.indexer.refineMocWithLlm(mocId, llmInfer);
-      } catch (err) {
-        // Non-fatal — tag-based title remains
-        if (process.env.DEBUG) {
-          console.warn(`[awareness-local] MOC LLM refine failed for ${mocId}: ${err.message}`);
-        }
-      }
-    }
+    for (const mocId of mocIds) {}
   }
 

[Survived] BlockStatement
src/daemon.mjs:2222:11
     };
 
     for (const mocId of mocIds) {
-      try {
-        await this.indexer.refineMocWithLlm(mocId, llmInfer);
-      } catch (err) {
+      try {} catch (err) {
         // Non-fatal — tag-based title remains
         if (process.env.DEBUG) {

[Survived] BlockStatement
src/daemon.mjs:2224:21
     for (const mocId of mocIds) {
       try {
         await this.indexer.refineMocWithLlm(mocId, llmInfer);
-      } catch (err) {
-        // Non-fatal — tag-based title remains
-        if (process.env.DEBUG) {
-          console.warn(`[awareness-local] MOC LLM refine failed for ${mocId}: ${err.message}`);
-        }
-      }
+      } catch (err) {}
     }
   }

[Survived] ConditionalExpression
src/daemon.mjs:2226:13
         await this.indexer.refineMocWithLlm(mocId, llmInfer);
       } catch (err) {
         // Non-fatal — tag-based title remains
-        if (process.env.DEBUG) {
+        if (false) {
           console.warn(`[awareness-local] MOC LLM refine failed for ${mocId}: ${err.message}`);
         }

[Survived] BlockStatement
src/daemon.mjs:2226:32
         await this.indexer.refineMocWithLlm(mocId, llmInfer);
       } catch (err) {
         // Non-fatal — tag-based title remains
-        if (process.env.DEBUG) {
-          console.warn(`[awareness-local] MOC LLM refine failed for ${mocId}: ${err.message}`);
-        }
+        if (process.env.DEBUG) {}
       }
     }

[Survived] ConditionalExpression
src/daemon.mjs:2252:9
   async _checkPerceptionResolution(newMemoryId, newMemory) {
     // Rate limit: 1 check per memory per 60s
     const now = Date.now();
-    if (!this._lastResolveCheckAt) this._lastResolveCheckAt = 0;
+    if (true) this._lastResolveCheckAt = 0;
     if (now - this._lastResolveCheckAt < 60000) return;
     this._lastResolveCheckAt = now;

[Survived] BooleanLiteral
src/daemon.mjs:2252:9
   async _checkPerceptionResolution(newMemoryId, newMemory) {
     // Rate limit: 1 check per memory per 60s
     const now = Date.now();
-    if (!this._lastResolveCheckAt) this._lastResolveCheckAt = 0;
+    if (this._lastResolveCheckAt) this._lastResolveCheckAt = 0;
     if (now - this._lastResolveCheckAt < 60000) return;
     this._lastResolveCheckAt = now;

[Survived] ConditionalExpression
src/daemon.mjs:2253:9
     // Rate limit: 1 check per memory per 60s
     const now = Date.now();
     if (!this._lastResolveCheckAt) this._lastResolveCheckAt = 0;
-    if (now - this._lastResolveCheckAt < 60000) return;
+    if (true) return;
     this._lastResolveCheckAt = now;
 

[Survived] ConditionalExpression
src/daemon.mjs:2253:9
     // Rate limit: 1 check per memory per 60s
     const now = Date.now();
     if (!this._lastResolveCheckAt) this._lastResolveCheckAt = 0;
-    if (now - this._lastResolveCheckAt < 60000) return;
+    if (false) return;
     this._lastResolveCheckAt = now;
 

[Survived] BooleanLiteral
src/daemon.mjs:2258:35
 
     // Only if cloud is enabled (we route LLM calls through cloud API)
     const config = this._loadConfig();
-    if (!config.cloud?.enabled || !config.cloud?.api_key) return;
+    if (!config.cloud?.enabled || config.cloud?.api_key) return;
 
     // Fetch active perceptions that support auto-resolution

[Survived] BooleanLiteral
src/daemon.mjs:2261:9
     if (!config.cloud?.enabled || !config.cloud?.api_key) return;
 
     // Fetch active perceptions that support auto-resolution
-    if (!this.indexer?.listPerceptionStates) return;
+    if (this.indexer?.listPerceptionStates) return;
     const activeStates = this.indexer.listPerceptionStates({
       state: ['active', 'snoozed'],

[Survived] ConditionalExpression
src/daemon.mjs:2261:9
     if (!config.cloud?.enabled || !config.cloud?.api_key) return;
 
     // Fetch active perceptions that support auto-resolution
-    if (!this.indexer?.listPerceptionStates) return;
+    if (false) return;
     const activeStates = this.indexer.listPerceptionStates({
       state: ['active', 'snoozed'],

[Survived] MethodExpression
src/daemon.mjs:2266:24
       state: ['active', 'snoozed'],
       limit: 50,
     });
-    const candidates = activeStates.filter((s) =>
-      ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
-    );
+    const candidates = activeStates;
     if (candidates.length === 0) return;
 

[Survived] ArrowFunction
src/daemon.mjs:2266:44
       state: ['active', 'snoozed'],
       limit: 50,
     });
-    const candidates = activeStates.filter((s) =>
-      ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
+    const candidates = activeStates.filter(() => undefined
     );
     if (candidates.length === 0) return;

[Survived] ArrayDeclaration
src/daemon.mjs:2267:7
       limit: 50,
     });
     const candidates = activeStates.filter((s) =>
-      ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
+      [].includes(s.signal_type)
     );
     if (candidates.length === 0) return;

[Survived] StringLiteral
src/daemon.mjs:2267:45
       limit: 50,
     });
     const candidates = activeStates.filter((s) =>
-      ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
+      ['guard', 'contradiction', 'pattern', ""].includes(s.signal_type)
     );
     if (candidates.length === 0) return;

[Survived] ConditionalExpression
src/daemon.mjs:2269:9
     const candidates = activeStates.filter((s) =>
       ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
     );
-    if (candidates.length === 0) return;
+    if (true) return;
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory

[Survived] EqualityOperator
src/daemon.mjs:2269:9
     const candidates = activeStates.filter((s) =>
       ['guard', 'contradiction', 'pattern', 'staleness'].includes(s.signal_type)
     );
-    if (candidates.length === 0) return;
+    if (candidates.length !== 0) return;
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory

[Survived] ConditionalExpression
src/daemon.mjs:2272:30
     if (candidates.length === 0) return;
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
-    const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
+    const memTags = new Set((true).map((t) => String(t).toLowerCase()));
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;

[Survived] ConditionalExpression
src/daemon.mjs:2272:30
     if (candidates.length === 0) return;
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
-    const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
+    const memTags = new Set((false).map((t) => String(t).toLowerCase()));
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;

[Survived] ConditionalExpression
src/daemon.mjs:2273:49
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
     const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
-    const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
+    const memText = `${newMemory.title || ''} ${false}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);

[Survived] ConditionalExpression
src/daemon.mjs:2273:24
 
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
     const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
-    const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
+    const memText = `${false} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);

[Survived] OptionalChaining
src/daemon.mjs:2274:25
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
     const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
-    const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
+    const newCategory = newMemory.insights.knowledge_cards?.[0]?.category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
     if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve

[Survived] OptionalChaining
src/daemon.mjs:2274:25
     // Pre-filter: only signals with tag/keyword/source_card overlap with new memory
     const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
-    const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
+    const newCategory = newMemory.insights?.knowledge_cards?.[0].category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
     if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve

[Survived] StringLiteral
src/daemon.mjs:2275:48
     const memTags = new Set((newMemory.tags || []).map((t) => String(t).toLowerCase()));
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
-    const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
+    const isFixCategory = ['problem_solution', ""].includes(newCategory);
     if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve
 

[Survived] ConditionalExpression
src/daemon.mjs:2276:9
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
-    if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve
+    if (true) return; // Only problem_solution/decision/null can resolve
 
     const filtered = candidates.filter((sig) => {

[Survived] ConditionalExpression
src/daemon.mjs:2276:9
     const memText = `${newMemory.title || ''} ${newMemory.content || ''}`.toLowerCase();
     const newCategory = newMemory.insights?.knowledge_cards?.[0]?.category;
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
-    if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve
+    if (false) return; // Only problem_solution/decision/null can resolve
 
     const filtered = candidates.filter((sig) => {

[Survived] MethodExpression
src/daemon.mjs:2278:22
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
     if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve
 
-    const filtered = candidates.filter((sig) => {
-      // Check tag overlap (signal metadata may have tags)
-      let sigTags = [];
-      try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
-      const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
-
-      // Check keyword mention in title
-      const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
-      const hasKeyword = sigWords.some((w) => memText.includes(w));
-
-      // Check source card reference
-      const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
-      const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
-
-      return hasTagOverlap || hasKeyword || refsSourceCard;
-    });
+    const filtered = candidates;
 
     if (filtered.length === 0) return;

[Survived] BlockStatement
src/daemon.mjs:2278:49
     const isFixCategory = ['problem_solution', 'decision'].includes(newCategory);
     if (!isFixCategory && newCategory) return; // Only problem_solution/decision/null can resolve
 
-    const filtered = candidates.filter((sig) => {
-      // Check tag overlap (signal metadata may have tags)
-      let sigTags = [];
-      try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
-      const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
-
-      // Check keyword mention in title
-      const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
-      const hasKeyword = sigWords.some((w) => memText.includes(w));
-
-      // Check source card reference
-      const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
-      const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
-
-      return hasTagOverlap || hasKeyword || refsSourceCard;
-    });
+    const filtered = candidates.filter((sig) => {});
 
     if (filtered.length === 0) return;

[Survived] ArrayDeclaration
src/daemon.mjs:2280:21
 
     const filtered = candidates.filter((sig) => {
       // Check tag overlap (signal metadata may have tags)
-      let sigTags = [];
+      let sigTags = ["Stryker was here"];
       try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
       const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));

[Survived] ConditionalExpression
src/daemon.mjs:2281:23
     const filtered = candidates.filter((sig) => {
       // Check tag overlap (signal metadata may have tags)
       let sigTags = [];
-      try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
+      try { sigTags = false; } catch {}
       const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
 

[Survived] ConditionalExpression
src/daemon.mjs:2281:23
     const filtered = candidates.filter((sig) => {
       // Check tag overlap (signal metadata may have tags)
       let sigTags = [];
-      try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
+      try { sigTags = true; } catch {}
       const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
 

[Survived] MethodExpression
src/daemon.mjs:2282:29
       // Check tag overlap (signal metadata may have tags)
       let sigTags = [];
       try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
-      const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
+      const hasTagOverlap = sigTags.every(t => memTags.has(String(t).toLowerCase()));
 
       // Check keyword mention in title

[Survived] MethodExpression
src/daemon.mjs:2282:61
       // Check tag overlap (signal metadata may have tags)
       let sigTags = [];
       try { sigTags = JSON.parse(sig.metadata || '{}').tags || []; } catch {}
-      const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
+      const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toUpperCase()));
 
       // Check keyword mention in title

[Survived] MethodExpression
src/daemon.mjs:2285:24
       const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
 
       // Check keyword mention in title
-      const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+      const sigWords = (sig.title || '').toUpperCase().split(/\s+/).filter((w) => w.length > 3);
       const hasKeyword = sigWords.some((w) => memText.includes(w));
 

[Survived] MethodExpression
src/daemon.mjs:2285:24
       const hasTagOverlap = sigTags.some((t) => memTags.has(String(t).toLowerCase()));
 
       // Check keyword mention in title
-      const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+      const sigWords = (sig.title || '').toLowerCase().split(/\s+/);
       const hasKeyword = sigWords.some((w) => memText.includes(w));
 

[Survived] MethodExpression
src/daemon.mjs:2286:26
 
       // Check keyword mention in title
       const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
-      const hasKeyword = sigWords.some((w) => memText.includes(w));
+      const hasKeyword = sigWords.every(w => memText.includes(w));
 
       // Check source card reference

[Survived] ArrowFunction
src/daemon.mjs:2286:40
 
       // Check keyword mention in title
       const sigWords = (sig.title || '').toLowerCase().split(/\s+/).filter((w) => w.length > 3);
-      const hasKeyword = sigWords.some((w) => memText.includes(w));
+      const hasKeyword = sigWords.some(() => undefined);
 
       // Check source card reference

[Survived] ConditionalExpression
src/daemon.mjs:2289:30
       const hasKeyword = sigWords.some((w) => memText.includes(w));
 
       // Check source card reference
-      const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
+      const sourceMemories = false;
       const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
 

[Survived] OptionalChaining
src/daemon.mjs:2289:30
       const hasKeyword = sigWords.some((w) => memText.includes(w));
 
       // Check source card reference
-      const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
+      const sourceMemories = newMemory.insights?.knowledge_cards?.[0].source_memories || [];
       const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
 

[Survived] ConditionalExpression
src/daemon.mjs:2290:30
 
       // Check source card reference
       const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
-      const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
+      const refsSourceCard = true;
 
       return hasTagOverlap || hasKeyword || refsSourceCard;

[Survived] LogicalOperator
src/daemon.mjs:2290:30
 
       // Check source card reference
       const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
-      const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
+      const refsSourceCard = sig.source_card_id || sourceMemories.includes(sig.source_card_id);
 
       return hasTagOverlap || hasKeyword || refsSourceCard;

[Survived] LogicalOperator
src/daemon.mjs:2292:14
       const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
       const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
 
-      return hasTagOverlap || hasKeyword || refsSourceCard;
+      return hasTagOverlap && hasKeyword || refsSourceCard;
     });
 

[Survived] LogicalOperator
src/daemon.mjs:2292:14
       const sourceMemories = newMemory.insights?.knowledge_cards?.[0]?.source_memories || [];
       const refsSourceCard = sig.source_card_id && sourceMemories.includes(sig.source_card_id);
 
-      return hasTagOverlap || hasKeyword || refsSourceCard;
+      return (hasTagOverlap || hasKeyword) && refsSourceCard;
     });
 

[Survived] ConditionalExpression
src/daemon.mjs:2295:9
       return hasTagOverlap || hasKeyword || refsSourceCard;
     });
 
-    if (filtered.length === 0) return;
+    if (false) return;
 
     // Build batch prompt

[Survived] EqualityOperator
src/daemon.mjs:2295:9
       return hasTagOverlap || hasKeyword || refsSourceCard;
     });
 
-    if (filtered.length === 0) return;
+    if (filtered.length !== 0) return;
 
     // Build batch prompt

[Survived] ConditionalExpression
src/daemon.mjs:2319:10
 Return JSON only: {"results": [{"signal_id":"...","status":"resolved|irrelevant|still_active","reason":"..."}]}`;
 
     const userContent = `NEW MEMORY:
-Title: ${newMemory.title || '(no title)'}
+Title: ${false}
 Content: ${(newMemory.content || '').slice(0, 500)}
 Tags: ${[...memTags].join(', ') || '(none)'}

[Survived] LogicalOperator
src/daemon.mjs:2319:10
 Return JSON only: {"results": [{"signal_id":"...","status":"resolved|irrelevant|still_active","reason":"..."}]}`;
 
     const userContent = `NEW MEMORY:
-Title: ${newMemory.title || '(no title)'}
+Title: ${newMemory.title && '(no title)'}
 Content: ${(newMemory.content || '').slice(0, 500)}
 Tags: ${[...memTags].join(', ') || '(none)'}

[Survived] LogicalOperator
src/daemon.mjs:2320:13
 
     const userContent = `NEW MEMORY:
 Title: ${newMemory.title || '(no title)'}
-Content: ${(newMemory.content || '').slice(0, 500)}
+Content: ${(newMemory.content && '').slice(0, 500)}
 Tags: ${[...memTags].join(', ') || '(none)'}
 

[Survived] ConditionalExpression
src/daemon.mjs:2320:13
 
     const userContent = `NEW MEMORY:
 Title: ${newMemory.title || '(no title)'}
-Content: ${(newMemory.content || '').slice(0, 500)}
+Content: ${(true).slice(0, 500)}
 Tags: ${[...memTags].join(', ') || '(none)'}
 

[Survived] ConditionalExpression
src/daemon.mjs:2321:9
     const userContent = `NEW MEMORY:
 Title: ${newMemory.title || '(no title)'}
 Content: ${(newMemory.content || '').slice(0, 500)}
-Tags: ${[...memTags].join(', ') || '(none)'}
+Tags: ${false}
 
 SIGNALS TO CHECK:

[Survived] LogicalOperator
src/daemon.mjs:2321:9
     const userContent = `NEW MEMORY:
 Title: ${newMemory.title || '(no title)'}
 Content: ${(newMemory.content || '').slice(0, 500)}
-Tags: ${[...memTags].join(', ') || '(none)'}
+Tags: ${[...memTags].join(', ') && '(none)'}
 
 SIGNALS TO CHECK:

[Survived] ConditionalExpression
src/daemon.mjs:2324:62
 Tags: ${[...memTags].join(', ') || '(none)'}
 
 SIGNALS TO CHECK:
-${filtered.map((s) => `[${s.signal_id}] (${s.signal_type}) ${s.title || s.signal_id}`).join('\n')}`;
+${filtered.map((s) => `[${s.signal_id}] (${s.signal_type}) ${false}`).join('\n')}`;
 
     try {

[Survived] ConditionalExpression
src/daemon.mjs:2324:62
 Tags: ${[...memTags].join(', ') || '(none)'}
 
 SIGNALS TO CHECK:
-${filtered.map((s) => `[${s.signal_id}] (${s.signal_type}) ${s.title || s.signal_id}`).join('\n')}`;
+${filtered.map((s) => `[${s.signal_id}] (${s.signal_type}) ${true}`).join('\n')}`;
 
     try {

[Survived] ConditionalExpression
src/daemon.mjs:2328:23
 
     try {
       const { httpJson } = await import('./daemon/cloud-http.mjs');
-      const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
+      const apiBase = true;
       const memoryId = config.cloud.memory_id;
       const apiKey = config.cloud.api_key;

[Survived] ConditionalExpression
src/daemon.mjs:2328:23
 
     try {
       const { httpJson } = await import('./daemon/cloud-http.mjs');
-      const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
+      const apiBase = false;
       const memoryId = config.cloud.memory_id;
       const apiKey = config.cloud.api_key;

[Survived] StringLiteral
src/daemon.mjs:2331:43
       const apiBase = config.cloud.api_base || 'https://awareness.market/api/v1';
       const memoryId = config.cloud.memory_id;
       const apiKey = config.cloud.api_key;
-      const resp = await httpJson('POST', `${apiBase}/memories/${memoryId}/chat`, {
+      const resp = await httpJson('POST', ``, {
         messages: [
           { role: 'system', content: systemPrompt },

[Survived] StringLiteral
src/daemon.mjs:2333:19
       const apiKey = config.cloud.api_key;
       const resp = await httpJson('POST', `${apiBase}/memories/${memoryId}/chat`, {
         messages: [
-          { role: 'system', content: systemPrompt },
+          { role: "", content: systemPrompt },
           { role: 'user', content: userContent },
         ],

[Survived] ConditionalExpression
src/daemon.mjs:2339:19
         max_tokens: 500,
       }, { Authorization: `Bearer ${apiKey}` });
 
-      const raw = typeof resp === 'string' ? resp
+      const raw = true ? resp
         : resp?.content || resp?.choices?.[0]?.message?.content || '';
       if (!raw) return;

[Survived] EqualityOperator
src/daemon.mjs:2339:19
         max_tokens: 500,
       }, { Authorization: `Bearer ${apiKey}` });
 
-      const raw = typeof resp === 'string' ? resp
+      const raw = typeof resp !== 'string' ? resp
         : resp?.content || resp?.choices?.[0]?.message?.content || '';
       if (!raw) return;

[Survived] OptionalChaining
src/daemon.mjs:2340:28
       }, { Authorization: `Bearer ${apiKey}` });
 
       const raw = typeof resp === 'string' ? resp
-        : resp?.content || resp?.choices?.[0]?.message?.content || '';
+        : resp?.content || resp?.choices?.[0]?.message.content || '';
       if (!raw) return;
 

[Survived] ConditionalExpression
src/daemon.mjs:2340:11
       }, { Authorization: `Bearer ${apiKey}` });
 
       const raw = typeof resp === 'string' ? resp
-        : resp?.content || resp?.choices?.[0]?.message?.content || '';
+        : true;
       if (!raw) return;
 

[Survived] ConditionalExpression
src/daemon.mjs:2341:11
 
       const raw = typeof resp === 'string' ? resp
         : resp?.content || resp?.choices?.[0]?.message?.content || '';
-      if (!raw) return;
+      if (false) return;
 
       // Parse JSON response (robust — grab first JSON object)
