[Survived] ConditionalExpression
src/daemon.mjs:2341:11
 
       const raw = typeof resp === 'string' ? resp
         : resp?.content || resp?.choices?.[0]?.message?.content || '';
-      if (!raw) return;
+      if (true) return;
 
       // Parse JSON response (robust — grab first JSON object)

[Survived] Regex
src/daemon.mjs:2344:35
       if (!raw) return;
 
       // Parse JSON response (robust — grab first JSON object)
-      const jsonMatch = raw.match(/\{[\s\S]*\}/);
+      const jsonMatch = raw.match(/\{[\S\S]*\}/);
       if (!jsonMatch) return;
       const parsed = JSON.parse(jsonMatch[0]);

[Survived] Regex
src/daemon.mjs:2344:35
       if (!raw) return;
 
       // Parse JSON response (robust — grab first JSON object)
-      const jsonMatch = raw.match(/\{[\s\S]*\}/);
+      const jsonMatch = raw.match(/\{[\s\s]*\}/);
       if (!jsonMatch) return;
       const parsed = JSON.parse(jsonMatch[0]);

[Survived] ConditionalExpression
src/daemon.mjs:2345:11
 
       // Parse JSON response (robust — grab first JSON object)
       const jsonMatch = raw.match(/\{[\s\S]*\}/);
-      if (!jsonMatch) return;
+      if (true) return;
       const parsed = JSON.parse(jsonMatch[0]);
       const results = Array.isArray(parsed.results) ? parsed.results : [];

[Survived] BooleanLiteral
src/daemon.mjs:2345:11
 
       // Parse JSON response (robust — grab first JSON object)
       const jsonMatch = raw.match(/\{[\s\S]*\}/);
-      if (!jsonMatch) return;
+      if (jsonMatch) return;
       const parsed = JSON.parse(jsonMatch[0]);
       const results = Array.isArray(parsed.results) ? parsed.results : [];

[Survived] BlockStatement
src/daemon.mjs:2349:32
       const parsed = JSON.parse(jsonMatch[0]);
       const results = Array.isArray(parsed.results) ? parsed.results : [];
 
-      for (const r of results) {
-        if (r.status === 'resolved' && r.signal_id) {
-          this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
-          console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
-        }
-      }
+      for (const r of results) {}
     } catch (err) {
       if (process.env.DEBUG) {

[Survived] EqualityOperator
src/daemon.mjs:2350:13
       const results = Array.isArray(parsed.results) ? parsed.results : [];
 
       for (const r of results) {
-        if (r.status === 'resolved' && r.signal_id) {
+        if (r.status !== 'resolved' && r.signal_id) {
           this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
           console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);

[Survived] LogicalOperator
src/daemon.mjs:2350:13
       const results = Array.isArray(parsed.results) ? parsed.results : [];
 
       for (const r of results) {
-        if (r.status === 'resolved' && r.signal_id) {
+        if (r.status === 'resolved' || r.signal_id) {
           this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
           console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);

[Survived] LogicalOperator
src/daemon.mjs:2351:72
 
       for (const r of results) {
         if (r.status === 'resolved' && r.signal_id) {
-          this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
+          this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason && 'Auto-resolved by LLM');
           console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
         }

[Survived] ConditionalExpression
src/daemon.mjs:2351:72
 
       for (const r of results) {
         if (r.status === 'resolved' && r.signal_id) {
-          this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
+          this.indexer.autoResolvePerception(r.signal_id, newMemoryId, true);
           console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
         }

[Survived] MethodExpression
src/daemon.mjs:2352:87
       for (const r of results) {
         if (r.status === 'resolved' && r.signal_id) {
           this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
-          console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
+          console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${r.reason || ''}`);
         }
       }

[Survived] ConditionalExpression
src/daemon.mjs:2352:88
       for (const r of results) {
         if (r.status === 'resolved' && r.signal_id) {
           this.indexer.autoResolvePerception(r.signal_id, newMemoryId, r.reason || 'Auto-resolved by LLM');
-          console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
+          console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(false).slice(0, 80)}`);
         }
       }

[Survived] BlockStatement
src/daemon.mjs:2355:19
           console.log(`[awareness-local] perception auto-resolved: ${r.signal_id} — ${(r.reason || '').slice(0, 80)}`);
         }
       }
-    } catch (err) {
-      if (process.env.DEBUG) {
-        console.warn(`[awareness-local] LLM perception resolve failed: ${err.message}`);
-      }
-    }
+    } catch (err) {}
   }
 

[Survived] BlockStatement
src/daemon.mjs:2356:30
         }
       }
     } catch (err) {
-      if (process.env.DEBUG) {
-        console.warn(`[awareness-local] LLM perception resolve failed: ${err.message}`);
-      }
+      if (process.env.DEBUG) {}
     }
   }

[Survived] ConditionalExpression
src/daemon.mjs:2356:11
         }
       }
     } catch (err) {
-      if (process.env.DEBUG) {
+      if (true) {
         console.warn(`[awareness-local] LLM perception resolve failed: ${err.message}`);
       }

[Survived] StringLiteral
src/daemon.mjs:2357:22
       }
     } catch (err) {
       if (process.env.DEBUG) {
-        console.warn(`[awareness-local] LLM perception resolve failed: ${err.message}`);
+        console.warn(``);
       }
     }

[Survived] BlockStatement
src/daemon.mjs:2367:19
   // -----------------------------------------------------------------------
 
   /** Remove stale PID file. */
-  _cleanPidFile() {
-    try {
-      if (fs.existsSync(this.pidFile)) {
-        fs.unlinkSync(this.pidFile);
-      }
-    } catch {
-      // ignore
-    }
-  }
+  _cleanPidFile() {}
 }
 

[Survived] BlockStatement
src/daemon.mjs:2368:9
 
   /** Remove stale PID file. */
   _cleanPidFile() {
-    try {
-      if (fs.existsSync(this.pidFile)) {
-        fs.unlinkSync(this.pidFile);
-      }
-    } catch {
+    try {} catch {
       // ignore
     }

[Survived] BlockStatement
src/daemon.mjs:2369:40
   /** Remove stale PID file. */
   _cleanPidFile() {
     try {
-      if (fs.existsSync(this.pidFile)) {
-        fs.unlinkSync(this.pidFile);
-      }
+      if (fs.existsSync(this.pidFile)) {}
     } catch {
       // ignore

[Survived] BlockStatement
src/daemon.mjs:2378:41
   }
 }
 
-function detectGuardProfile(projectDir) {
-  const explicit = process.env.AWARENESS_LOCAL_GUARD_PROFILE;
-  if (explicit) return explicit;
-  const awarenessMarkers = [
-    path.join(projectDir, 'backend', 'awareness-spec.json'),
-    path.join(projectDir, 'docs', 'prd', 'deployment-guide.md'),
-  ];
-  return awarenessMarkers.every((marker) => fs.existsSync(marker)) ? 'awareness' : 'generic';
-}
+function detectGuardProfile(projectDir) {}
 
 export default AwarenessLocalDaemon;

[Survived] ConditionalExpression
src/daemon.mjs:2380:7
 
 function detectGuardProfile(projectDir) {
   const explicit = process.env.AWARENESS_LOCAL_GUARD_PROFILE;
-  if (explicit) return explicit;
+  if (true) return explicit;
   const awarenessMarkers = [
     path.join(projectDir, 'backend', 'awareness-spec.json'),

[Survived] ConditionalExpression
src/daemon.mjs:2380:7
 
 function detectGuardProfile(projectDir) {
   const explicit = process.env.AWARENESS_LOCAL_GUARD_PROFILE;
-  if (explicit) return explicit;
+  if (false) return explicit;
   const awarenessMarkers = [
     path.join(projectDir, 'backend', 'awareness-spec.json'),

[Survived] ArrayDeclaration
src/daemon.mjs:2381:28
 function detectGuardProfile(projectDir) {
   const explicit = process.env.AWARENESS_LOCAL_GUARD_PROFILE;
   if (explicit) return explicit;
-  const awarenessMarkers = [
-    path.join(projectDir, 'backend', 'awareness-spec.json'),
-    path.join(projectDir, 'docs', 'prd', 'deployment-guide.md'),
-  ];
+  const awarenessMarkers = [];
   return awarenessMarkers.every((marker) => fs.existsSync(marker)) ? 'awareness' : 'generic';
 }

[Survived] StringLiteral
src/daemon.mjs:2382:27
   const explicit = process.env.AWARENESS_LOCAL_GUARD_PROFILE;
   if (explicit) return explicit;
   const awarenessMarkers = [
-    path.join(projectDir, 'backend', 'awareness-spec.json'),
+    path.join(projectDir, "", 'awareness-spec.json'),
     path.join(projectDir, 'docs', 'prd', 'deployment-guide.md'),
   ];

[Survived] ArrowFunction
src/daemon.mjs:2385:33
     path.join(projectDir, 'backend', 'awareness-spec.json'),
     path.join(projectDir, 'docs', 'prd', 'deployment-guide.md'),
   ];
-  return awarenessMarkers.every((marker) => fs.existsSync(marker)) ? 'awareness' : 'generic';
+  return awarenessMarkers.every(() => undefined) ? 'awareness' : 'generic';
 }
 

[Survived] MethodExpression
src/daemon.mjs:2385:10
     path.join(projectDir, 'backend', 'awareness-spec.json'),
     path.join(projectDir, 'docs', 'prd', 'deployment-guide.md'),
   ];
-  return awarenessMarkers.every((marker) => fs.existsSync(marker)) ? 'awareness' : 'generic';
+  return awarenessMarkers.some(marker => fs.existsSync(marker)) ? 'awareness' : 'generic';
 }
 
